<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['custom_profile_fields'] = "รายระเอียดโปรไฟล์ที่กำหนดเอง";
$l['custom_profile_fields_desc'] = "ส่วนนี้จะช่วยให้คุณสามารถแก้ไขลบและจัดการด้านรายละเอียดของคุณเอง.";
$l['add_profile_field'] = "เพิ่มเขตข้อมูลรายละเอียด";
$l['add_new_profile_field'] = "เพิ่มรายละเอียดข้อมูล";
$l['add_new_profile_field_desc'] = "ที่นี่คุณสามารถเพิ่มเขตข้อมูลรายละเอียดที่กำหนดเองใหม่.";
$l['edit_profile_field'] = "แก้ไขข้อมูลส่วนตัว";
$l['edit_profile_field_desc'] = "ที่นี่คุณสามารถแก้ไขเขตข้อมูลรายละเอียดที่กำหนดเอง";

$l['title'] = "ชื่อเรื่อง";
$l['short_description'] = "คำอธิบายสั้น";
$l['maximum_length'] = "ความยาวสูงสุด";
$l['maximum_length_desc'] = "จำนวนสูงสุดของตัวอักษรที่สามารถป้อน นี้ใช้เฉพาะกับกล่องข้อความและพื้นที่ข้อความ";
$l['field_length'] = "ความยาวเขตข้อมูล";
$l['field_length_desc'] = "ความยาวของสนามนี้ นี้ใช้เฉพาะกับกล่องที่เลือกเดียวหรือหลาย";
$l['display_order'] = "แสดงคำสั่";
$l['display_order_desc'] = "นี้เป็นคำสั่งของเขตข้อมูลรายละเอียดที่กำหนดเองในความสัมพันธ์กับเขตข้อมูลรายละเอียดที่กำหนดเองอื่น ๆ หมายเลขนี้ไม่ควรจะเป็นเช่นเดียวกับข้อมูลอื่น.";
$l['text'] = "กล่องข้อความ";
$l['textarea'] = "พิมพ์ข้อความ";
$l['select'] = "เลือกกล่อง";
$l['multiselect'] = "เลือกกล่องตัวเลือกหลาย";
$l['radio'] = "ปุ่มเรดิโอ";
$l['checkbox'] = "ตรวจสอบกล่อง";
$l['field_type'] = "ประเภทข้อมูล";
$l['field_type_desc'] = "นี่คือประเภทข้อมูลที่จะแสดง.";
$l['field_regex'] = "แสดงผลปกติ";
$l['field_regex_desc'] = "ใส่ข้อมูลแสดงผลปกติที่ควรได้รับจับคู่จากที่ผู้ใช้ป้อน คุณต้องให้แน่ใจว่าการแสดงออกปกติถูกต้องและ safe—no การตรวจสอบจะดำเนินการ สำหรับสิ่งที่ว่าง<br />
<strong>ตัวอย่าง:</strong> ([a-z0-9_\- ,.+]+)";
$l['selectable_options'] = "ตัวเลือกที่เลือก?";
$l['selectable_options_desc'] = "กรุณากรอกตัวเลือกในแต่ละบรรทัดที่แยกต่างหาก นี้ใช้เฉพาะกับกล่องเลือกช่องทำเครื่องหมายและประเภทปุ่มเรดิโอ";
$l['required'] = "จำเป็นต้องใช้?";
$l['required_desc'] = "ฟิลด์นี้จะต้องได้รับการเติมเต็มในระหว่างการลงทะเบียนหรือรายละเอียดการแก้ไข? โปรดทราบว่านี้ใช้ไม่ได้หากข้อมูลถูกซ่อนหรือที่ไม่สามารถแก้ไขได้.";
$l['show_on_registration'] = "แสดงการจดทะเบียน";
$l['show_on_registration_desc'] = "ฟิลด์นี้ควรปรากฏบนแบบฟอร์มลงทะเบียน? โปรดทราบว่านี้ใช้ไม่ได้ถ้าฟิลด์ไม่สามารถแก้ไขได้ ฟิลด์ที่จำเป็นมักจะปรากฏในการลงทะเบียน";
$l['display_on_profile'] = "แสดงในรายละเอียด?";
$l['display_on_profile_desc'] = "ฟิลด์นี้ควรจะแสดงบนโปรไฟล์ของผู้ใช้หรือไม่ นี้ไม่ได้นำไปใช้กับผู้บริหาร / ผู้ดูแล";
$l['display_on_postbit'] = "แสดงบน โพสต์บิต?";
$l['display_on_postbit_desc'] = "ฟิลด์นี้ควรจะแสดงบนโพสต์ของผู้ใช้?";
$l['viewableby'] = 'สามารถดูได้โดย';
$l['viewableby_desc'] = 'เลือกกลุ่มที่ได้รับอนุญาตเพื่อดูข้อมูลรายละเอียดนี้';
$l['editableby'] = 'สามารถแก้ไขได้โดย';
$l['editableby_desc'] = 'เลือกกลุ่มที่ได้รับอนุญาตในการแก้ไขข้อมูลรายละเอียดนี้';
$l['min_posts_enabled'] = "จำนวนโพสต์ขั้นต่ำ?";
$l['min_posts_enabled_desc'] = "ฟิลด์นี้เท่านั้นควรจะสามารถใช้ได้กับผู้ใช้ที่มีการนับโพสต์บางอย่าง? ถ้าเป็นเช่นนั้นให้กำหนดจำนวนคะแนนขั้นต่ำของการโพสต์ที่ต้องการที่นี่";
$l['parser_options'] = "ตัวเลือกวิเคราะห์";
$l['parse_allowhtml'] = "ใช่, อนุญาตให้ใช้ HTML ในข้อมูลโปรไฟล์ส่วนตัว.";
$l['parse_allowmycode'] = "ใช่, อนุญาตให้ใช้มายโค้ดในข้อมูลฟิลด์โปรไฟล์ .";
$l['parse_allowsmilies'] = "ใช่, อนุญาตให้ใช้รูปแสดงอารมณ์ในข้อมูลโปรไฟล์.";
$l['parse_allowimgcode'] = "ใช่,อนุญาตให้ใช้ [img] โค้ดรูปภาพในข้อมูลโปรไฟล์.";
$l['parse_allowvideocode'] = "ใช่, อนุญาตให้ใช้ [video] โค้ดวิดีโอในข้อมูลโปรไฟล?์.";
$l['save_profile_field'] = "ยืนยันข้อมูลโปรไฟล์";
$l['name'] = "ชื่อ";
$l['registration'] = "ลงทะเบียน?";
$l['editable'] = "สามารถแก้ไขได้?";
$l['profile'] = "ข้อมูลส่วนตัว?";
$l['postbit'] = "โพสต์บิต?";
$l['edit_field'] = "แก้ไขข้อมูล";
$l['delete_field'] = "ลบข้อมูล";
$l['no_profile_fields'] = "ไม่มีเขตข้อมูลรายละเอียดที่กำหนดเองในฟอรั่มของคุณในเวลานี้";

$l['error_missing_name'] = "คุณไม่ได้ป้อนชื่อสำหรับเขตข้อมูลรายละเอียดที่กำหนดเองนี้";
$l['error_missing_description'] = "คุณไม่ได้ป้อนคำอธิบายสำหรับเขตข้อมูลรายละเอียดที่กำหนดเองนี้";
$l['error_invalid_fid'] = "เขตข้อมูลรายละเอียดที่เลือกไม่ได้อยู่";

$l['success_profile_field_added'] = "เขตข้อมูลรายละเอียดที่กำหนดเองได้รับการสร้างเสร็จเรียบร้อยแล้ว";
$l['success_profile_field_saved'] = "เขตข้อมูลรายละเอียดที่กำหนดเองได้รับการบันทึกเรียบร้อยแล้ว";
$l['success_profile_field_deleted'] = "เขตข้อมูลรายละเอียดที่กำหนดเองที่เลือกได้ถูกลบไปแล้วประสบความสำเร็จ";

$l['confirm_profile_field_deletion'] = "คุณแน่ใจว่าคุณต้องการที่จะลบเขตข้อมูลรายละเอียดนี้?";
