<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['custom_mycode'] = "มายโค้ดที่กำหนดเอง";
$l['mycode'] = "มายโค้ด";
$l['mycode_desc'] = "มายโค้ดที่กำหนดเอง  จะช่วยให้คุณสร้างมายโค้ด เพิ่มเติมสำหรับสมาชิกของคุณเพื่อใช้ในการส่งข้อความของพวกเขา";
$l['add_new_mycode'] = "เพิ่มมายโค้ดใหม่";
$l['add_new_mycode_desc'] = "ที่นี่คุณสามารถเพิ่ม มายโค้ดใหม่ ที่กำหนดเองในฟอรั่มของคุณ คุณสามารถใช้ มายโค้ดของคุณ ใส่ในกล่องส่งด้านล่างนี้เพื่อทดสอบการแสดงผลและแทนที่ของโค้ดด้วยโค้ดทดแทน แล้วบันทึกโค้ด";
$l['edit_mycode_desc'] = "ที่นี่คุณสามารถแก้ไขมายโค้ดของคุณเองในกล่องด้านล่างนี้ ใส่โค้ดในแบบฟอร์มแล้วทดสอบดูผล.";

$l['title'] = "ชื่อโค้ด";
$l['short_description'] = "คำอธิบายสั้น";
$l['regular_expression'] = "โค้ดนิพจน์ปรกติ";
$l['regular_expression_desc'] = "หมายถึงกลุ่มของสัญลักษณ์ที่ใช้ในการค้นหาแทนที่ หรือเปรียบเทียบคำ/ข้อความกับข้อมูลชนิดสตริงโดยที่เราสามารถสร้างรูปแบบในการทำงานเหล่านี้ได้ตามต้องการ";
$l['replacement'] = "โค้ดแทนที่";
$l['replacement_desc'] = "ใส่แทนที่นิพจน์ปกติ";
$l['example'] = "ตัวอย่างเช่น:";
$l['enabled'] = "เปิดใช้งาน?";
$l['parse_order'] = "คำสั่งวิเคราะห์";
$l['parse_order_desc'] = "มายโค้ด จะสามารถแยกวิเคราะห์ในลำดับจากน้อยไปมากเมื่อเทียบกับ มายโค้ด อื่น ๆ";
$l['edit_mycode'] = "แก้ไข มายโค้ด";
$l['activate_mycode'] = "เปิดใช้งาน มายโค้ด";
$l['deactivate_mycode'] = "ยกเลิกการใช้งาน มายโค้ด";
$l['delete_mycode'] = "ลบ มายโค้ด";
$l['no_mycode'] = "ไม่มี มายโค้ด ที่กำหนดเองที่มีอยู่ในเวลานี้";
$l['save_mycode'] = "บันทึก มายโค้ด";
$l['add_mycode'] = "เพิ่มมายโค้ด";
$l['changes_not_saved'] = "การเปลี่ยนแปลงของคุณยังไม่ได้รับการบันทึกไว้";

$l['sandbox'] = "กล่องทดสอบโค้ด";
$l['sandbox_desc'] = "คุณสามารถใช้กล่องทดสอบนี้เพื่อการแสดงผลของโค้ดของคุณก่อนที่จะบันทึกโค้ด";
$l['test_value'] = "การทดสอบค่าของโค้ด";
$l['test_value_desc'] = "ใส่ในข้อความที่จะทดสอบในกล่องด้านล่าง";
$l['result_html'] = "ผลลัพ HTML";
$l['result_html_desc'] = "พื้นที่ข้อความด้านล่างแสดงผล HTML โดยใช้การแสดงออกปกติที่ค่าทดสอบ.";
$l['result_actual'] = "ผลลัพที่แสดงผลแท้จริง";
$l['result_actual_desc'] = "พื้นที่ด้านล่างแสดงให้เห็นถึงผลที่เกิดขึ้นจริงขณะ ที่HTML ่แสดงผล";
$l['test'] = "ทดสอบมายโค้ด";

$l['error_missing_title'] = "คุณไม่ได้ป้อนชื่อ";
$l['error_missing_regex'] = "คุณไม่ได้ป้อนการแสดงเนื้อหาโค้ด.";
$l['error_missing_replacement'] = "คุณไม่ได้ป้อนโค้ดทดแทน";
$l['error_invalid_mycode'] = "มายโค้ด ที่ระบุไม่มีอยู่.";

$l['success_added_mycode'] = "มายโค้ด ได้มีการเพิ่มประสบความสำเร็จ.";
$l['success_deleted_mycode'] = "มายโค้ดที่เลือกได้ถูกลบออกประสบความสำเร็จ.";
$l['success_updated_mycode'] = "มายโค้ด ได้รับการปรับปรุงเรียบร้อยแล้ว";
$l['success_deactivated_mycode'] = "มายโค้ด ที่เลือกได้รับการปิดการใช้งานประสบความสำเร็จ.";
$l['success_activated_mycode'] = "มายโค้ด ที่เลือกได้รับการเปิดใช้งานประสบความสำเร็จ.";

$l['confirm_mycode_deletion'] = "คุณแน่ใจว่าคุณต้องการลบ มายโค้ด นี้?";

$l['mycode_sandbox_test_error'] = 'มีข้อผิดพลาดการเรียกผลการทดสอบคือ.';

