<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['warning_system'] = "ระบบเตือนภัย";
$l['warning_types'] = "ประเภทคำเตือน";
$l['warning_types_desc'] = "ที่นี่คุณสามารถจัดการรายชื่อของทีมงานประเภทคำเตือนที่แตกต่างกันได้รับอนุญาตให้ออกให้กับผู้ใช้.";
$l['add_warning_type'] = "เพิ่มประเภทคำเตือนใหม่";
$l['add_warning_type_desc']="ที่นี่คุณสามารถสร้างรูปแบบคำเตือนใหม่ที่กำหนดไว้ล่วงหน้าประเภทคำเตือนสามารถเลือกได้เมื่อเตือนผู้ใช้และคุณสามารถกำหนดจำนวนของจุดที่จะเพิ่มสำหรับประเภทนี้เช่นเดียวกับช่วงเวลาก่อนที่คำเตือนประเภทนี้หมดอายุ";
$l['edit_warning_type'] = "แก้ไขประเภทคำเตือน";
$l['edit_warning_type_desc']="ที่นี่คุณสามารถแก้ไขประเภทคำเตือนนี้ประเภทคำเตือนสามารถเลือกได้เมื่อเตือนผู้ใช้และคุณสามารถกำหนดจำนวนของจุดที่จะเพิ่มสำหรับประเภทนี้เช่นเดียวกับช่วงเวลาก่อนที่คำเตือนประเภทนี้หมดอายุ.";
$l['warning_levels'] = "ระดับการเตือน";
$l['warning_levels_desc'] = "ระดับคำเตือนกำหนดสิ่งที่เกิดขึ้นกับผู้ใช้เมื่อพวกเขามาถึงระดับการเตือนโดยเฉพาะอย่างยิ่ง (ร้อยละของจุดเตือนสูงสุด) คุณสามารถแบนผู้ใช้หรือระงับสิทธิของพวกเขา.";
$l['add_warning_level'] = "เพิ่มระดับคำเตือนใหม่";
$l['add_warning_level_desc'] = "ที่นี่คุณสามารถสร้างระดับการเตือนใหม่ ระดับคำเตือนการดำเนินการจะต้องดำเนินการกับผู้ใช้เมื่อพวกเขามาถึงร้อยละเฉพาะของสัญญาณเตือนระดับสูงสุด";
$l['edit_warning_level'] = "แก้ไขระดับคำเตือน";
$l['edit_warning_level_desc'] = "ระดับคำเตือนการดำเนินการจะต้องดำเนินการกับผู้ใช้เมื่อพวกเขามาถึงเปอร์เซ็นต์ที่เฉพาะเจาะจงของระดับการเตือนสูงสุด";

$l['percentage'] = "เปอร์เซ็นต์";
$l['action_to_take'] = "การดำเนินการการใช้";
$l['move_banned_group'] = "ย้ายไปยังกลุ่มต้องห้าม({3}) สำหรับ {1} {2}";
$l['move_banned_group_permanent'] = "ย้ายไปยังกลุ่มต้องห้าม({1}) อย่างถาวร";
$l['suspend_posting'] = "แบนโพสต์พิเศษสำหรับ{1} {2}";
$l['suspend_posting_permanent'] = "แบนโพสต์ถาวร";
$l['moderate_new_posts'] = "ข้อความใหม่ระดับปานกลาง{1} {2}";
$l['moderate_new_posts_permanent'] = "ข้อความใหม่ในระดับปานกลางอย่างถาวร";
$l['no_warning_levels'] = "ไม่มีระดับคำเตือนในฟอรั่มของคุณอยู่ในเวลานี้.";

$l['warning_type'] = "ประเภทคำเตือน";
$l['points'] = "คะแนน";
$l['expires_after'] = "หลังจากวันที่หมดอายุ";
$l['no_warning_types'] = "ไม่มีประเภทคำเตือนในฟอรั่มของคุณในเวลานี้.";

$l['warning_points_percentage'] = "เปอร์เซ็นต์ของคะแนนคำเตือนสูงสุด";
$l['warning_points_percentage_desc'] = "กรุณาใส่ค่าตัวเลขระหว่าง 1 และ 100.";
$l['action_to_be_taken'] = "การดำเนินการจะต้องดำเนินการ";
$l['action_to_be_taken_desc'] = "เลือกดำเนินการที่คุณต้องการที่จะต้องดำเนินการเมื่อผู้ใช้ไปถึงระดับดังกล่าวข้างต้น.";
$l['ban_user'] = "แบนผู้ใช้";
$l['banned_group'] = "แบนกลุ่ม:";
$l['ban_length'] = "ระยะเวลาแบน:";
$l['suspend_posting_privileges'] = "แบนโพสต์";
$l['suspension_length'] = "ระยะเวลาการระงับ:";
$l['moderate_posts'] = "กระทู้ระดับปานกลาง";
$l['moderation_length'] = "ระยะเวลาการดูแล:";
$l['save_warning_level'] = "บันทึกระดับคำเตือน";

$l['title'] = "ชื่อเรื่อง";
$l['points_to_add'] = "คะแนนที่จะเพิ่ม";
$l['points_to_add_desc'] = "จำนวนคะแนนที่จะเพิ่มระดับการเตือนผู้ใช้.";
$l['warning_expiry'] = "คำเตือนหมดอายุ";
$l['warning_expiry_desc'] = "นานแค่ใหนที่ต้องการให้คำเตือนหมดอายุหลังจากที่คุณได้ดำเนินการ?";
$l['save_warning_type'] = "บันทึกประเภทคำเตือน";

$l['expiration_hours'] = "ชั่วโมง";
$l['expiration_days'] = "วัน";
$l['expiration_weeks'] = "สัปดาห์";
$l['expiration_months'] = "เดือน";
$l['expiration_never'] = "ไม่เคย";
$l['expiration_permanent'] = "ถาวร";

$l['error_invalid_warning_level'] = "ระดับการเตือนที่ระบุไม่มีอยู่.";
$l['error_invalid_warning_percentage'] = "
คุณไม่ได้ป้อนค่าเปอร์เซ็นต์ที่ถูกต้องในระดับคำเตือนนี้ ค่าเปอร์เซ็นต์ของคุณจะต้องอยู่ระหว่าง 1 และ 100.";
$l['error_invalid_warning_type'] = "ประเภทการเตือนที่ระบุไม่มีอยู่.";
$l['error_missing_type_title'] = "คุณไม่ได้ป้อนชื่อสำหรับประเภทคำเตือนนี้";
$l['error_missing_type_points'] = "คุณไม่ได้ป้อนหมายเลขที่ถูกต้องคะแนนที่จะเพิ่มให้คำเตือนประเภทนี้ คุณจะต้องป้อนตัวเลขมากกว่า 0 แต่ไม่เกิน{1}";

$l['success_warning_level_created'] = "ระดับการเตือนได้รับสร้างที่ประสบความสำเร็จ.";
$l['success_warning_level_updated'] = "ระดับการเตือนได้รับปรับปรุงเรียบร้อยแล้ว.";
$l['success_warning_level_deleted'] = "ระดับการเตือนที่เลือกได้ถูกลบไปแล้วประสบความสำเร็จ.";
$l['success_warning_type_created'] = "ประเภทคำเตือนได้รับสร้างที่ประสบความสำเร็จ.";
$l['success_warning_type_updated'] = "ประเภทคำเตือนได้รับปรับปรุงเรียบร้อยแล้ว.";
$l['success_warning_type_deleted'] = "ประเภทเตือนที่เลือกได้ถูกลบประสบความสำเร็จแล้ว.";

$l['confirm_warning_level_deletion'] = "คุณแน่ใจว่าคุณต้องการที่จะลบระดับคำเตือนนี้?";
$l['confirm_warning_type_deletion'] = "คุณแน่ใจว่าคุณต้องการลบประเภทคำเตือนนี้?";

