<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['smilies'] = "รูปแสดงอารมณ์";
$l['manage_smilies'] = "จัดการรูปแสดงอารมณ์";
$l['manage_smilies_desc'] = "ส่วนนี้จะช่วยให้คุณสามารถแก้ไขและลบรูปแสดงอารมณ์ของคุณ.";
$l['add_smilie'] = "เพิ่มรูปแสดงอารมณ์";
$l['add_smilie_desc'] = "ที่นี่คุณสามารถเพิ่มรูปแสดงอารมณ์แบบเดี่ยวใหม่";
$l['add_multiple_smilies'] = "เพิ่มรูปแสดงอารมณ์หลายรายการ";
$l['add_multiple_smilies_desc'] = "ที่นี่คุณสามารถเพิ่มรูปแสดงอารมณ์ใหม่หลายรายการพร้อมกัน.";
$l['edit_smilie'] = "แก้ไขรูปแสดงอารมณ์";
$l['edit_smilie_desc'] = "ที่นี่คุณสามารถแก้ไขรูปแสดงอารมณ์เดียว";
$l['mass_edit'] = "แก้ไขจำนวนมาก";
$l['mass_edit_desc'] = "ที่นี่คุณสามารถแก้ไขรูปแสดงอารมณ์ของคุณทั้งหมดในครั้งเดียว";

$l['no_smilies'] = "มีสัญลักษณ์แสดงอารมณ์บนฟอรั่มของคุณอยู่ในเวลานี้";

$l['image'] = "รูป";
$l['name'] = "ชื่อ";
$l['text_replace'] = "ข้อความที่จะแทนที่";
$l['text_replace_desc'] = "นี่คือข้อความที่จะแทนที่ด้วยรอยยิ้ม (ใส่บรรทัดละหนึ่ง)";
$l['image_path'] = "ที่เก็บรูปภาพ";
$l['image_path_desc'] = "นี่คือเส้นทางไปยังภาพ รูปแสดงอารมณ์ ถ้าคุณต้องการที่จะใช้ภาพ รูปแสดงอารมณ์ ที่แตกต่างกันสำหรับรูปแบบที่แตกต่างกันโปรดใช้ <strong>{theme}</strong> เพื่อเป็นตัวแทนของไดเรกทอรีภาพของแต่ละธีม.";
$l['order'] = "ลำดับ";
$l['display_order'] = "ลำดับแสดง";
$l['display_order_desc'] = "เพื่อให้รูปแสดงอารมณ์ปรากฏขึ้น หมายเลขนี้ไม่ควรเหมือนกันกับหมายเลขของรูปแสดงอารมณ์ตัวอื่น.";
$l['mass_edit_show_clickable'] = "แสดงบนที่คลิกได้?";
$l['show_clickable'] = "แสดงในรายการที่สามารถคลิกได้";
$l['show_clickable_desc'] = "
คุณต้องการ ตัวยิ้ม นี้เพื่อแสดงในรายการ รูปแสดงอารมณ์ ที่สามารถคลิกได้ในการแก้ไขโพสต์?";
$l['include'] = "เพิ่ม?";
$l['path_to_images'] = "ที่เก็บรูปภาพ";
$l['path_to_images_desc'] = "นี่คือเส้นทางไปยังโฟลเดอร์ที่ภาพอยู่ใน.";
$l['smilie_delete'] = "ลบ?";
$l['save_smilie'] = "จัดเก็บรูปแสดงอารมณ์";
$l['save_smilies'] = "จัดเก็บรูปแสดงอารมณ์";
$l['show_smilies'] = "แสดงรูปภาพ";
$l['reset'] = "ตั้งค่าใหม่";

$l['error_missing_name'] = "คุณไม่ได้ป้อนชื่อสำหรับ รูปแสดงอารมณ์ นี้";
$l['error_missing_text_replacement'] = "คุณไม่ได้ป้อนข้อความแทนสำหรับ รูปแสดงอารมณ์ นี้.";
$l['error_missing_path'] = "คุณไม่ได้ป้อนเส้นทางสำหรับ รูปแสดงอารมณ์ นี้";
$l['error_missing_path_multiple'] = "คุณไม่ได้ป้อนเส้นทาง.";
$l['error_missing_order'] = "คุณไม่ได้ป้อนลำดับการแสดงผลสำหรับ รูปแสดงอารมณ์ นี้.";
$l['error_duplicate_order'] = "คุณไม่ได้ป้อนลำดับการแสดงผลที่ถูกต้องสำหรับ รูป นี้";
$l['error_missing_clickable'] = "คุณไม่ได้ระบุ ใช ่หรือ ไม สำหรับ\"แสดงที่คลิกได้\" ตัวเลือกที่.";
$l['error_no_smilies'] = "ภาพแสดงอารมณ์ในไดเรกทอรีที่ระบุไม่มีหรือภาพแสดงอารมณ์ทั้งหมดในไดเรกทอรีมีการเพิ่มแล้ว";
$l['error_no_images'] = "ขณะนี้ภาพในไดเรกทอรีที่ระบุไม่มีอยู่.";
$l['error_none_included'] = "คุณไม่ได้เลือกภาพแสดงอารมณ์ใด ๆ ที่จะรวม.";
$l['error_invalid_path'] = "คุณไม่ได้ป้อนเส้นทางที่ถูกต้อง";
$l['error_invalid_smilie'] = "รูปแสดงอารมณ์ ที่ระบุไม่มีอยู่.";

$l['success_smilie_added'] = "รูปแสดงอารมณ์ มีการเพิ่มที่ประสบความสำเร็จ";
$l['success_multiple_smilies_added'] = "ภาพแสดงอารมณ์ที่เลือกได้มีการเพิ่มการประสบความสำเร็จ";
$l['success_smilie_updated'] = "รูปแสดงอารมณ์ ได้รับการปรับปรุงเรียบร้อยแล้ว";
$l['success_multiple_smilies_updated'] = "ภาพแสดงอารมณ์ที่ได้รับการปรับปรุงเรียบร้อยแล้ว";
$l['success_smilie_deleted'] = "รูปแสดงอารมณ์ เลือกได้ถูกลบไปแล้วประสบความสำเร็จ";
$l['success_mass_edit_updated'] = "ภาพแสดงอารมณ์ที่ได้รับการปรับปรุงเรียบร้อย";

$l['confirm_smilie_deletion'] = "คุณแน่ใจว่าคุณต้องการลบรูปแสดงอารมณ์นี้";

