<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['bad_words'] = "กรองคำ";
$l['edit_bad_word'] = "แก้ไขกรองคำ";
$l['edit_bad_word_desc'] = "ที่นี่คุณสามารถแก้ไขและแทนทตัวกรอง";
$l['bad_word_filters'] = "กรองคำ";
$l['bad_word_filters_desc'] = "คุณสมบัตินี้ช่วยให้คุณสามารถจัดการรายชื่อของคำ หรือวลี จะถูกแทนที่โดยอัตโนมัติในการโพสต์ในฟอรั่มของคุณ";

$l['bad_word'] = "คำ";
$l['bad_word_desc'] = "ป้อนคำที่คุณต้องการที่จะกรอง '*' หมายความว่าคุณไม่สามารถปล่อยให้ช่องนี้ว่างได้อย่างน้อยๆต้องป้อนคำที่คุณต้องการจะกรอง (ก-ฮa-zA-Z0-9 _0๙).";
$l['bad_word_max'] = "คำกรองไม่สามารถเกิน 100 ตัวอักษร.";
$l['replacement'] = "คำที่จะมาทดแทนคำกรอง";
$l['replacement_desc'] = "ใส่ข้อความหรือตัวอักษรที่จะมาแทนคำกรองที่คุณห้ามใช้เมื่อมีคนโพสต์ข้อความพวกนี้จะมาแสดงแทน (ถ่้าปล่อยว่างไว้จะแสดงเป็นเครื่องหมายดอกจัน)";
$l['replacement_word_max'] = "คำทดแทนไม่สามารถเกิน 100 ตัวอักษร.";
$l['error_replacement_word_invalid'] = "คำทดแทนไม่สามารถใช้คำเดียวกันหรือเหมือนกันกับคำกรอง .";

$l['save_bad_word'] = "บันทึกคำกรอง";
$l['no_bad_words'] = "ไม่มีตัวกรองคำในปัจจุบันในเวลานี้";
$l['add_bad_word'] = "เพิ่มตัวกรอง";

$l['error_missing_bad_word'] = "คุณไม่ได้ป้อนตัวกรองคำ.";
$l['error_invalid_bid'] = "คำกรองที่ระบุไม่มีอยู่.";
$l['error_bad_word_filtered'] = "คำกรองที่คุณใส่นั้นมีอยู่แล้ว.";

$l['success_added_bad_word'] = "คำกรองได้รับการเพิ่มประสบความสำเร็จ.";
$l['success_deleted_bad_word'] = "ลบคำกรองเสร็จเร็บร้อยแล้ว.";
$l['success_updated_bad_word'] = "คำกรองได้รับการปรับปรุงเรียบร้อยแล้ว";

$l['confirm_bad_word_deletion'] = "คุณแน่ใจหรือว่าจะลบตัวกรองคำตัวนี้";

