<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['plugins'] = "ปลั๊กอิน";
$l['plugins_desc'] = "ส่วนนี้จะช่วยให้คุณสามารถเปิดใช้งานปิดการใช้งานและจัดการปลั๊กอินที่คุณได้อัปโหลดไปยังฟอรั่มของคุณ<strong>inc/plugins</strong> ไดเรกทอรี เพื่อซ่อนปลั๊กอินจากมุมมอง แต่ไม่สูญเสียข้อมูลที่เก็บไว้จากนั้นให้คลิกที่ลิงค์เลิกใช้งาน.";
$l['plugin_updates'] = "อัพเดทปลั๊กอิน";
$l['plugin_updates_desc'] = "ส่วนนี้จะช่วยให้คุณตรวจสอบสำหรับการปรับปรุงในปลั๊กอินของคุณ.";
$l['browse_plugins'] = "เรียกดูปลั๊กอิน";
$l['browse_plugins_desc'] = "ที่นี่คุณสามารถเรียกดูเว็บไซต์การแก้ไข MyBB อย่างเป็นทางการสำหรับปลั๊กอินที่เข้ากันได้กับซีรีส์ของคุณ.";
$l['browse_all_plugins'] = "เรียกดูปลั๊กอินทั้งหมด";

$l['plugin'] = "ปลั๊กอิน";
$l['active_plugin'] = "ปลี๊กอินที่ใช้งาน";
$l['inactive_plugin'] = "ปลั๊กอินที่ไม่ใช้งาน";
$l['your_version'] = "เวอร์ชั่นของคุณ";
$l['latest_version'] = "เวอร์ชั่นล่าสุด";
$l['download'] = "ดาวน์โหลด";
$l['deactivate'] = "ยกเลิกการใช้งาน";
$l['activate'] = "เปิดใช้งาน";
$l['install_and_activate'] = "การติดตั้ง &amp; เปิดใช้งาน";
$l['uninstall'] = "ถอนการติดตั้ง";
$l['created_by'] = "ที่สร้างขึ้นโดย";
$l['no_plugins'] = "ไม่มีปลั๊กอินในฟอรั่มของคุณในเวลานี้.";
$l['no_active_plugins'] = "ไม่มีปลั๊กอินที่ใช้งานในฟอรั่มของคุณ.";
$l['no_inactive_plugins'] = "ไม่มีปลั๊กอินที่ใช้งานมีอยู่.";

$l['plugin_incompatible'] = "ปลั๊กอินนี้ไม่สามารถใช้กับ MyBB{1}";

$l['recommended_plugins_for_mybb'] = "ปลั๊กอินที่แนะนำสำหรับการ MyBB{1}";
$l['browse_results_for_mybb'] = "ผลเรียกดู MyBB{1}";
$l['search_for_plugins'] = "ค้นหาปลั๊กอิน";
$l['search'] = "ค้นหา";

$l['error_vcheck_no_supported_plugins'] = "ตรวจสอบรุ่นที่รองรับไม่มีปลั๊กอินที่ติดตั้ง.";
$l['error_vcheck_communications_problem'] = "มีปัญหาในการสื่อสารกับเซิร์ฟเวอร์เวอร์ชันMyBBดัดแปลง โปรดลองอีกครั้งในไม่กี่นาที.";
$l['error_vcheck_vulnerable'] = "[ปลั๊กอินที่มีช่องโหว่]:";
$l['error_vcheck_vulnerable_notes'] = "การส่งนี้ได้ระบุว่าเป็นความเสี่ยงโดย ทีมงาน MyBB . เราขอแนะนำการกำจัดที่สมบูรณ์ของการปรับเปลี่ยนนี้ โปรดดูหมายเหตุด้านล่าง: ";
$l['error_no_input'] = "รหัสข้อผิดพลาดที่ 1: การป้อนข้อมูลที่ระบุไม่มี.";
$l['error_no_pids'] = "รหัสข้อผิดพลาดที่ 2: ไม่มีรหัสปลั๊กอินที่ระบุ.";
$l['error_communication_problem'] = "มีปัญหาในการสื่อสารกับเซิร์ฟเวอร์ดัดแปลง MyBB เป็น. โปรดลองอีกครั้งในไม่กี่นาที.";
$l['error_invalid_plugin'] = "ปลั๊กอินที่เลือกไม่มีอยู่.";
$l['error_no_results_found'] = "ไม่พบผลลัพธ์สำหรับคำหลักที่ระบุ.";

$l['success_plugins_up_to_date'] = "ขอแสดงความยินดี, ทั้งหมดของปลั๊กอินเป็นเวอร์ชั่นปัจจุบัน.";
$l['success_plugin_activated'] = "ปลั๊กอินที่เลือกได้ถูกเปิดใช้งานที่ประสบความสำเร็จ.";
$l['success_plugin_deactivated'] = "ปลั๊กอินที่เลือกได้ถูกปิดการใช้งานที่ประสบความสำเร็จ.";
$l['success_plugin_installed'] = "ปลั๊กอินที่เลือกได้ถูกติดตั้งและเปิดใช้งานประสบความสำเร็จ.";
$l['success_plugin_uninstalled'] = "ปลั๊กอินที่เลือกได้ถูกยกเลิกการติดตั้งประสบความสำเร็จ.";
