<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['thread_prefixes'] = "คำนำหน้ากระทู้";
$l['thread_prefixes_desc'] = "คุณสามารถกำหนดคำนำให้เพื่อให้ผู้ใช้ได้เลือกเมื่อตอนตั้งกระทู้ คำนำหน้านี้จะแบ่งแยกหมวดหมูประเภทที่เรากำหนดทำให้ค้นหาและดูแลกระทู้ได้สะดวกยิ่งขึ้น.";

$l['add_new_thread_prefix'] = "เพิ่มคำนำหน้ากระทู้";
$l['add_new_thread_prefix_desc'] = "ที่นี่คุณสามารถเพิ่มคำนำหน้าหัวข้อใหม่และกำหนดสถานที่ที่สามารถใช้ได้เช่นเดียวกับที่กลุ่มผู้ใช้สามารถใช้งานได้.";

$l['edit_prefix'] = "แก้ไขคำนำหน้า";
$l['edit_prefix_desc'] = "ที่นี่คุณสามารถแก้ไขคำนำหน้ากระทู้และเปลี่ยนวิธีการที่จะแสดงผลที่มีความพร้อมใช้งานและกลุ่มผู้ใช้ซึ่งจะสามารถใช้งานได้";
$l['edit_thread_prefix'] = "แก้ไขคำนำหน้ากระทู้";
$l['delete_thread_prefix'] = "ลบกระทู้คำนำหน้า";

$l['prefix_options'] = "ตัวเลือกคำนำหน้า";
$l['save_thread_prefix'] = "บันทึกหัวข้อคำนำหน้า";

$l['prefix'] = "คำนำหน้า";
$l['prefix_desc'] = "เวอร์ชันข้อความธรรมดาของคำนำหน้าที่จะแสดงในเมนูตัวเลือก.";
$l['display_style'] = "รูปแบบการแสดง";
$l['display_style_desc'] = "คือการแสดงการปรากฏขึ้นของคำนำหน้าคุรอาจจะใช้ในแบบ HTML หรือจะใช้แบบธรรมดาก็ได้.";
$l['available_in_forums'] = "ที่มีอยู่ในฟอรั่ม";
$l['available_to_groups'] = "สามารถใช้ได้กับกลุ่ม";

$l['no_thread_prefixes'] = "ไม่มีการติดตั้งคำนำหน้ากระทู้ในฟอรั่มของคุณ.";

$l['confirm_thread_prefix_deletion'] = "คุณณแน่ใจหรือว่าต้องการลบคำนำหน้าหัวข้อนี้? หมายเหตุ: คุณควรจำไว้ในการปรับปรุงใด ๆ หากเครื่องมือผู้ดูแลที่กำหนดเองใช้คำนำหน้านี้คุณต้องไปปรับปรุงด้วยหลังจากที่ลบ";

$l['success_thread_prefix_created'] = "คำนำหน้าหัวข้อได้รับสร้างที่ประสบความสำเร็จ.";
$l['success_thread_prefix_updated'] = "คำนำหน้าหัวข้อได้รับปรับปรุงเรียบร้อยแล้ว.";
$l['success_thread_prefix_deleted'] = "คำนำหน้ากระทู้ถูกลบไปแล้วประสบความสำเร็จ กรุณาปรับปรุงเครื่องมือผู้ดูแลที่กำหนดเองที่ใช้คำนำหน้านี้";

$l['error_missing_prefix'] = "กรุณาใส่คำนำหน้าที่คุณต้องการเพิ่ม.";
$l['error_missing_display_style'] = "กรุณาใส่รูปแบบการแสดงสำหรับคำนำหน้านี้.";
$l['error_no_forums_selected'] = "กรุณาเลือกฟอรั่มที่มีคำนำหน้านี้จะมี.";
$l['error_no_groups_selected'] = "กรุณาเลือกกลุ่มที่คำนำหน้านี้จะมี.";
$l['error_invalid_prefix'] = "คำนำหน้าหัวข้อที่ระบุไม่มีอยู่.";

