<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['spiders_bots'] = "แมงมุม / บอท";
$l['spiders_bots_desc'] = "ส่วนนี้จะช่วยให้คุณจัดการเครื่องมือค้นหาแมงมุมและamp; บอท จะตรวจพบฟอรั่มของคุณโดยอัตโนมัติ โดยคุณยังสามารถที่จะเห็นเมื่อบอทมาเยี่ยมชม.";
$l['add_new_bot'] = "เพิ่มบอทใหม่";
$l['add_new_bot_desc'] = "ที่นี่คุณสามารถเพิ่มบอใหม่ที่คุณต้องการให้มาตรวจพบฟอรั่มของคุณ.";

$l['edit_bot'] = "แก้ไข บอท";
$l['edit_bot_desc'] = "ที่นี่คุณสามารถแก้ไขบอทที่มีอยู่.";

$l['bot'] = "บอท";
$l['last_visit'] = "เข้าชมล่าสุด";
$l['no_bots'] = "ไม่มีครื่องมือค้นหาแมงมุมเและซอฟต์แวร์รวบรวมข้อมูล ที่กำลังติดตามโดยฟอรั่มแห่งนี้.";

$l['name'] = "ชื่อ";
$l['name_desc'] = "ใส่ชื่อของ บอทนี้ที่คุณต้องการระบุโดย";
$l['user_agent'] = "ตัวแทนผู้ใช้สตริง";
$l['user_agent_desc'] = "ป้อนสตริงซึ่งจะมีการจับคู่กับตัวแทนของผู้ใช้บอท (จากบางส่วนได้รับการยอมรับ)";
$l['language_str'] = "ภาษา";
$l['language_desc'] = "เลือกชุดภาษาบอทที่จะใช้เมื่อดูบอร์ด.";
$l['theme'] = "ธีม";
$l['theme_desc'] = "เลือกรูปแบบบอทที่จะใช้เมื่อดูบอร์ด.";
$l['user_group'] = "กลุ่มของผู้ใช้";
$l['user_group_desc'] = "เลือกสิทธิ์ของกลุ่มผู้ใช้จะนำมาใช้สำหรับบอร์ดนี้ (หมายเหตุ: ค่าเริ่มต้นคือกลุ่มผู้เยี่ยมชมไม่แนะนำให้คุณเปลี่ยนจากนี้)";
$l['save_bot'] = "บันทึก";
$l['use_board_default'] = "ใช้บอร์ดเริ่มต้น";

$l['error_invalid_bot'] = "บอทที่ระบุไม่มีอยู่.";
$l['error_missing_name'] = "คุณไม่ได้ป้อนชื่อของบอท";
$l['error_missing_agent'] = "คุณไม่ได้ป้อนสตริงตัวแทนผู้ใช้สำหรับบอทนี้";

$l['success_bot_created'] = "บอทได้รับการสร้างประสบความสำเร็จ.";
$l['success_bot_updated'] = "บอทได้รับการปรับปรุงเรียบร้อยแล้ว.";
$l['success_bot_deleted'] = "บอทที่เลือกได้ถูกลบประสบความสำเร็จ.";

$l['confirm_bot_deletion'] = "บอทที่เลือกได้ถูกลบประสบความสำเร็จ?";

