<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['themes'] = "ชุดรูปแบบ";
$l['themes_desc'] = "ที่นี่คุณสามารถจัดการรูปแบบการตั้งค่าในเว็บบอร์ดของคุณ รูปแบบจะช่วยให้คุณสามารถปรับแต่งรูปลักษณ์หน้าตาของเว็บบอร์ดของคุณให้สวยงามขึ้น.";

$l['create_new_theme'] = "สร้างชุดรูปแบบใหม่";
$l['create_new_theme_desc'] = "ที่นี่คุณสามารถสร้างรูปแบบใหม่บนพื้นฐานของค่ารูปแบบเริ่มต้น<strong>ชุดเทมเพลทสไตล์ และการตั้งค่าอื่น ๆ ที่ได้รับมาจากชุดรูปแบบหลัก</strong>";

$l['import_a_theme'] = "นำเข้าชุดรูปแบบ";
$l['import_a_theme_desc'] = "ที่นี่คุณสามารถนำเข้ารูปแบบใหม่ คุณอาจจะนำชุดรูปแบบจากคอมพิวเตอร์ของคุณหรือ URL แบบระยะไกล";

$l['edit_stylesheets'] = "แก้ไขสไตล์";
$l['edit_stylesheets_desc'] = "ที่นี่คุณสามารถจัดการสไตล์ในการใช้งาน สไตล์จะขึ้นอยู่กับ CSS ในการกำหนดแบบอักษร สี รูปภาพและอื่นๆ.";

$l['add_stylesheet'] = "เพิ่มสไตล์";
$l['add_stylesheet_desc'] = "ที่นี่คุณสามารถเพิ่มสไตล์ใหม่ในรูปแบบนี้ สไตล์มี CSS ที่ช่วยให้คุณสามารถปรับแต่งลักษณะของรูปแบบนี้ ให้คุณนำไปสร้างแก้ไขสไตล์หน้าเว็บดังต่อไปนี้.";

$l['browse_themes'] = "เรียกดูชุดรูปแบบ";
$l['browse_themes_desc'] = "ที่นี่จะช่วยให้คุณเรียกดูค้นหาชุดรูปแบบจากเว็บไซต์ผู้พัฒนา MyBB อย่างเป็นทางการ.";

$l['browse_all_themes'] = "ดูชุดรูปแบบทั้งหมด";

$l['export_theme'] = "ส่งออกชุดรูปแบบ";
$l['export_theme_desc'] = "ที่นี่คุณสามารถส่งออกรูปแบบและแม่แบบที่กำหนดเองของคุณ การส่งออกรูปแบบที่จะเป็นประโยชน์ถ้าคุณต้องการที่จะแบ่งปันให้กับผู้อื่นหรือนำเข้าไปยังเว็บบอร์ดอื่น";

$l['duplicate_theme'] = "คัดลอกชุดรูปแบบ";
$l['duplicate_theme_desc'] = "ที่นี่คุณสามารถคัดลอกทำซ้ำชุดรูปแบบของคุณ ถ้าคุณต้องการที่จะพัฒนารุ่นของมันอีก.";

$l['colors_manage'] = "การจัดการสี";
$l['colors_attached_to'] = "การตั้งค่าสี {1}";
$l['colors_setting'] = "สีฐาน";
$l['colors_setting_desc'] = "เลือกสีชุดรูปแบบนี้ควรใช้เป็นสีฐาน. สีที่แนบมากับสไตล์นี้จะถูกนำมาใช้";
$l['colors_no_color_setting'] = "ขณะนี้โทนสีไม่มีอยู่ กรุณาสร้างรายการของสีด้านล่างเพื่อใช้คุณลักษณะนี้";
$l['colors_add'] = "การจัดการสี";
$l['colors_add_desc'] = "รายชื่อของสีที่มีสำหรับรูปแบบนี้ นี้ควรจะเป็นรายชื่อของคู่คีย์ (key=item) โทนสี, ตัวอย่างเช่น, <em>blue=Blue</em>.แยกรายการโดยการขึ้นบันทัดใหม่";
$l['colors_please_select'] = "ไม่มี";
$l['colors_add_edit_desc'] = "เลือกสีเพื่อใช้ติดสไตล์นี้ คุณสามารถเลือกได้มากกว่าหนึ่งสี.";
$l['colors_specific_color'] = "สีที่เฉพาะเจาะจง";

$l['include_custom_only'] = "ส่งออกฉเพาะรายการที่กำหนดเองเท่านั้น?";
$l['include_custom_only_desc'] = "ถ้าหากคุณต้องการที่จะรวมรายการ (CSS และสไตล์) ที่สืบทอดมาจากรูปแบบหลักที่ไม่ใช่ที่ทำเองให้เลือก \"ไม่\", องค์ประกอบอย่างอื่นที่กำหนดเองจะถูกส่งออกเพียงอย่างเดียว";
$l['include_templates'] = "ส่งออกทั้งที่กำหนดเองและที่ไม่ได้กำหนดเอง?";
$l['include_templates_desc'] = "ถ้าคุณต้องการที่จะส่งออกแม่แบบที่กำหนดเองและที่ใช้ในชุดรูปแบบนี้เช่นกันให้เลือก ใช่";

$l['edit_stylesheet_simple_mode'] = "แก้ไขสไตล์: โหมดธรรมดา";
$l['edit_stylesheet_simple_mode_desc'] = "ที่นี่คุณสามารถแก้ไขสไตล์รูปแบบของคุณ แบบง่ายช่วยให้คุณสามารถปรับแต่ง CSS ในสไตล์นี้ทั้งที่มีความรู้น้อยหรือที่ไม่มความรู้ีเลยเกี่ยวกับ  CSS เริ่มต้นด้วยการเลือกรายการด้านล่าง";
$l['edit_stylesheet_advanced_mode'] = "แก้ไขสไตล์: โหมดขั้นสูง";
$l['edit_stylesheet_advanced_mode_desc'] = "ที่นี่คุณสามารถแก้ไขสไตล์ในแบบขั้นสูงของผู้ชำนาญ(มีความเสี่ยงหากผิดพลาดทำให้รูปแบบคุณเสียได้ คุณควรจะศึกษาและสำรองข้อมูลไว้ก่อนที่จะลงมือทำจริง)สามารถจัดการ CSS ที่ด้านล่างนี้ได้เลย.";

$l['theme'] = "รูปแบบ";
$l['num_users'] = "# ผู้ใช้";
$l['edit_theme'] = "แก้ไขรูปแบบ";
$l['delete_theme'] = "ลบรูปแบบ";
$l['set_as_default'] = "ตั้งเป็นค่าเริ่มต้น";
$l['default_theme'] = "รูปแบบเริ่มต้น";
$l['force_on_users'] = "บังคับให้ผู้ใช้ใช้";
$l['delete_revert'] = "ลบ / เรียกคืน";

$l['local_file'] = "ไฟล์ท้องถิ่น";
$l['url'] = "URL";
$l['import_from'] = "นำเข้าจาก";
$l['import_from_desc'] = "เลือกไฟล์ที่จะนำเข้า คุณสามารถนำเข้าไฟล์รูปแบบทั้งจากคอมพิวเตอร์ของคุณหรือจาก URL.";
$l['parent_theme'] = "รูปแบบหลัก";
$l['parent_theme_desc'] = "เลือกชุดรูปแบบรูปแบบนี้ควรจะเป็นรูปแบบย่อยของ.";
$l['new_name'] = "ชื่อใหม่";
$l['new_name_desc'] = "ชื่อใหม่สำหรับชุดรูปแบบที่นำเข้า หากปล่อยทิ้งไว้แบบว่างเปล่าจะใช้ชื่อเดิมของชุดรูปแบบที่มากับชุดรูปแบบนี้";
$l['advanced_options'] = "ตัวเลือกขั้นสูง";
$l['ignore_version_compatibility'] = "ติดตั้งได้หมดทุกรุ่น";
$l['ignore_version_compat_desc'] = "การติดตั้งโดยไม่คำนึงรุ่นของชุดรูปแบบ มันสามารถติดตั้งได้หมดทุกรุ่นหากคุณเลือก แต่ถ้าคุณไม่เลือกจะติดตั้งได้เฉพาะรุ่นที่รองรับกับเวอร์ชั่นมายบีบีที่คุณใช้เท่านั้น";
$l['import_stylesheets'] = "นำเข้าสไตล์ชีต";
$l['import_stylesheets_desc'] = "หากชุดรูปแบบนี้มี สไตล์ชีต ที่กำหนดเองก็ควรจะนำเข้า?";
$l['import_templates'] = "นำเข้าแม่แบบ";
$l['import_templates_desc'] = "หากชุดรูปแบบนี้มีแม่แบบที่กำหนดเองก็ควรจะนำเข้า?";
$l['import_theme'] = "นำเข้ารูปแบบ";

$l['new_name_duplicate_desc'] = "ชื่อใหม่สำหรับชุดรูปแบบที่ทำซ้ำ";
$l['duplicate_stylesheets'] = "สไตล์ที่ซ้ำกัน";
$l['duplicate_stylesheets_desc'] = "หากชุดรูปแบบนี้มี สไตล์ชีต ที่กำหนดเองก็ควรจะทำซ้ำ?";
$l['duplicate_templates'] = "แม่แบบที่ซ้ำกัน";
$l['duplicate_templates_desc'] = "หากชุดรูปแบบนี้มีแม่แบบที่กำหนดเองควรจะทำซ้ำ?";

$l['create_a_theme'] = "สร้างรูปแบบ";
$l['name'] = "ชื่อ";
$l['name_desc'] = "ระบุชื่อสำหรับชุดรูปแบบใหม่";
$l['display_order'] = "ลำดับ";

$l['edit_theme_properties'] = "แก้ไขคุณสมบัติของชุดรูปแบบ";
$l['name_desc_edit'] = "ระบุชื่อสำหรับรูปแบบ";
$l['allowed_user_groups'] = "อนุญาตให้กลุ่มผู้ใช้";
$l['allowed_user_groups_desc'] = "เลือกว่าจะอนุญาตให้กลุ่มผู้ใช้กลุ่มใดบ้างที่สามารถใช้ชุดรูปแบบนี้.";
$l['all_user_groups'] = "ทุกกลุ่มผู้ใช้";
$l['template_set'] = "ชุดแม่แบบ";
$l['template_set_desc'] = "ระบุแม่แบบที่กำหนดรูปแบบควรใช้ ชุดแม่แบบที่เลือกกำหนดมาร์กอัป (HTML) ที่ใช้ในการนำเสนอรูปแบบ";
$l['editor_theme'] = "แก้ไขสไตล์";
$l['editor_theme_desc'] = "ระบุสไตล์ที่จะใช้สำหรับการแก้ไข มายโค้ด ในรูปแบบนี้ แก้ไขสไตล์สามารถพบได้ในรูปแบบ <strong>jscripts/editor_themes</strong> โฟลเดอร์";
$l['img_directory'] = "ไดเรกทอรีที่เก็บรูปภาพ";
$l['img_directory_desc'] = "สำหรับสถานที่ตั้งของภาพที่นำมาใช้ในรูปแบบนี้. 
โปรดทราบว่านี้เป็นการระบุไดเรกทอรีสำหรับภาพที่ใช้ในแม่แบบ, ไม่ใช่สไตล์.";
$l['logo'] = "โลโก้ของบอร์ด";
$l['logo_desc'] = "ตำแหน่งที่ตั้งของโลโก้บอร์ดที่ใช้ในรูปแบบนี้ (นี้เป็นโลโก้ที่ปรากฏที่ด้านบนของแต่ละหน้า).";
$l['table_spacing'] = "เว้นพื้นที่ตาราง";
$l['table_spacing_desc'] = "ความกว้างของช่องว่างภายในของเซลล์ตาราง,พิกเซล นี้เป็น HTML's <em>ช่องว่างภายในเซลล์</em> แอตทริบิวต์ของ <em>ตาราง</em> แท็ก";
$l['inner_border'] = "กวามกว้างตารางภายในขอบ";
$l['inner_border_desc'] = "ปริมาณของช่องว่างภายในระหว่างเซลล์ตารางแต่ละ, พิกเซล. นี้เป็น HTML's <em>ช่องว่างภายในเซลล</em> แอตทริบิวต์ของ <em>ตาราง<</em> แท็ก";
$l['save_theme_properties'] = "บันทึกคุณสมบัติรูปแบบ";
$l['save_stylesheet_order'] = "บันทึกลำดับสไตล์";

$l['background'] = "พื้นหลัง";
$l['extra_css_atribs'] = "คุณสมบัติพิเศษ CSS";
$l['color'] = "สี";
$l['width'] = "ความกว้าง";
$l['text_decoration'] = "ตกแต่งตัวอีกษร";
$l['font_family'] = "ตระกูลฟอนต์";
$l['font_size'] = "ขนาดฟอนต์";
$l['font_style'] = "รูปแบบฟอนต์";
$l['font_weight'] = "น้ำหนักฟอนต์";

$l['stylesheets'] = "สไตล์ชีตที่";
$l['inherited_from'] = "สืบทอดมาจาก";
$l['attached_to'] = "ที่แนบมากับ";
$l['attached_to_nothing'] = "ไม่มีอะไรยึดติด";
$l['attached_to_desc'] = "คุณสามารถแนบ สไตล์แบบทั่วไปหรือแบบแฟ้มที่เฉพาะเจาะจงถ้าคุณแนบไปกับไฟล์ที่คุณสามารถแนบไปกับการกระทำที่เฉพาะเจาะจงในแต่ละไฟล์";
$l['actions'] = "ดำเนินการ";
$l['of'] = "ของ";
$l['attached_to_all_pages'] = "ที่แนบมากับหน้าเว็บทั้งหมด";
$l['properties'] = "คุณสมบัติ";
$l['edit_style'] = "แก้ไขสไตล์";
$l['stylesheets_in'] = "สไตล์ใน";
$l['stylesheet_properties'] = "คุณสมบัติสไตล์";
$l['stylesheet_inherited_default'] = "สไตล์นี้กำลังได้รับการสืบทอดมาจาก {1} การเปลี่ยนแปลงใด ๆ ที่คุณทำจะทำลายการสืบทอดและสไตล์จะถูกคัดลอกไปยังชุดรูปแบบนี้";
$l['stylesheet_inherited'] = "สไตล์นี้กำลังได้รับการสืบทอดมาจาก {1} การเปลี่ยนแปลงใด ๆ ที่คุณทำจะทำลายสืบทอดและสไตล์จะถูกคัดลอกไปยังชุดรูปแบบนี้ แก้ไขในสไตล์นี้ {1} เพื่อให้สืบทอด";
$l['globally'] = "ทั่วไป";
$l['specific_files'] = "ไฟล์ที่เฉพาะเจาะจง";
$l['specific_actions'] = "การดำเนินการเฉพาะ";
$l['specific_actions_desc'] = "การดำเนินการให้คั่นด้วยเครื่องหมายจุลภาค";
$l['file'] = "ไฟล์";
$l['add_another'] = "เพิ่มอื่นๆ";
$l['edit_stylesheet_properties_for'] = "แก้ไขคุณสมบัติสไตล์สำหรับ";
$l['file_name'] = "ชื่อไฟล์";
$l['file_name_desc'] = "ชื่อสำหรับสไตล์มักจะลงท้ายด้วย <strong>[.css]</strong>";
$l['save_stylesheet_properties'] = "บันทึกคุณสมบัติสไตล์";
$l['saved'] = "บันทึก";
$l['editing'] = "แก้ไข";
$l['selector'] = "เลือก";
$l['save_changes'] = "บันทึกการเปลี่ยนแปลง";
$l['save_changes_and_close'] = "บันทึกการเปลี่ยนแปลงและปิด";
$l['save_changes_js'] = "คุณต้องการที่จะบันทึกการเปลี่ยนแปลงของคุณก่อน?";
$l['delete_confirm_js'] = "คุณแน่ใจหรือว่าต้องการลบรายการนี้?";
$l['import_stylesheet_from'] = "นำเข้าจากสไตล์ในรูปแบบอื่น ๆ";
$l['write_own'] = "เขียนเนื้อหาของตัวเอง";
$l['save_stylesheet'] = "บันทึกสไตล์";
$l['add_stylesheet_to'] = "เพิ่มสไตล์ไปยัง";

$l['full_stylesheet_for'] = "สไตล์เต็มรูปแบบสำหรับ";

$l['recommended_themes_for_mybb'] = "ชุดรูปแบบที่แนะนำสำหรับเว็บบอร์ด MyBB {1}";
$l['browse_results_for_mybb'] = "ผลการค้นหาเรียกดู เว็บบอร์ด MyBB {1}";
$l['search_for_themes'] = "ค้นหาชุดรูปแบบ";
$l['search'] = "ค้นหา";
$l['download'] = "ดาวน์โหลด";
$l['created_by'] = "สร้างโดย";

$l['error_invalid_stylesheet'] = "คุณได้เลือกสไตล์ที่ไม่ถูกต้อง";
$l['error_invalid_theme'] = "คุณได้เลือกรูปแบบที่ไม่ถูกต้อง";
$l['error_missing_name'] = "กรุณากรอกชื่อสำหรับรูปแบบนี้";
$l['error_missing_url'] = "กรุณาใส่ URL ที่ถูกต้องที่จะนำเข้ารูปแบบจาก URL";
$l['error_theme_already_exists'] = "รูปแบบชื่อเดียวกันอยู่แล้ว โปรดระบุชื่อที่แตกต่างกัน";
$l['error_theme_security_problem'] = "ปัญหาด้านความปลอดภัยที่อาจเกิดขึ้นถูกพบในรูปแบบไม่สามารถเข้ากันได้โปรดติดต่อผู้พัฒนารูปแบบนี้";

$l['error_local_file'] = "ไม่สามารถเปิดไฟล์ท้องถิ่น มันไม่มีอยู่? กรุณาตรวจสอบและลองอีกครั้ง";
$l['error_uploadfailed'] = "อัพโหลดล้มเหลว โปรดลองอีกครั้ง";
$l['error_uploadfailed_detail'] = "รายละเอียดข้อผิดพลาด: ";
$l['error_uploadfailed_php1'] = "PHP ส่งกลับ: Uploaded file exceeded upload_max_filesize directive in php.ini.  กรุณาติดต่อผู้ดูแลบอร์ดของคุณด้วยข้อผิดพลาดนี้.";
$l['error_uploadfailed_php2'] = "ไฟล์ที่อัปโหลดเกินขนาดไฟล์สูงสุดที่ระบุไว้";
$l['error_uploadfailed_php3'] = "อัพโหลดไฟล์อัพโหลดเพียงบางส่วนเท่านั้น";
$l['error_uploadfailed_php4'] = "ไม่มีไฟล์ถูกอัพโหลด";
$l['error_uploadfailed_php6'] = "PHP ส่งกลับ: หายไปยังโฟลเดอร์ชั่วคราว  กรุณาติดต่อผู้ดูแลบอร์ดของคุณด้วยข้อผิดพลาดนี้";
$l['error_uploadfailed_php7'] = "PHP ส่งกลับ: ล้มเหลวในการเขียนไฟล์ไปยังดิสก์  กรุณาติดต่อผู้ดูแลบอร์ดของคุณด้วยข้อผิดพลาดนี้";
$l['error_uploadfailed_phpx'] = "PHP ส่งกลับรหัสข้อผิดพลาด: {1}.  กรุณาติดต่อผู้ดูแลบอร์ดของคุณด้วยข้อผิดพลาดนี้";
$l['error_uploadfailed_lost'] = "ไฟล์ไม่สามารถพบได้บนเซิร์ฟเวอร์";
$l['error_uploadfailed_nocontents'] = "เว็บบอร์ด MyBB ไม่สามารถหารูปแบบที่มีไฟล์ที่คุณอัปโหลด กรุณาตรวจสอบไฟล์ที่ถูกต้องและไม่ได้เสียหาย";
$l['error_invalid_version'] = "รูปแบบนี้ได้รับการเขียนสำหรับรุ่นของ เว็บบอร์ด MyBB อื่น ๆ กรุณาตรวจสอบ \"ติดตั้งได้หมดทุกรุ่น\" แล้วเลือกติ๊กเครื่องหมายถูกเพื่อไม่สนใจข้อผิดพลาดนี้";
$l['error_missing_stylesheet_name'] = "กรุณาใส่ชื่อสำหรับสไตล์นี้";
$l['error_missing_stylesheet_extension'] = "สไตล์นี้จะต้องจบลงด้วยนามสกุลของไฟล์ที่ถูกต้อง ตัวอย่างเช่น, {1}<em>.css</em>";
$l['error_invalid_parent_theme'] = "รูปแบบหลักที่เลือกไม่มีอยู่ กรุณาเลือกรูปแบบหลักที่ถูกต้อง";
$l['error_invalid_templateset'] = "ชุดแม่แบบที่เลือกไมมีอยู่ กรุณาเลือกชุดแม่แบบที่ถูกต้อง";
$l['error_invalid_editortheme'] = "รูปแบบการแก้ไขที่เลือกไม่มีอยู่ กรุณาเลือกรูปแบบการแก้ไขที่ถูกต้อง";
$l['error_inheriting_stylesheets'] = "คุณไม่สามารถลบชุดรูปแบบนี้เพราะยังมีรูปแบบอื่น ๆ ที่ได้รับการสืบทอด สไตล์ชีต จากมัน.";
$l['error_cannot_parse'] = "เว็บบอร์ด MyBB ไม่สามารถแยกสไตล์นี้สำหรับการแก้ไขโหมดง่าย มันสามารถแก้ไขได้เฉพาะในโหมดขั้นสูง";
$l['error_communication_problem'] = "เกิเมีปัญหาในการสื่อสารกับเซิร์ฟเวอร์ ไม่สามารถเชื่อต่อกับชุดรูปแบบ Mybb โปรดลองใหม่อีกครั้งในภายหลัง";
$l['error_no_results_found'] = "ไม่พบผลลัพธ์สำหรับคำค้นหลักที่ระบุ";
$l['error_no_color_picked'] = "คุณไม่ได้ระบุสีที่จะแนบสไตล์นี้";
$l['error_no_display_order'] = "มีข้อผิดพลาดในการหาคำสั่งที่แสดงสำหรับ สไตล์ กรุณารีเฟรชหน้าเว็บและลองอีกครั้ง";

$l['success_duplicated_theme'] = "รูปแบบที่เลือกประสบความสำเร็จในการทำซ้ำ";
$l['success_imported_theme'] = "รูปแบบที่เลือกได้ถูกนำเข้าสำเร็จ";
$l['success_theme_created'] = "รูปแบบได้รับการสร้างประสบความสำเร็จ";
$l['success_theme_deleted'] = "รูปแบบที่เลือกได้ถูกลบประสบความสำเร็จ";
$l['success_stylesheet_properties_updated'] = "คุณสมบัติสำหรับสไตล์ที่เลือกได้รับการปรับปรุงเรียบร้อยแล้ว";
$l['success_stylesheet_updated'] = "สไตล์ที่เลือกได้รับการปรับปรุงเรียบร้อยแล้ว";
$l['success_stylesheet_deleted'] = "สไตล์ที่เลือกที่้ถูกลบออก / เรียกกลับประสบความสำเร็จ";
$l['success_theme_set_default'] = "รูปแบบที่เลือกเป็นค่าเริ่มต้นของเว็บบอร์ด";
$l['success_theme_forced'] = "ผู้ใช้ทุกคนได้ถูกบังคับให้ใช้รูปแบบที่เลือกไว้ประสบความสำเร็จ";
$l['success_theme_properties_updated'] = "คุณสมบัติสำหรับชุดรูปแบบที่เลือกได้รับการปรับปรุงเรียบร้อยแล้ว";
$l['success_stylesheet_added'] = "สไตล์สำหรับรูปแบบนี้ได้รับการสร้างที่ประสบความสำเร็จ";
$l['success_stylesheet_order_updated'] = "คำสั่งแสดงผลสำหรับ สไตล์ได้รับการปรับปรุงเรียบร้อยแล้ว";

$l['confirm_theme_deletion'] = "คุณแน่ใจว่าคุณต้องการลบชุดรูปแบบนี้?";
$l['confirm_stylesheet_deletion'] = "คุณแน่ใจหรือว่าต้องการลบ / เปลี่ยนสไตล์นี้?";
$l['confirm_theme_forced'] = "คุณแน่ใจว่าคุณต้องการที่จะบังคับให้ชุดรูปแบบนี้ใช้ในผู้ใช้ทั้งหมด?";

$l['theme_info_fetch_error'] = 'มีข้อผิดพลาดการเรียกข้อมูลสไตล์';
$l['theme_info_save_error'] = 'มีข้อผิดพลาดบันทึกข้อมูลสไตล์.';

$l['saving'] = 'บันทึก...';

