<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['system_health'] = "สุขภาพของระบบ";
$l['system_health_desc'] = "ที่นี่คุณสามารถดูข้อมูลเกี่ยวกับสุขภาพของระบบของคุณ.";
$l['utf8_conversion'] = "แปลง UTF-8 ";
$l['utf8_conversion_desc'] = "ขณะนี้คุณกำลังแปลงตารางฐานข้อมูลในรูปแบบ UTF-8 โปรดทราบว่าขั้นตอนนี้อาจใช้เวลาหลายชั่วโมงขึ้นอยู่กับขนาดของฟอรั่มของคุณและตารางนี้ 
เมื่อกระบวนการเสร็จสมบูรณ์แล้ว คุณจะได้รกลับไปที่ แปลง UTF-8 ที่หน้าหลัก";
$l['utf8_conversion_desc2'] = "เครื่องมือนี้จะตรวจสอบตารางฐานข้อมูลเพื่อให้แน่ใจว่าอยู่ในรูปแบบ UTF-8 และช่วยให้คุณสามารถแปลงมันหากพบว่ามันไม่ได้เป็น UTF-8.";

$l['convert_all'] = "แปลงทั้งหมด";
$l['converting_to_utf8'] = "แปลงMyBB อยู่ในขณะนี้ \"{1}\" ตาราง UTF-8 การเข้ารหัสภาษาจาก {2} การเข้ารหัส.";
$l['convert_to_utf8'] = "คุณกำลังจะแปลง \"{1}\" ตารางการเข้ารหัส UTF-8 ภาษาจาก{2} การเข้ารหัส";
$l['convert_all_to_utf'] = "คุณกำลังจะแปลงตารางทั้งหมดในการเข้ารหัส UTF-8 ภาษาจาก{1} การเข้ารหัส.";
$l['convert_all_to_utf8mb4'] = "คุณกำลังจะแปลงตารางทั้งหมดถึง 4 ไบต์การเข้ารหัสภาษา UTF-8 Unicode จาก{1} การเข้ารหัส";
$l['converting_to_utf8mb4'] = "แปลงMyBB อยู่ในขณะนี้ \"{1}\" ตารางที่ 4 ไบต์การเข้ารหัสภาษา UTF-8 Unicode จาก {2} การเข้ารหัส";
$l['please_wait'] = "โปรดรอสักครู่...";
$l['converting_table'] = "แปลงตาราง:";
$l['convert_table'] = "แปลงตาราง";
$l['convert_tables'] = "แปลงตารางทั้งหมด";
$l['convert_database_table'] = "แปลงตารางฐานข้อมูล";
$l['convert_database_tables'] = "แปลงตารางฐานข้อมูล";
$l['table'] = "Table";
$l['status_utf8'] = "สถานะ UTF-8 ";
$l['status_utf8mb4'] = "4 ไบต์รองรับ UTF-8<br />(ต้องใช้ MySQL 5.5.3 หรือสูงกว่า)";
$l['not_available'] = "ไม่สามารถใช้ได้";
$l['all_tables'] = "ตารางทั้งหมด";
$l['convert_now'] = "แปลงตอนนี้";
$l['totals'] = "ผลรวม";
$l['attachments'] = "ไฟล์แนบ";
$l['total_database_size'] = "ขนาดรวมฐานข้อมูล";
$l['attachment_space_used'] = "พื้นที่ไฟล์แนบที่ใช้";
$l['total_cache_size'] = "ขนาดแคชทั้งหมด";
$l['estimated_attachment_bandwidth_usage'] = "การใช้งานแบนด์วิดธ์ไฟล์แนบโดยประมาณ";
$l['max_upload_post_size'] = "การอัพโหลดสูงสุด / ขนาดโพสต์";
$l['average_attachment_size'] = "เฉลี่ยขนาดไฟล์แนบ";
$l['stats'] = "สถิติ";
$l['task'] = "งาน";
$l['run_time'] = "เวลาในการใช้";
$l['next_3_tasks'] = "ถัดไป 3 งาน";
$l['no_tasks'] = "ไม่มีมีงานที่ทำงานในเวลานี้";
$l['backup_time'] = "สำรอง";
$l['no_backups'] = "ขณะนี้ม่มียังไม่มีการสำรองข้อมูล";
$l['existing_db_backups'] = "การสำรองฐานข้อมูลที่มีอยู่";
$l['writable'] = "ที่สามารถเขียนได้";
$l['not_writable'] = "ไม่สามารถเขียนได้";
$l['please_chmod_777'] = "กรุณา CHMOD เป็น 777.";
$l['chmod_info'] = "กรุณาเปลี่ยนการตั้งค่า CHMOD ที่ระบุมีไฟล์ด้านล่าง สำหรับข้อมูลเพิ่มเติมเกี่ยว CHMODing ดู";
$l['file'] = "ไฟล์";
$l['location'] = "สถานที่ตั้ง";
$l['settings_file'] = "การตั้งค่าไฟล์";
$l['config_file'] = "การกำหนดค่าไฟล์";
$l['file_upload_dir'] = "์ไดเรกทอรอัพโหลดไฟลี";
$l['avatar_upload_dir'] = "ไดเรกทอรีอัพโหลดรูปส่วนตัว";
$l['language_files'] = "ไฟล์ภาษา";
$l['backup_dir'] = "ไดเรกทอรีสำรองข้อมูล";
$l['cache_dir'] = "ไดเรกทอรีแคช";
$l['themes_dir'] = "ไดเรกทอรีรูปแบบ";
$l['chmod_files_and_dirs'] = "ไฟล์และไดเรกทอรี CHMOD";

$l['notice_process_long_time'] = "กระบวนการนี้อาจใช้เวลาหลายชั่วโมงขึ้นอยู่กับขนาดของฟอรั่มของคุณและตารางนี้<strong>ขอแนะนำในการสร้างการสำรองฐานข้อมูลกระบวนการนี้ไม่สามารถยกเลิกได้</strong>";
$l['notice_mb4_warning'] = "4 ไบต์รองรับ UTF-8 ต้องใช้ MySQL 5.5.3 หรือสูงกว่า คุณจะไม่สามารถที่จะนำเข้าฐานข้อมูลของคุณบนเซิร์ฟเวอร์ MySQL กับรุ่นอื่น.";

$l['check_templates'] = "การตรวจสอบแม่แบบ";
$l['check_templates_desc'] = "ตรวจสอบแม่แบบที่ติดตั้งทั้งหมดสำหรับปัญหาด้านความปลอดภัยที่รู้จัก";
$l['check_templates_title'] = "ตรวจสอบการรักษาความปลอดภัยแม่แบบ";
$l['check_templates_info'] = "กระบวนการนี้จะตรวจสอบแม่แบบกับปัญหาด้านความปลอดภัยที่อาจส่งผลกระทบต่อฟอรั่มและเซิร์ฟเวอร์ของคุณ การทำงานนี้อาจใช้เวลา่ถ้าคุณได้ติดตั้งไว้หลายรูปแบบ
<br /><br />เพื่อเริ่มต้นกระบวนการให้กด 'ดำเนินการ' ปุ่มด้านล่าง";
$l['check_templates_info_desc'] = "แม่แบบด้านล่างที่ตรงกับปัญหาด้านความปลอดภัย กรุณาตรวจสอบ";
$l['full_edit'] = "แก้ไขเต็มรูปแบบ";

$l['error_chmod'] = "ไฟล์ที่และไดเรกทอรีที่จำเป็นไม่ได้มีการตั้งค่า CHMODที่เหมาะสม.";
$l['error_invalid_table'] = "ตารางที่ระบุไม่มีอยู่.";
$l['error_db_encoding_not_set'] = "การตั้งค่า MyBB ปัจจุบันของคุณ ไม่ได้ติดตั้งการใช้เครื่องมือนี้ยัง โปรดดู <a href=\"http://docs.mybb.com/Utf8_setup.html\">เอกสาร MyBB</a> สำหรับข้อมูลเพิ่มเติมเกี่ยวกับวิธีการที่จะตั้งขึ้น";
$l['error_not_supported'] = "โปรแกรมฐานข้อมูลปัจจุบันของคุณจะไม่ได้รับการสนับสนุนโดยเครื่องมือแปลง UTF-8";
$l['error_invalid_input'] = "มีปัญหาในการตรวจสอบแม่แบบที่เป็น โปรดลองอีกครั้งหรือติดต่อ MyBB Group สำหรับการสนับสนุน";
$l['error_master_templates_altered'] = "แม่แบบมีการเปลี่ยนแปลง กรุณาติดต่อ MyBB Group สำหรับการสนับสนุนเกี่ยวกับการเปลี่ยนแปลงเหล่านี้";
$l['error_utf8mb4_version'] = "รุ่น MySQL ของคุณไม่สนับสนุนการเข้ารหัส UTF-8 4 ไบต์ ";


$l['warning_multiple_encodings'] = "ก็ขอแนะนำไม่ให้ใช้การเข้ารหัสที่แตกต่างกันในฐานข้อมูลของคุณ นี้อาจทำให้เกิดพฤติกรรมที่ไม่คาดคิดหรือข้อผิดพลาด MySQL";
$l['warning_utf8mb4_config'] = "สาหรับ UTF-8 รองรับแบบ 4 ไบต์  ที่คุณจำเป็นต้องเปลี่ยน <i>\$config['database']['encoding'] = 'utf8';</i> ไป <i>\$config['database']['encoding'] = 'utf8mb4';</i> ใน inc/config.php.";

$l['success_templates_checked'] = "แม่แบบที่ประสบความสำเร็จในการตรวจสอบ - ไม่มีปัญหาด้านความปลอดภัยที่พบ!";
$l['success_all_tables_already_converted'] = "ตารางทั้งหมดได้รับการแปลงแล้วหรือมีอยู่แล้วในรูปแบ UTF-8 ";
$l['success_table_converted'] = "ตารางที่เลือก\"{1}\" ได้แปลงเป็น UTF-8 ที่ประสบความสำเร็จ.";
$l['success_chmod'] = "ทั้งหมดของไฟล์และไดเรกทอรีที่ต้องการมีการตั้งค่า CHMOD ที่เหมาะสม";
