<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */


$l['database_backups'] = "การสำรองฐานข้อมูล";
$l['database_backups_desc'] = "ที่นี่คุณจะพบรายชื่อของการสำรองฐานข้อมูลที่เก็บอยู่ในปัจจุบันบนเว็บเซิร์ฟเวอร์ของคุณในไดเรกทอรี MyBB สำรอง";
$l['new_database_backup'] = "สำรองฐานข้อมูลใหม่";
$l['new_backup'] = "สำรองข้อมูลใหม่";
$l['new_backup_desc'] = "ที่นี่คุณสามารถสำรองข้อมูลสำเนาของฐานข้อมูลของคุณ";
$l['backups'] = "สำรองข้อมูล";
$l['existing_database_backups'] = "สำรองข้อมูลที่มีอยู่ในฐานข้อมูล";

$l['backup_saved_to'] = "การสำรองข้อมูลที่ได้รับการบันทึกไว้ใน:";
$l['download'] = "ดาวน์โหลด";
$l['table_selection'] = "เลือกตาราง";
$l['backup_options'] = "ตัวเลือกสำรองข้อมูล";
$l['table_select_desc'] = "คุณอาจจะเลือกตารางฐานข้อมูลที่คุณต้องการที่จะดำเนินการนี้ในที่นี่ กด CTRL ค้างเพื่อเลือกหลายตาราง";
$l['select_all'] = "เลือกทั้งหมด";
$l['deselect_all'] = "ยกเลิกการเลือกทั้งหมด";
$l['select_forum_tables'] = "เลือกตารางบอร์ด";
$l['file_type'] = "ชนิดของไฟล์";
$l['file_type_desc'] = "เลือกประเภทไฟล์ที่คุณต้องการสำรองฐานข้อมูลที่บันทึกไว้เป็น.";
$l['gzip_compressed'] = "บีบอัด GZIP";
$l['plain_text'] = "ข้อความธรรมดา";
$l['save_method'] = "วิธีการบันทึก";
$l['save_method_desc'] = "เลือกวิธีที่คุณต้องการจะใช้ในการบันทึกข้อมูลสำรอง";
$l['backup_directory'] = "ไดเรกทอรีสำรองข้อมูล";
$l['backup_contents'] = "สำรองข้อมูลเนื้อหา";
$l['backup_contents_desc'] = "เลือกข้อมูลที่คุณต้องการรวมอยู่ในการสำรองข้อมูล";
$l['structure_and_data'] = "โครงสร้างและข้อมูล";
$l['structure_only'] = "โครงสร้างเท่านั้น";
$l['data_only'] = "ข้อมูลเท่านั้น";
$l['analyze_and_optimize'] = "การวิเคราะห์และเพิ่มประสิทธิภาพของตารางที่เลือก";
$l['analyze_and_optimize_desc'] = "คุณต้องการเลือกตารางที่จะวิเคราะห์และเพิ่มประสิทธิภาพในการสำรองข้อมูล?";
$l['perform_backup'] = "ดำเนินการสำรองข้อมูล";
$l['backup_filename'] = "ชื่อไฟล์สำรองข้อมูล";
$l['file_size'] = "ขนาดไฟล์";
$l['creation_date'] = "วันที่สร้าง";
$l['no_backups'] = "ขณะนี้มีการสำรองข้อมูลที่ยังไม่ทำ";

$l['error_file_not_specified'] = "คุณไม่ได้ระบุการสำรองฐานข้อมูลในการดาวน์โหลด";
$l['error_invalid_backup'] = "สำรองไฟล์ที่คุณเลือกอย่างใดอย่างหนึ่งที่ไม่ถูกต้องหรือไม่มีอยู่.";
$l['error_backup_doesnt_exist'] = "การสำรองข้อมูลที่ระบุไม่มีอยู่";
$l['error_backup_not_deleted'] = "การสำรองข้อมูลที่ยังไม่ได้ถูกลบไปแล้ว.";
$l['error_tables_not_selected'] = "คุณไม่ได้เลือกตารางใด ๆ ในการสำรองข้อมูล";
$l['error_no_zlib'] = "ไลบรารี zlib สำหรับ PHP ไม่ได้เปิดใช้ - คุณไม่สามารถสร้างการสำรองข้อมูล GZIPที่ถูกบีบอัด.";

$l['alert_not_writable'] = "ไดเรกทอรีสำรองข้อมูลของคุณ (ภายในไดเรกทอรีAdmin CP) ไม่สามารถเขียนได้ คุณไม่สามารถบันทึกการสำรองข้อมูลบนเซิร์ฟเวอร์";

$l['confirm_backup_deletion'] = "คุณแน่ใจว่าคุณต้องการที่จะลบการสำรองข้อมูลนี้?";

$l['success_backup_deleted'] = "การสำรองข้อมูลที่ถูกลบไปแล้วประสบความสำเร็จ.";
$l['success_backup_created'] = "การสำรองข้อมูลที่ได้รับการสร้างที่ประสบความสำเร็จ";

