<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['recount_rebuild'] = "นับใหม่ และ สร้างใหม่";
$l['recount_rebuild_desc'] = "ที่นี่คุณสามารถนับใหม่และสร้างข้อมูลใหม่เพื่อแก้ไขข้อผิดพลาดในการประสานใด ๆ ในฟอรั่มของคุณ";

$l['data_per_page'] = "รายการข้อมูลต่อหน้า";
$l['recount_stats'] = "สถิตินับใหม่";
$l['recount_stats_desc'] = "ซึ่งจะนับใหม่และปรับปรุงสถิติเว็บบอร์ดของคุณที่หน้าแรกและสถิติหน้าบอร์ด";
$l['recount_reputation'] = "ชื่อเสียงนับใหม่";
$l['recount_reputation_desc'] = "ซึ่งจะนับชื่อเสียงของผู้ใช้แต่ละคนใหม่.";
$l['recount_warning'] = "นับคะแนนคำเตือนใหม่";
$l['recount_warning_desc'] = "ซึ่งจะนับคะแนนเตือนที่ใช้งานของผู้ใช้แต่ละคนใหม่.";
$l['recount_private_messages'] = "นับข้อความส่วนตัวใหม่";
$l['recount_private_messages_desc'] = "ซึ่งจะนับข้อความส่วนตัวสำหรับผู้ใช้แต่ละคนใหม่";
$l['recount_referrals'] = "แน่ะนับใหม่";
$l['recount_referrals_desc'] = "นี้จะนับใหม่การนับจำนวนการแนะนำไของผู้ใช้แต่ละคน.";
$l['recount_thread_ratings'] = "นับใหม่คะแนนกระทู้";
$l['recount_thread_ratings_desc'] = "นี้จะนับใหม่คะแนนของแต่ละกระทู้";
$l['rebuild_forum_counters'] = "สร้างใหม่ตัวนับบอร์ด";
$l['rebuild_forum_counters_desc'] = "เมื่อมีการเรียกใช้ /ตัวนับกระทู้โพสต์และโพสต์ล่าสุดของบอร์ดแต่ละคนจะได้รับการปรับปรุงเพื่อให้สอดคล้องกับค่าที่ถูกต้อง.";
$l['rebuild_thread_counters'] = "สร้างใหม่ตัวนับกระทู้";
$l['rebuild_thread_counters_desc'] = "เมื่อมีการเรียกใช้ / ตัวนับเข้าชมและโพสต์โพสต์ล่าสุดของแต่ละกระทู้จะมีการปรับปรุงเพื่อให้สอดคล้องกับค่าที่ถูกต้อง";
$l['rebuild_poll_counters'] = "สร้างใหม่ตัวนับแบบสำรวจ";
$l['rebuild_poll_counters_desc'] = "เมื่อมีการเรียกใช้ตัวนับออกเสียงลงคะแนนและจำนวนเสียงทั้งหมดของการสำรวจแต่ละครั้งจะมีการปรับปรุงเพื่อให้สอดคล้องกับค่าที่ถูกต้อง";
$l['recount_user_posts'] = "นับโพสต์ของผู้ใช้ใหม่";
$l['recount_user_posts_desc'] ="เมื่อมีการเรียกใช้การนับการโพสต์สำหรับผู้ใช้แต่ละคนจะได้รับการปรับปรุงให้สะท้อนมูลค่าที่อยู่อาศัยในปัจจุบันขึ้นอยู่กับการโพสต์ในฐานข้อมูลและฟอรั่มที่มีจำนวนโพสต์ปิดการใช้งาน";
$l['recount_user_threads'] = "นับใหม่ตัวนับกระทู้ผู้ใช้งาน";
$l['recount_user_threads_desc'] = "เมื่อมีการเรียกใช้นับกระทู้สำหรับผู้ใช้แต่ละคนจะได้รับการปรับปรุงให้สะท้อนมูลค่าที่อยู่อาศัยในปัจจุบันตามหัวข้อในฐานข้อมูลและฟอรั่มที่มีนับด้ายปิดใช้งาน";
$l['rebuild_attachment_thumbs'] = "สร้างใหม่ไฟล์แนบภาพขนาดย่อ";
$l['rebuild_attachment_thumbs_desc'] = "นี้จะสร้างภาพตัวอย่างที่แนบมาเพื่อให้แน่ใจว่าใช้ความกว้างและความสูงขนาดปัจจุบันและยังจะสร้างภาพขนาดเล็กที่ขาดหายไป";

$l['success_rebuilt_forum_counters'] = "ตัวนับบอร์ดได้รับการสร้างขึ้นมาใหม่ประสบความสำเร็จ";
$l['success_rebuilt_thread_counters'] = "ตัวนับกระทู้ได้รับการสร้างขึ้นมาใหม่ประสบความสำเร็จ";
$l['success_rebuilt_poll_counters'] = "ตัวนับการสำรวจความคิดเห็นที่ได้รับการสร้างขึ้นมาใหม่ประสบความสำเร็จ";
$l['success_rebuilt_user_post_counters'] = "นับแบบสำรวจทั้งหมดได้รับการนับใหม่ประสบความสำเร็จ";
$l['success_rebuilt_user_thread_counters'] = "นับหัวข้อผู้ใช้ได้รับการนับใหม่ประสบความสำเร็จ";
$l['success_rebuilt_attachment_thumbnails'] = "ไฟล์แนบรูปภาพได้รับการสร้างขึ้นมาใหม่ประสบความสำเร็จ";
$l['success_rebuilt_forum_stats'] = "สถิติเว็บบอร์ดได้รับการสร้างขึ้นมาใหม่ประสบความสำเร็จ";
$l['success_rebuilt_reputation'] = "ชื่อเสียงของของผู้ใช้ได้รับการสร้างขึ้นมาใหม่ประสบความสำเร็จ";
$l['success_rebuilt_warning'] = "คะแนนเตือนของผู้ใช้ที่ได้รับการสร้างขึ้นมาใหม่ประสบความสำเร็จ";
$l['success_rebuilt_private_messages'] = "การนับข้อความส่วนตัวของผู้ใช้ได้รับการนับใหม่ประสบความสำเร็จ";
$l['success_rebuilt_referral'] = "การนับการแนะนำของผู้ใช้ที่ได้รับการนับใหม่ประสบความสำเร็จ";
$l['success_rebuilt_thread_ratings'] = "การจัดอันดับหัวข้อที่ได้รับการนับใหม่ประสบความสำเร็จ";

$l['confirm_proceed_rebuild'] = "คลิก \"ดำเนินการ\" เพื่อดำเนินการต่อนับใหม่และสร้างกระบวนการ";
$l['automatically_redirecting'] = "กำลังเปลี่ยนเส้นทางโดยอัตโนมัติ...";

