<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['file_verification'] = "การตรวจสอบไฟล์";
$l['checking'] = "การตรวจสอบ...";
$l['file_verification_message'] = "กระบวนการนี้จะเริ่มต้นตรวจสอบไฟล์ทั้งหมดของ MyBB เพื่อตรวจสอบความถูกต้อง กด ใช่ ดำเนินการต่อไป<br /> <small>โปรดทราบว่ากระบวนการนี้ไม่สามารถแยกความแตกต่างระหว่างการปรับเปลี่ยนที่กำหนดเองและความเสียหายที่เกิดขึ้นจริงในแฟ้ม ดังนั้นคุณควรใช้ความระมัดระวังในการคืนไฟล์ขั้นตอนอาจนี้กลับมาเป็น \"เสรื่อมโทรม\".</small>";

$l['error_communication'] = "มีปัญหาในการสื่อสารกับเซิร์ฟเวอร์ MyBB  โปรดลองอีกครั้งในไม่กี่นาที";
$l['file'] = "ไฟล์";
$l['no_corrupt_files_found'] = "ขอแสดงความยินดี ไม่มีไฟล์ที่เสียหายได้รับการพบในการติดตั้ง";
$l['found_problems'] = "ปัญหาที่พบ";
$l['no_problems_found'] = "ไม่มีปัญหาที่ตรวจพบ";
$l['changed'] = "เปลี่ยน";
$l['missing'] = "หายไป";
$l['status'] = "สถานะ";

