<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['task_manager'] = "ตัวจัดการงาน";
$l['add_new_task'] = "เพิ่มงานใหม่";
$l['add_new_task_desc'] = "ที่นี่คุณสามารถสร้างงานที่กำหนดเวลาใหม่ที่จะทำงานโดยอัตโนมัติบนบอร์ดของคุณ.";
$l['edit_task'] = "แก้ไขงาน";
$l['edit_task_desc'] = "ด้านล่างนี้คุณสามารถแก้ไขการตั้งค่าต่างๆสำหรับงานที่กำหนดเวลาแก้ไขงาน.";
$l['task_logs'] = "บันทึกงาน";
$l['view_task_logs'] = "ดูบันทึกงาน";
$l['view_task_logs_desc'] = "เมื่องานมีการเรียกใช้และเข้าสู่ระบบมีการใช้งานผลใด ๆ หรือข้อผิดพลาดจะได้รับการระบุไว้ด้านล่าง รายการที่มีอายุมากกว่า 30 วันจะถูกลบโดยอัตโนมัติ.";
$l['scheduled_tasks'] = "งานที่กำหนดเวลา";
$l['scheduled_tasks_desc'] = "ที่นี่คุณสามารถจัดการงานที่ทำงานโดยอัตโนมัติบนบอร์ดของคุณ เมื่อต้องการเรียกใช้งานตอนนี้คลิกที่ไอคอนด้านขวาของงาน.";

$l['title'] = "ชื่อเรื่อง";
$l['short_description'] = "คำอธิบายสั้น";
$l['task_file'] = "งานไฟล์";
$l['task_file_desc'] = "เลือกไฟล์งานที่คุณต้องการงานนี้เพื่อให้ทำงานได้";
$l['time_minutes'] = "เวลา: นาที";
$l['time_minutes_desc'] = "ป้อนรายการที่คั่นด้วยเครื่องหมายจุลภาคี ที่งานนี้ควรจะทำงานบน (0-59)นาท   ใส่ "*" ถ้างานนี้ควรทำงานในทุกนาที";
$l['time_hours'] = "เวลา: ชั่วโมง";
$l['time_hours_desc'] = "ป้อนรายการที่คั่นชั่วโมงด้วยเครื่องหมายจุลภาค ที่งานนี้ควรจะทำงานบน (0-23)ชั่วโมง ใส่ "*" ถ้างานนี้ควรทำงานในทุกชั่วโมง";
$l['time_days_of_month'] = "เวลา: วันของเดือน";
$l['time_days_of_month_desc'] = "ป้อนรายการที่คั่นด้วยเครื่องหมายจุลภาคของวันที่  ที่งานนี้ควรจะทำงานบน (1-31)ใส่ "*" ถ้างานนี้ควรทำงานในทุกวันหรือคุณต้องการที่จะระบุวันทำงานดังต่อไปนี้";
$l['every_weekday'] = "ทุกวัน";
$l['sunday'] = "อาทิตย์";
$l['monday'] = "จันทร์";
$l['tuesday'] = "อังคาร";
$l['wednesday'] = "พุธ";
$l['thursday'] = "พฤหัสบดี";
$l['friday'] = "ศุกร์";
$l['saturday'] = "เสาร์";
$l['time_weekdays'] = "เวลา: วันธรรมดา";
$l['time_weekdays_desc'] = "เลือกวันธรรมดางานนี้ควรจะทำงาน. กด CTRL ค้างไว้เลือกหลายวันธรรมดา เลือก 'ทุกวัน' ถ้าคุณต้องการให้งานนี้ทำงานแต่ละวันหรือคุณได้ป้อนวันที่กำหนดไว้ล่วงหน้าดังกล่าวข้างต้น";
$l['every_month'] = "ทุกเดือน";
$l['time_months'] = "เวลา: เดือน";
$l['time_months_desc'] = "เลือกเดือนงานนี้ควรจะทำงาน. กด CTRL ค้างไว้เลือกหลายเดือน เลือก 'ทุกเดือน' ถ้าคุณต้องการเพื่อให้งานนี้เรียกใช้ในแต่ละเดือน.";
$l['enabled'] = "งานที่เปิดใช้งาน?";
$l['enable_logging'] = "เปิดใช้งานการเข้าสู่ระบบ?";
$l['save_task'] = "บันทึกงาน";
$l['task'] = "งาน";
$l['date'] = "วันที่";
$l['data'] = "ข้อมูล";
$l['no_task_logs'] = "ตอนนี้ไม่มีการบันทึกรายการสำหรับใด ๆ ของงานที่กำหนดเวลา.";
$l['next_run'] = "เรียกใช้ถัดไป";
$l['run_task_now'] = "เรียกใช้งานในตอนนี้";
$l['disable_task'] = "ปิดการใช้งาน";
$l['run_task'] = "เรียกใช้งาน";
$l['enable_task'] = "เปิดใช้งาน";
$l['delete_task'] = "ลบงาน";

$l['error_invalid_task'] = "งานที่ระบุไม่มีอยู่.";
$l['error_missing_title'] = "คุณไม่ได้ป้อนชื่อของงานที่กำหนดนี้";
$l['error_missing_description'] = "คุณไม่ได้ป้อนคำอธิบายสำหรับงานที่กำหนดนี้";
$l['error_invalid_task_file'] = "ไฟล์งานที่คุณเลือกไม่ได้อยู่";
$l['error_invalid_minute'] = "นาทีที่คุณป้อนไม่ถูกต้อง";
$l['error_invalid_hour'] = "ชั่วโมงที่คุณป้อนไม่ถูกต้อง";
$l['error_invalid_day'] = "วันที่คุณป้อนไม่ถูกต้อง";
$l['error_invalid_weekday'] = "วันที่คุณได้เลือกไม่ถูกต้อง";
$l['error_invalid_month'] = "เดือนที่คุณได้เลือกไม่ถูกต้อง";

$l['success_task_created'] = "งานที่ได้รับการสร้างที่ประสบความสำเร็จ";
$l['success_task_updated'] = "งานที่เลือกได้รับการปรับปรุงเรียบร้อยแล้ว.";
$l['success_task_deleted'] = "งานที่เลือกได้ถูกลบประสบความสำเร็จ";
$l['success_task_enabled'] = "งานที่เลือกได้รับการใช้งานที่ประสบความสำเร็จ";
$l['success_task_disabled'] = "งานที่เลือกได้รับการปิดการใช้งานที่ประสบความสำเร็จ";
$l['success_task_run'] = "งานที่เลือกได้ทำงานได้สำเร็จ";

$l['confirm_task_deletion'] = "คุณแน่ใจหรือว่าต้องการลบงานที่กำหนดนี้?";
$l['confirm_task_enable'] = "<strong>คำเตือน:</strong> คุณกำลังจะเปิดใช้งานที่มีความหมายเพียงเพื่อจะทำงานผ่าน cron (โปรดดู <a href=\"http://docs.mybb.com/Help-Task_System.html\" target=\"_blank\">เอกสาร MyBB</a> สำหรับข้อมูลเพิ่มเติม). ดำเนินการต่อ?";
$l['no_tasks'] = "มีงานไม่เกี่ยวกับฟอรั่มของคุณในเวลานี้";
