<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */


$l['mod_logs'] = "บันทึกผู้ดูแล";
$l['mod_logs_desc'] = "ที่นี่คุณสามารถดูตัดตอนและค้นหาบันทึกผู้ดูแล บันทึกเหล่านี้มีการดำเนินการที่ผู้ใช้อาจต้องใช้เวลา (การลบข้อความของตัวเอง / หัวข้อของพวกเขา) และการกระทำอื่น ๆ ทั้งหมดจากผู้ดูแล.";
$l['prune_mod_logs'] = "ตัดบันทึก ผู้ดูแล";
$l['prune_mod_logs_desc'] = "ที่นี่คุณสามารถตัดบันทึกผู้ดูแลที่ตรงกับเกณฑ์ที่กำหนด.";

$l['no_modlogs'] = "ไม่มีรายการบันทึกกับเกณฑ์ที่เลือกเป็น";

$l['username'] = "ชื่อผู้ใช้";
$l['date'] = "วันที่";
$l['action'] = "การดำเนินการ";
$l['information'] = "ข้อมูล";
$l['ipaddress'] = "ที่อยู่ไอพี";

$l['forum'] = "บอร์ด:";
$l['thread'] = "กระทู้:";
$l['post'] = "โพสต์:";
$l['user_info'] = "ผู้ใช้งาน:";
$l['announcement'] = "การประกาศ:";

$l['filter_moderator_logs'] = "กรองบันทึก ผู้ดูแล";
$l['forum_moderator'] = "บอร์ดผู้ดูแล:";
$l['sort_by'] = "จัดเรียงโดย:";
$l['results_per_page'] = "ผลลัพธ์ต่อหน้า:";
$l['all_moderators'] = "ผู้ดูแล ทั้งหมด";
$l['older_than'] = "เก่ากว่า";

$l['forum_name'] = "ชื่อบอร์ด";
$l['thread_subject'] = "เรื่องกระทู้";

$l['asc'] = "จากน้อยไปมาก";
$l['desc'] = "จากมากไปน้อย";

$l['in'] = "ใน";
$l['order'] = "ลำดับ";
$l['days'] = "วัน";

$l['prune_moderator_logs'] = "ตัดบันทึก ผู้ดูแล";
$l['date_range'] = "ช่วงวันที่:";

$l['success_pruned_mod_logs'] = "บันทึกผู้ดูแลได้รับการตัดแต่งที่ประสบความสำเร็จ.";
$l['note_logs_locked'] = "สำหรับเหตุผลด้านความปลอดภัยเข้าสู่ระบบน้อยกว่า 24 ชั่วโมงเก่าไม่สามารถตัดแต่ง.";

