<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

// Tabs
$l['banning'] = "แบน";
$l['banned_accounts'] = "แบนบัญชี";
$l['banned_accounts_desc'] = "ที่นี่คุณสามารถจัดการบัญชีผู้ใช้ที่ได้รับอนุญาตจากการเข้าถึงบอร์ด";
$l['ban_a_user'] = "แบนผู้ใช้";
$l['ban_a_user_desc'] = "ที่นี่คุณสามารถแบนผู้ใช้";
$l['edit_ban'] = "แก้ไขแบน";
$l['edit_ban_desc'] = "ที่นี่คุณสามารถแก้ไขเหตุผลและความยาวของผู้ใช้ที่ไม่ได้รับอนุญาตในปัจจุบัน.";
$l['banned_ips'] = "แบนไอพี";
$l['disallowed_usernames'] = "ชื่อผู้ใช้ที่ไม่ได้รับอนุญาต";
$l['disallowed_email_addresses'] = "ที่อยู่อีเมลไม่ได้รับอนุญาต";

// Errors
$l['error_invalid_ban'] = "คุณได้เลือกแบนที่ไม่ถูกต้องในการแก้ไข";
$l['error_invalid_username'] = "ชื่อผู้ใช้ที่คุณป้อนไม่ถูกต้องและไม่ได้มีอยู่";
$l['error_no_perm_to_ban'] = "คุณไม่ได้รับสิทธิ์ที่จะแบนผู้ใช้รายนี้";
$l['error_already_banned'] = "ผู้ใช้นี้มีอยู่ในไม่ได้รับอนุญาตกลุ่มแล้วและไม่สามารถเพิ่มไปใหม่ได้อีก";
$l['error_ban_self'] = "คุณไม่สามารถแบนตัวเองไอ้";
$l['error_no_reason'] = "คุณไม่ได้ป้อนเหตุผลที่จะแบนผู้ใช้รายนี้";

// Success
$l['success_ban_lifted'] = "แบนที่ยกเลิกได้ประสบความสำเร็จแล้";
$l['success_banned'] = "ผู้ใช้ที่เลือกได้ถูกแบนประสบความสำเร็จ.";
$l['success_ban_updated'] = "แบนที่เลือกได้รับการปรับปรุงเรียบร้อยแล้ว.";
$l['success_pruned'] = "โพสต์และกระทู้ที่เลือกที่ได้รับการตัดแต่งประสบความสำเร็จ.";

// Confirm
$l['confirm_lift_ban'] = "คุณแน่ใจว่าคุณต้องการที่จะยกเลิกคำสั่งแบนนี้?";
$l['confirm_prune'] = "คุณแน่ใจหรือว่าคุณต้องการที่จะตัดกระทู้และโพสต์ทั้งหมดที่สร้างขึ้นโดยผู้ใช้รายนี้?";

//== Pages
//= Add / Edit
$l['autocomplete_enabled'] = "ข้อมูลเปิดใช้งานอัตโนมัติ.";
$l['ban_reason'] = "เหตุผลที่แบน";
$l['ban_group'] = "แบนกลุ่ม<em>*</em>";
$l['ban_group_desc'] = "แบนผู้ใช้นี้ต้องย้ายไปยังแบนกลุ่ม.";
$l['ban_time'] = "ระยะเวลาที่แบน<em>*</em>";

//= Index
$l['user'] = "ผู้ใช้งาน";
$l['moderation'] = "การดูแล";
$l['ban_lifts_on'] = "ยกระดับแบนเมื่อ";
$l['time_left'] = "เวลาที่เหลือ";
$l['permenantly'] = "อย่างถาวร";
$l['na'] = "N/A";
$l['for'] = "สำหรับ";
$l['bannedby_x_on_x'] = "<strong>{1}</strong><br /><small>แบนโดย{2} บน {3} {4}</small>";
$l['lift'] = "ยกระดับ";
$l['no_banned_users'] = "คุณไม่ได้มีผู้ใช้ที่ถูกแบนใด ๆ ในขณะนี้.";
$l['prune_threads_and_posts'] = "ตัดกระทู้และโพสต์";

// Buttons
$l['ban_user'] = "แบนผู้ใช้";
$l['update_ban'] = "ปรับปรุงแบน";
