<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['users'] = "ผู้ใช้";

$l['search_for_user'] = "ค้นหาผู้ใช้งาน";
$l['browse_users'] = "เรียกดูผู้ใช้";
$l['browse_users_desc'] = "ด้านล่างนี้คุณสามารถเลือกผู้ใช้บอร์ดของคุณในมุมมองที่แตกต่างกันชัดเจน มุมมองที่เป็นประโยชน์อย่างยิ่งสำหรับการสร้างชุดผลที่แตกต่างกันกับข้อมูลที่แตกต่างกัน - เช่นค้นหาที่อยู่อาศัยที่บันทึกไว้้.";
$l['find_users'] = "ค้นหาผู้ใช้";
$l['find_users_desc'] = "ที่นี่คุณสามารถค้นหาผู้ใช้เว็บบอร์ดของคุณ. การกรอกข้อมูลค้นหาแบบแคบๆจะดีกว่าการใส่ข้อมูลแบบกว้างๆ; ยิ่งคุณใส่ข้อมูลแบบแคบๆจะเจอได้หลากหลายการใส่ข้อมูลแบบกว้างๆจะคลาดเคลื่อนได้มากกว่า.";
$l['create_user'] = "สร้างผู้ใช้ใหม่";
$l['create_user_desc'] = "ที่นี่คุณสามารถสร้างผู้ใช้ใหม่.";
$l['merge_users'] = "ผสานผู้ใช้";
$l['merge_users_desc'] = "ที่นี่คุณสามารถผสานสองบัญชีผู้ใช้ไว้ในที่เดียวกัน\"แหล่งที่มาของบัญชี\" จะได้รับการรวมอยู่ใน\"บัญชีปลายทาง\"บัญชีต้นทางจะถูกลบทิ้ง <strong>เท่านั้น</strong> ข้อมูลต่างๆของบัญชีต้นทาง การโพสต์กระทู้, ข้อความส่วนตัว กิจกรรม ปฏิทิน จำนวนโพสต์และรายชื่อเพื่อนจะถูกรวมอยู่ในบัญชีปลายทาง<br /><span style=\"font-size: 15px;\">โปรดทราบว่ากระบวนการนี้ทำแล้วจะไม่สามารถยกเลิกได้.</span>";
$l['edit_user'] = "แก้ไขผู้ใช้";
$l['edit_user_desc'] = "ที่นี่คุณสามารถแก้ไขรายละเอียดผู้ใช้ตั้งค่าและลายเซ็น; ดูสถิติทั่วไป และเยี่ยมชมหน้าอื่น ๆ สำหรับข้อมูลเพิ่มเติมเกี่ยวกับการใช้นี้.";
$l['show_referrers'] = "แสดงผู้แนะนำ";
$l['show_referrers_desc'] = "ผลลัพธ์เงื่อนไขการค้นหาของคุณจะถูกแสดงอยู่ด้านล่าง คุณสามารถดูผลลัพธ์ในมุมมองทั้งตารางหรือมุมมองนามบัตร.";
$l['show_ip_addresses'] = "แสดงที่อยู่ ไอพี";
$l['show_ip_addresses_desc'] = "ที่อยู่ ไอพี ลงทะเบียนและ ไอพี ที่โพสต์สำหรับผู้ใช้ที่เลือกจะแสดงอยู่ด้านล่าง ที่อยู่ ไอพี แรกคือการลงทะเบียนไอพี (มันมีการทำเครื่องหมายดังกล่าว). ที่อยู่ไอพีอื่นๆคือ ของผู้ใช้ที่มีการโพสต์กระทู้.";
$l['manage_users'] = "จัดการผู้ใช้";
$l['manage_users_desc'] = "การจัดการผู้ใช้แบบหลายคนรวมกันจะจัดการง่ายกกว่า.";
$l['inline_edit'] = "ดูแลผู้ใช้งานแบบอินไลน์:";
$l['inline_activate'] = "เปิดใช้งานผู้ใช้";
$l['inline_ban'] = "แบนผู้ใช้";
$l['inline_usergroup'] = "เปลี่ยนกลุ่มผู้ใช้";
$l['inline_delete'] = "ลบผู้ใช้";
$l['inline_prune'] = "ตัดออก/ลบโพสท์ของผู้ใช้' ";
$l['inline_activated'] = "{1} ผู้ใช้ เปิดใช้งานประสบความสำเร็จ.";
$l['inline_activated_more'] = "<small>{1} ผู้ใช ที่คุณเลือกถูกเปิดใช้งานอยู่แล้ว.</small>";
$l['inline_activated_failed'] = "ผู้ใช้ทุกคนที่คุณเลือกได้รับการเปิดใช้งานแล้ว.";
$l['ban_time'] = "แบนความยาว<em>*</em>";
$l['ban_reason'] = "แบนเหตุผล";
$l['mass_ban'] = "แบนผู้ใช้";
$l['important'] = "สิ่งที่สำคัญ";
$l['mass_ban_info'] = "การกระทำนี้จะส่งผลกระทบต่อผู้ใช้ {1}  เท่านั้น ดำเนินการต่อหากคุณแน่ใจว่าคุณต้องการที่จะทำเช่นนี้.";
$l['ban_users'] = "แบนผู้ใช้";
$l['users_banned'] = "{1} ผู้ใชถูกแบน.";
$l['confirm_multilift'] = "คุณแน่ใจว่าคุณต้องการที่จะยกระดับแบนสำหรับผู้ใช้ ที่คุณเลือก?";
$l['success_ban_lifted'] = "การแบนสำหรับ {1} ผู้ใช้ ที่คุณเลือกได้รับการยกระดับ.";
$l['edit_ban'] = "แก้ไขแบน";
$l['lift_ban'] = "ยกระดับแบน";
$l['lift_bans'] = "การแบนยกระดับ";
$l['confirm_multidelete'] = "คุณแน่ใจว่าคุณต้องการที่จะลบทั้ง {1} ผู้ใช้ ? นี้ไม่สามารถยกเลิกได้.";
$l['users_deleted'] = "{1} ผู้ใช้(s) ได้ถูกลบออก.";
$l['mass_prune_info'] = "การกระทำนี้จะส่งผลกระทบต่อ{1} ผู้ใช้ หากคุณยังคงจะลบข้อความที่ผู้ใช้ทั้งหมดที่เก่ากว่าวันที่คุณป้อนด้านล่าง.<br /><br /><strong>โปรดทราบว่าถ้าโพสต์ผู้ใช้ใด ๆ 'เป็นโพสต์แรกของกระทู้, กระทู้ทั้งหมดจะถูกลบออก.</strong>";
$l['mass_prune_posts'] = "โพสต์ตัดออกจำนวนมาก";
$l['manual_date'] = "ป้อนวันที่คู่มือ";
$l['relative_date'] = "หรือเลือกตัวเลือกลบ";
$l['multi_selected_dates'] = "คุณได้เลือกทั้งวันธรรมดาและตัวเลือกการตั้งค่า กรุณาเลือกวันที่คู่มือหรือตัวเลือกชุด.";
$l['incorrect_date'] = "วันที่คุณป้อนไม่ถูกต้อง โปรดป้อนวันที่ที่ถูกต้องหรือปล่อยว่างและเลือกตัวเลือกการตั้งค่า.";
$l['prune_complete'] = "ตัดออกเสร็จสมบูรณ์แล้ว.";
$l['prune_fail'] = "ไม่มีโพสต์สำหรับผู้ใช้ที่เลือก ไม่มีโพสต์ได้รับการตัดแต่ง.";
$l['no_prune_option'] = "โปรดป้อนวันที่หรือเลือกตัวเลือกที่จะดำเนินการ.";
$l['prune_posts'] = "ตัดโพสต์ออก";
$l['delete_posts'] = "ลบโพสต์";
$l['usergroup_info'] = "การดำเนินการต่อไปนี้จะส่งผลกระทบต่อ{1} ผู้ใช้ โดยการเลือกตัวเลือกที่ด้านล่าง คุณจะได้รับการเขียนทับผู้ใช้ที่เลือก' หลัก / เพิ่มเติม / กลุ่มผู้ใช้แสดงผล.";
$l['mass_usergroups'] = "เปลี่ยนกลุ่มจำนวนมาก";
$l['success_mass_usergroups'] = "ปรับปรุงผู้ใช้เรียบร้อยแล้ว.";
$l['alter_usergroups'] = "บันทึกการเปลี่ยนแปลง";
$l['no_usergroup_changed'] = "ไม่มีของผู้ใช้ คุณสามารถเลือกเปลี่ยนกลุ่มผู้ใช้ของพวกเขา.";
$l['no_set_option'] = "ไม่ได้รับเลือกตั้งค่าวันที่ที่ถูกต้อง โปรดเลือกตัวเลือกจากช่องใส่หรือป้อนวันที่.";
$l['select_an_option'] = "(เลือกตัวเลือก)";

$l['month_1'] = "มกราคม";
$l['month_2'] = "กุมภาพันธ์";
$l['month_3'] = "มีนาคม";
$l['month_4'] = "เมษายน";
$l['month_5'] = "พฤษภาคม";
$l['month_6'] = "มิถุนายน";
$l['month_7'] = "กรกฎาคม";
$l['month_8'] = "สิงหาคม";
$l['month_9'] = "กันยายน";
$l['month_10'] = "ตุลาคม";
$l['month_11'] = "พฤศจิกายน";
$l['month_12'] = "ธันวาคม";

$l['option_1'] = "เก่ากว่าหนึ่งเดือน";
$l['option_2'] = "เก่าเกินกว่า 3 เดือน";
$l['option_3'] = "เก่าเกินกว่า 6 เดือน";
$l['option_4'] = "เก่ามากขึ้นกว่าปี";
$l['option_5'] = "เก่ามากกว่า 18 เดือน";
$l['option_6'] = "เก่ากว่า 2 ปี";

$l['error_avatartoobig'] = "ขออภัยเราไม่สามารถเปลี่ยนรูปของคุณเป็นรูปประจำตัวได้เนื่องจากรูปของคุณมีขนาดใหญ่เกินไป รูปขนาดสูงสุดต้องไม่เกิน  {1}x{2} (กว้าง x สูง)";
$l['error_invalidavatarurl'] = "ลิงค์ ที่คุณป้อนสำหรับ รูปส่วนตัว ของคุณไม่ถูกต้อง กรุณาให้แน่ใจว่าคุณป้อน ลิงค์ ที่ถูกต้อง.";
$l['error_invalid_user'] = "คุณเลือกผู้ใช้ที่ไม่ถูกต้อง.";
$l['error_no_perms_super_admin'] = "คุณไม่ได้รับสิทธิ์ในการแก้ไขผู้ใช้รายนี้เพราะคุณไม่ได้เป็นผู้ดูแลระดับสูง.";
$l['error_invalid_user_source'] = "บัญชีชื่อผู้ใช้ที่คุณป้อนไม่มีอยู่";
$l['error_invalid_user_destination'] = "บัญชีปลายทางชื่อผู้ใช้ที่คุณป้อนไม่มีอยู่";
$l['error_cannot_merge_same_account'] = "ต้นทางและปลายทางจะต้องมีบัญชีที่แตกต่างกัน";
$l['error_no_users_found'] = "ไม่พบผู้ที่ตรงกับเกณฑ์การค้นหาที่ระบุ โปรดแก้ไขเกณฑ์การค้นหาของคุณและลองอีกครั้ง.";
$l['error_invalid_admin_view'] = "คุณเลือกมุมมองการบริหารงานที่ไม่ถูกต้อง.";
$l['error_missing_view_title'] = "คุณไม่ได้ป้อนชื่อสำหรับมุมมองนี้.";
$l['error_no_view_fields'] = "คุณไม่ได้เลือกเขตข้อมูลใด ๆ ที่จะแสดงในมุมมองนี้";
$l['error_invalid_view_perpage'] = "คุณได้ป้อนตัวเลขที่ไม่ถูกต้องของผลที่จะแสดงต่อหน้า";
$l['error_invalid_view_sortby'] = "คุณเลือกเขตข้อมูลที่ไม่ถูกต้องในการเรียงลำดับผลการค้นหาโดย";
$l['error_invalid_view_sortorder'] = "คุณเลือกลำดับการจัดเรียงที่ไม่ถูกต้อง";
$l['error_invalid_view_delete'] = "คุณเลือกมุมมองการบริหารงานที่ไม่ถูกต้องที่จะลบ";
$l['error_cannot_delete_view'] = "คุณต้องมีอย่างน้อย 1 มุมมองการบริหาร.";
$l['error_inline_no_users_selected'] = "ขออภัยคุณไม่ได้เลือกผู้ใด. กรุณาเลือกผู้ใช้บางคนและลองอีกครั้ง.";
$l['error_cannot_delete_user'] = "ผู้ใช้นี้ไม่สามารถลบได้.";
$l['error_no_referred_users'] = "ผู้ใช้ที่เลือกไม่ได้มีผู้ไดแนะนำมา";

$l['user_deletion_confirmation'] = "คุณแน่ใจหรือว่าคุณต้องการที่จะลบผู้ใช้นี้?";

$l['success_coppa_activated'] = "ผู้ใช้ COPPA ที่เลือกได้รับการเปิดใช้งานที่ประสบความสำเร็จ.";
$l['success_activated'] = "ผู้ใช้ที่เลือกได้รับการเปิดใช้งานที่ประสบความสำเร็จ.";
$l['success_user_created'] = "ผู้ใช้ได้รับการสร้างประสบความสำเร็จ.";
$l['success_user_updated'] = "ผู้ใช้ที่เลือกได้รับการปรับปรุงเรียบร้อยแล้ว.";
$l['success_user_deleted'] = "ผู้ใช้ที่เลือกได้ถูกลบออกประสบความสำเร็จ.";
$l['success_merged'] = "ได้รับประสบความสำเร็จในการผสาน";
$l['succuss_view_set_as_default'] = "มุมมองการบริหารที่เลือกได้รับการตั้งเป็นค่าเริ่มต้นของคุณประสบความสำเร็จ";
$l['success_view_created'] = "มุมมองการบริหารที่ได้รับการสร้างที่ประสบความสำเร็จ.";
$l['success_view_updated'] = "มุมมองการบริหารที่เลือกได้รับการปรับปรุงเรียบร้อยแล้ว.";
$l['success_view_deleted'] = "มุมมองการบริหารที่เลือกได้ถูกลบออกประสบความสำเร็จ.";

$l['confirm_view_deletion'] = "คุณแน่ใจหรือว่าต้องการลบมุมมองที่เลือก?";

$l['warning_coppa_user'] = "<p class=\"alert\"><strong>คำเตือน: </strong> ผู้ใช้นี้กำลังรอการตรวจสอบ COPPA<a href=\"index.php?module=user-users&amp;action=activate_user&amp;uid={1}\">เปิดใช้งานบัญชี</a></p>";

$l['required_profile_info'] = "ข้อมูลรายละเอียดที่จำเป็น";
$l['password'] = "รหัสผ่าน";
$l['confirm_password'] = "ยืนยันรหัสผ่าน";
$l['email_address'] = "ที่อยู่อีเมล";
$l['use_primary_user_group'] = "ใช้งานกลุ่มผู้ใช้หลัก";
$l['primary_user_group'] = "กลุ่มผู้ใช้หลัก";
$l['additional_user_groups'] = "กลุ่มผู้ใช้ที่เพิ่มขึ้น";
$l['additional_user_groups_desc'] = "ใช้ CTRL เพื่อเลือกหลายกลุ่ม";
$l['display_user_group'] = "แสดงกลุ่มผู้ใช้";
$l['save_user'] = "บันทึกผู้ใช้";

$l['overview'] = "ภาพรวม";
$l['profile'] = "ข้อมูลส่วนตัว";
$l['account_settings'] = "การตั้งค่าบัญชี";
$l['signature'] = "ลายเซ็น";
$l['avatar'] = "รูปส่วนตัว";
$l['mod_options'] = "ตัวเลือกผู้ดูแล";
$l['general_account_stats'] = "สถิติบัญชีทั่วไป";
$l['local_time'] = "เวลาท้องถิ่น";
$l['local_time_format'] = "{1} ที่ {2}";
$l['posts'] = "โพสต์";
$l['age'] = "อายุ";
$l['posts_per_day'] = "โพสท์ต่อวัน";
$l['percent_of_total_posts'] = "เปอร์เซ็นต์ของทั้งหมด";
$l['user_overview'] = "ภาพรวมผู้ใช้";

$l['new_password'] = "รหัสผ่านใหม่";
$l['new_password_desc'] = "จำเป็นต้องใช้เฉพาะในกรณีที่มีการเปลี่ยนแปลง";
$l['confirm_new_password'] = "ยืนยันรหัสผ่านใหม่";

$l['optional_profile_info'] = "ข้อมูลรายละเอียดที่ไม่จำเป็น";
$l['custom_user_title'] = "ชื่อผู้ใช้ที่กำหนดเอง";
$l['custom_user_title_desc'] = "หากไม่มีปล่อยว่างไว้จะใช้กลุ่มของระบบ";
$l['website'] = "เว็บไซต์";
$l['icq_number'] = "หมายเลข ICQ";
$l['aim_handle'] = "AIM ";
$l['yahoo_messanger_handle'] = "Yahoo! Messenger ";
$l['skype_handle'] = "Skype";
$l['google_handle'] = "Google Talk ";
$l['birthday'] = "วันเกิด";

$l['away_information'] = "ข้อมูลห่างหาย";
$l['away_status'] = "สถานะห่างหาย:";
$l['away_status_desc'] = "ข้อความจะช่วยแจ้งสถาณะหากคุณต้องการจะออกไปจากเว็บสักระยะ.";
$l['im_away'] = "ฉันห่างหายไป";
$l['im_here'] = "ฉันอยู่ที่นี่";
$l['away_reason'] = "เหตุผลที่ห่างหาย:";
$l['away_reason_desc'] = "ช่วยให้คุณสามารถใส่คำอธิบายเล็ก ๆ ของเหตุผลที่คุณไม่อยู่ (max 200 ตัวอักษร).";
$l['return_date'] = "วันที่เดินทางกลับ:";
$l['return_date_desc'] = "ถ้าคุณรู้ว่าคุณจะกลับมาคุณสามารถใส่วันเดินทางกลับของคุณที่นี่.";
$l['error_acp_return_date_past'] = "คุณไม่สามารถเดินทางย้อนอดีตกลับมา!";

$l['hide_from_whos_online'] = "ซ่อนตัวจากรายการออนไลน์";
$l['login_cookies_privacy'] = "เข้าสู่ระบบ, คุกกี้ &amp; ข้อมูลส่วนบุคคล";
$l['recieve_admin_emails'] = "รับอีเมลจากผู้ดูแลระบบ";
$l['hide_email_from_others'] = "ซ่อนที่อยู่อีเมลจากสมาชิกคนอื่น ๆ";
$l['recieve_pms_from_others'] = "รับข้อความส่วนตัวจากผู้อื่น";
$l['recieve_pms_from_buddy'] = "รับเฉพาะข้อความส่วนตัวจากรายชื่อเพื่อน";
$l['alert_new_pms'] = "แจ้งเตือนเมื่อมีการแจ้งข้อความส่วนตัวใหม่ที่ได้รับให้ทราบล่วงหน้า";
$l['email_notify_new_pms'] = "แจ้งทางอีเมลเมื่อมีข้อความส่วนตัวใหม่ที่ได้รับ";
$l['buddy_requests_pm'] = "รับการแจ้งเตือนสำหรับข้อความส่วนตัวการร้องขอ  เพิ่มเพื่อนใหม่";
$l['buddy_requests_auto'] = "ยอมรับการร้องขอเป็นเพื่อนโดยอัตโนมัติ (ถ้าช่องดังกล่าวข้างต้นเป็น ticked,ข้อความส่วนตัวจะถูกส่งไปแจ้งสำหรับการเชื่อมต่อเพื่อนใหม่)";
$l['default_thread_subscription_mode'] = "รูบแบบเริ่มต้นโหมดการติดตามกระทู้";
$l['do_not_subscribe'] = "ไม่สมัครรับการแจ้งเตือน";
$l['no_email_notification'] = "ไม่ต้องแจ้งเตือนทางอีเมล";
$l['instant_email_notification'] = "แจ้งเตือนทางอีเมลล์ทันที";
$l['messaging_and_notification'] = "ข้อความการแจ้งเตือน";
$l['use_default'] = "ใช้ค่าเริ่มต้น";
$l['date_format'] = "รูปแบบวันที่";
$l['time_format'] = "รูปแบบเวลา";
$l['time_zone'] = "โซนเวลา";
$l['daylight_savings_time_correction'] = "แก้ไขเวลาตามฤดูกาล";
$l['automatically_detect'] = "ตรวจสอบการตั้งค่า DST โดยอัตโนมัติ";
$l['always_use_dst_correction'] = "ใช้การแก้ไข DSTเสมอ";
$l['never_use_dst_correction'] = "ไม่ต้องใช้การแก้ไข DST";
$l['date_and_time_options'] = "ตัวเลือกวันเวลา";
$l['show_threads_last_day'] = "แสดงกระทู้ล่าสุด";
$l['show_threads_last_5_days'] = "แสดงกระทู้จากเมื่อ 5 วันก่อน";
$l['show_threads_last_10_days'] = "แสดงกระทู้จากเมื่อ 10 วันก่อน";
$l['show_threads_last_20_days'] = "แสดงกระทู้จากเมื่อ 20 วันก่อน";
$l['show_threads_last_50_days'] = "แสดงกระทู้จากเมื่อ 50 วันก่อน";
$l['show_threads_last_75_days'] = "แสดงกระทู้จากเมื่อ 75 วันก่อน";
$l['show_threads_last_100_days'] = "แสดงกระทู้จากเมื่อ 100 วันก่อน";
$l['show_threads_last_year'] = "แสดงกระทู้จากเมื่อปีที่แล้ว";
$l['show_all_threads'] = "แสดงกระทู้ทั้งหมด";
$l['threads_per_page'] = "กระทู้ต่อหน้า";
$l['default_thread_age_view'] = "ค่าเริ่มต้นดูอายุกระทู้";
$l['forum_display_options'] = "ตัวเลือกการแสดงบอร์ด";
$l['show_classic_postbit'] = "แสดงโพสต์ในโหมดคลาสสิก";
$l['display_images'] = "ภาพที่แสดงอยู่ในโพสต์";
$l['display_videos'] = "วิดีโอที่แสดงอยู่ในโพสต์";
$l['display_users_sigs'] = "แสดงลายเซ็นผู้ใช้ในโพสต์ของพวกเขา";
$l['display_users_avatars'] = "แสดงรูปผู้ใช้ในโพสต์ของพวกเขา";
$l['show_quick_reply'] = "แสดงกล่องการตอบกลับด่วนที่ด้านล่างของมุมมองกระทู้";
$l['posts_per_page'] = "โพสต์ต่อหน้า";
$l['default_thread_view_mode'] = "เริ่มต้นโหมดดูกระทู้";
$l['linear_mode'] = "แบบเชิงเส้น";
$l['threaded_mode'] = "แบบรายการการตอบ";
$l['thread_view_options'] = "ตัวเลือกดูกระทู้";
$l['show_redirect'] = "แสดงหน้าเปลี่ยนเส้นทางที่เป็นมิตร";
$l['show_code_buttons'] = "แสดงตัวเลือกการจัดรูปแบบมายโค้ดในหน้ารายการ";
$l['source_editor'] = "ใส่โปรแกรมในโหมดแก้ไขแหล่งที่มาโดยค่าเริ่มต้น";
$l['theme'] = "ธีม";
$l['board_language'] = "ภาษาของบอร์ด";
$l['other_options'] = "ตัวเลือกอื่น ๆ";
$l['signature_desc'] = "ตัวเลือกการจัดรูปแบบ: มายโค้ด เป็น{1}, รูปแสดงอารมณ์เป็น{2}, รหัส IMG เป็น{3}, HTML เป็น{4}";
$l['enable_sig_in_all_posts'] = "เปิดใช้งานลายเซ็นในการโพสต์ทั้งหมด";
$l['disable_sig_in_all_posts'] = "ปิดการใช้งานลายเซ็นในการโพสต์ทั้งหมด";
$l['do_nothing'] = "อย่าเปลี่ยนการตั้งค่าลายเซ็น";
$l['signature_preferences'] = "การตั้งค่าลายเซ็น";
$l['suspend_sig'] = "ระงับลายเซ็น";
$l['suspend_sig_box'] = "ระงับลายเซ็นของผู้ใช้นี้";
$l['suspend_sig_perm'] = "<small>ที่ถูกระงับอย่างถาวร.</small>";
$l['suspend_sig_info'] = "ถ้าลายเซ็นถูกระงับผู้ใช้ไม่สามารถแก้ไขได้และมันจะไม่ได้แสดงให้เห็นถึงรายละเอียดในการโพสต์ของพวกเขา";
$l['suspend_sig_extend'] = "<small>ใส่เวลาใหม่ด้านล่างที่จะเปลี่ยนแปลงหรือยกเลิกการเลือกตัวเลือกที่จะลบการระงับนี้.</small>";
$l['suspend_expire_info'] = "<small>วันที่หมดอายุ {1}</small>";
$l['suspend_never_expire'] = "<small>{1} ระงับจะไม่มีวันหมดอายุ (ระงับอย่างถาวร)</small>";
$l['suspend_sig_error'] = "คุณป้อนเวลาในการระงับลายเซ็นของผู้ใช้นี้ไม่ถูกต้อง กรุณากรอกตัวอักษรและเวลาที่ถูกต้อง";

$l['moderate_posts'] = "ดูแลกระทู้";
$l['moderate_posts_info'] = "ดูแลโพสต์ใหม่ {1}.";
$l['moderate_for'] = "ดูแล:";
$l['moderated_perm'] = "<p><small>การตรวจสอบอย่างถาวร.<br />ส่เวลาใหม่ด้านล่างที่จะเปลี่ยนแปลงหรือยกเลิกการเลือกตัวเลือกที่จะลบการดูแลนี้</small></p>";
$l['moderate_length'] = "<p><small>ตรวจสอบจนกระทั่ง {1}.<br />ใส่เวลาใหม่ด้านล่างที่จะเปลี่ยนแปลงหรือยกเลิกการเลือกตัวเลือกที่จะลบการดูแลนี้.</small></p>";

$l['moderate_posts'] = "ดูแลกระทู้";
$l['moderate_posts_info'] = "ดูแลโพสต์ใหม่ {1}.";
$l['moderate_for'] = "ดูแล:";
$l['moderated_perm'] = "<p><small>การตรวจสอบอย่างถาวร.<br />ส่เวลาใหม่ด้านล่างที่จะเปลี่ยนแปลงหรือยกเลิกการเลือกตัวเลือกที่จะลบการดูแลนี้</small></p>";
$l['moderate_length'] = "<p><small>ตรวจสอบจนกระทั่ง {1}.<br />ใส่เวลาใหม่ด้านล่างที่จะเปลี่ยนแปลงหรือยกเลิกการเลือกตัวเลือกที่จะลบการดูแลนี้.</small></p>";

$l['suspendsignature_error'] = "คุณเลือกที่จะระงับลายเซ็นของผู้ใช้นี้ แต่ไม่ได้เข้ามาในช่วงเวลาที่ถูกต้อง. กรุณาใส่เวลาที่ถูกต้องในการดำเนินการต่อหรือยกเลิกการเลือกตัวเลือกที่จะยกเลิก.";
$l['moderateposting_error'] = "คุณเลือกที่จะเป็นผู้ดูแลการโพสต์ของผู้ใช้นี้ แต่ไม่ได้เข้ามาในช่วงเวลาที่ถูกต้อง กรุณาใส่เวลาที่ถูกต้องในการดำเนินการต่อหรือยกเลิกการเลือกตัวเลือกที่จะยกเลิก.";
$l['suspendposting_error'] = "คุณเลือกที่จะระงับการโพสต์ของผู้ใช้นี้ แต่ไม่ได้เข้ามาในช่วงเวลาที่ถูกต้อง กรุณาใส่เวลาที่ถูกต้องในการดำเนินการต่อหรือยกเลิกการเลือกตัวเลือกที่จะยกเลิก.";
$l['suspendmoderate_error'] = "คุณเลือกที่จะระงับในระดับปานกลางและการโพสต์ของผู้ใช้ กรุณาเลือกเพียงหนึ่งชนิดของการดูแล.";

$l['expire_length'] = "ระยะเวลาในการระงับ:";
$l['expire_hours'] = "ชั่วโมง";
$l['expire_days'] = "วัน";
$l['expire_weeks'] = "สัปดาห์";
$l['expire_months'] = "เดือน";
$l['expire_never'] = "ไม่เคย";
$l['expire_permanent'] = "ถาวร";

$l['username'] = "ชื่อผู้ใช้";
$l['email'] = "อีเมล";
$l['primary_group'] = "กลุ่มหลัก";
$l['additional_groups'] = "กลุ่มสมาชิกเพิ่มเติม";
$l['registered'] = "ลงทะเบียน";
$l['last_active'] = "ใช้งานล่าสุด";
$l['post_count'] = "จำนวนโพสต์";
$l['thread_count'] = "จำนวนกระทู้";
$l['reputation'] = "ชื่อเสียง";
$l['warning_level'] = "ระดับการเตือน";
$l['registration_ip'] = "ไอพีที่ลงทะเบียน  ";
$l['last_known_ip'] = "ไอพีที่ใช้ล่าสุด";
$l['registration_date'] = "วันที่ลงทะเบียน";
$l['info_on_ip'] = "ข้อมูลเกี่ยวกับที่อยู่ ไอพี นี้";

$l['current_avatar'] = "รูปส่วนตัวปัจจุบัน";
$l['user_current_using_uploaded_avatar'] = "ขณะนี้ผู้ใช้นี้ใช้รูปส่วนตัว ที่อัปโหลดเอง.";
$l['user_currently_using_remote_avatar'] = "ขณะนี้ผู้ใช้นี้ใช้รูปส่วนตัว ที่เชื่อมโยงมาจากระยะไกล.";
$l['max_dimensions_are'] = "ขนาดสูงสุดสำหรับรูปที่";
$l['avatar_max_size'] = "รูปขนาดใหญ่สุดที่";
$l['remove_avatar'] = "ลบ รูปส่วนตัว ปัจจุบัน?";
$l['avatar_desc'] = "ที่นี่คุณสามารเปลี่ยนหรือแก้ไขรูปส่วนตัวของผู้ใช้ ซึ่งจะใช้แทนตัวบุคคลในเว็บจะปรากฏมื่อพวกเขาโพสต์ข้อความหรือตอบข้อความในกระทู้ ";
$l['avatar_auto_resize'] = "ถ้า รูปส่วนตัว ที่มีขนาดใหญ่เกินไประบบจะมีการปรับขนาดให้โดยอัตโนมัติ";
$l['attempt_to_auto_resize'] = "พยายามที่จะปรับขนาด รูปส่วนตัว นี้ถ้ามันมีขนาดใหญ่เกินไป?";
$l['specify_custom_avatar'] = "รูปส่วนตัวที่กำหนดเอง";
$l['upload_avatar'] = "อัพโหลดรูปส่วนตัว";
$l['or_specify_avatar_url'] = "หรือระบุรูปส่วนตัว/Gravatar URL";

$l['user_notes'] = "หมายเหตุผู้ใช้";

$l['ip_addresses'] = "ที่อยู่ ไอพี";
$l['ip_address'] = "ที่อยู่ ไอพี";
$l['show_users_regged_with_ip'] = "แสดงผู้ใช้ที่ได้ลงทะเบียนกับไอพีนี้";
$l['show_users_posted_with_ip'] = "แสดงผู้ใช้ที่ได้โพสต์กับไอพีนี้";
$l['ban_ip'] = "Ban IP";
$l['ip_address_for'] = "ที่อยู่ ไอพี สำหรับ";

$l['source_account'] = "บัญชีที่มา";
$l['source_account_desc'] = "นี่คือบัญชีที่จะถูกรวมอยู่ในบัญชีปลายทาง มันจะถูกลบออกหลังจากเสร็จขั้นตอนนี้.";
$l['destination_account'] = "บัญชีปลายทาง";
$l['destination_account_desc'] = "นี่คือบัญชีปลายทางจะได้รับการรวมอยู่กับบัญชีที่มา มันจะยังคงอยู่หลังจากกระบวนการนี้สิ้นสุด.";
$l['merge_user_accounts'] = "รวมบัญชีผู้ใช้";

$l['display_options'] = "ตัวเลือกการแสดง";
$l['ascending'] = "จากน้อยไปมาก";
$l['descending'] = "จากมากไปน้อย";
$l['sort_results_by'] = "ผลลัพธ์เรียงลำดับ";
$l['in'] = "ใน";
$l['results_per_page'] = "แสดงผลต่อหน้า";
$l['display_results_as'] = "การแสดงผลเป็น";
$l['business_card'] = "บัตรธุรกิจ";
$l['views'] = "มุมมอง";
$l['views_desc'] = "จัดการมุมมองช่วยให้คุณสร้างมุมมองชนิดที่แตกต่างจากมุมมองในพื้นที่นี้โดยเฉพาะ มุมมองที่แตกต่างกันจะมีประโยชน์สำหรับการสร้างความหลากหลายของรายงาน.";
$l['manage_views'] = "การจัดการการเข้าชม";
$l['none'] = "ไม่มี";
$l['search'] = "ค้นหา";

$l['view_profile'] = "ดูรายละเอียด";
$l['edit_profile_and_settings'] = "แก้ไขการตั้งค่าโปรไฟล์";
$l['ban_user'] = "แบนผู้ใช้";
$l['approve_coppa_user'] = "เปิดใช้งาน COPPA ผู้ใช้";
$l['approve_user'] = "เปิดใช้งานผู้ใช้";
$l['delete_user'] = "ลบผู้ใช้";
$l['show_referred_users'] = "แสดงผู้ใช้เชิญชวน";
$l['show_attachments'] = "แสดงไฟล์แนบ";
$l['table_view'] = "ดูแบบตาราง";
$l['card_view'] = "ดูแบบ การ์ด";

$l['find_users_where'] = "ค้นหาผู้ใช้ที่ไหน ...";
$l['username_contains'] = "ชื่อผู้ใช้ที่มี";
$l['email_address_contains'] = "ที่อยู่อีเมลที่มี";
$l['is_member_of_groups'] = "เป็นสมาชิกของกลุ่มผู้ใช้เหล่านี้";
$l['website_contains'] = "เว็บไซต์ที่มี";
$l['icq_number_contains'] = "หมายเลข ICQ ที่มี";
$l['aim_handle_contains'] = "AIM ที่มี";
$l['yahoo_contains'] = "Yahoo! เมสเซ็นเจอร์ ที่มี";
$l['skype_contains'] = "Skype ที่มี";
$l['google_contains'] = "Google Talk ที่มี";
$l['signature_contains'] = "ลายเซ็นต์ที่มี";
$l['user_title_contains'] = "ชื่อผู้ใช้ที่กำหนดเองที่มี";
$l['greater_than'] = "มากกว่า";
$l['is_exactly'] = "แน่นอน";
$l['less_than'] = "น้อยกว่า";
$l['post_count_is'] = "จำนวนโพสคือ";
$l['thread_count_is'] = "นับกระทู้เป็น";
$l['reg_ip_matches'] = "ตรงกับที่อยู่ไอพีที่ลงทะเบียน";
$l['wildcard'] = "ในการค้นหาช่วงของที่อยู่ IP ใช้* (ตัวอย่าง: 127.0.0.*) หรือ  เครื่องหมายCIDR (ตัวอย่าง: 127.0.0.0/8)";
$l['posted_with_ip'] = "ได้โพสต์ที่มีที่อยู่ไอพี";
$l['custom_profile_fields_match'] = "ข้อมูลที่ตรงกับโปรไฟล์ที่กำหนดเอง ...";
$l['is_not_blank'] = " ไม่ว่างเปล่า";
$l['or'] = "หรือ";
$l['reg_in_x_days'] = "ลงทะเบียนที่ผ่านมา";
$l['days'] = "วัน";

$l['view'] = "ดู";
$l['create_new_view'] = "สร้างมุมมองใหม่";
$l['create_new_view_desc'] = "ที่นี่คุณสามารถกำหนดมุมมองใหม่สำหรับบริเวณนี้ คุณสามารถกำหนดเขตข้อมูลที่คุณต้องการที่จะแสดงให้เห็นว่าเกณฑ์การค้นหาใด ๆ และตัวเลือกการเรียงลำดับ.";
$l['view_manager'] = "จัดการมุมมอง";
$l['set_as_default_view'] = "ตั้งเป็นมุมมองเริ่มต้น?";
$l['enabled'] = "ที่เปิดใช้งาน";
$l['disabled'] = "ปิดการใช้งาน";
$l['fields_to_show'] = "ข้อมูลการแสดง";
$l['fields_to_show_desc'] = "กรุณาเลือกเขตข้อมูลที่คุณต้องการแสดง";
$l['edit_view'] = "แก้ไขดู";
$l['edit_view_desc'] = "ในขณะที่มุมมองการแก้ไขคุณสามารถกำหนดที่ฟิลด์คุณต้องการที่จะแสดงให้เห็นว่าเกณฑ์การค้นหาใด ๆ และตัวเลือกการเรียงลำดับ.";
$l['private'] = "ส่วนตัว";
$l['private_desc'] = "มุมมองนี้จะปรากฏเฉพาะกับคุณ";
$l['public'] = "จำกัด";
$l['public_desc'] = "ผู้บริหารอื่น ๆทั้งหมด สามารถมองเห็นมุมมองนี้";
$l['visibility'] = "การมองเห็น";
$l['save_view'] = "บันทึกการดู";
$l['created_by'] = "สร้างโดย";
$l['default'] = "ค่าเริ่มต้น";
$l['this_is_a_view'] = "นี้เป็น {1} มุมมอง";
$l['set_as_default'] = "ตั้งเป็นค่าเริ่มต้น";
$l['delete_view'] = "ลบการดู";
$l['default_view_desc'] = "มุมมองเริ่มต้นที่สร้างขึ้นโดย MyBB ไม่สามารถแก้ไขหรือลบออก.";
$l['public_view_desc'] = "มุมมองสาธาราณะที่มองเห็นให้กับผู้บริหารทั้งหมด.";
$l['private_view_desc'] = "มุมมองส่วนตัวมองเห็นได้เฉพาะกับตัวเอง.";
$l['table'] = "ตาราง";
$l['title'] = "ชื่อเรื่อง";

$l['view_title_1'] = "ผู้ใช้ทั้งหมด";

$l['emailsubject_activateaccount'] = "เปิดใช้งานบัญชีที่{1}";
$l['email_adminactivateaccount'] = "{1},

ผู้ดูแลระบบได้เปิดใช้งานบัญชีของคุณในบอร์ด{2}.

หากต้องการเปิดโปรดไปที่

{3}

คุณจะสามารถเข้าสู่ระบบด้วยข้อมูลประจำตัวที่คุณลงทะเบียน.

ขอบคุณ,
ทีมงาน {2} ";

$l['ipaddress_misc_info'] = "ข้อมูลอื่น ๆ '{1}'";
$l['ipaddress_host_name'] = "ชื่อโฮสต์";
$l['ipaddress_location'] = " สถานที่ตั้งGeoIP";
