<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['user_group_promotions'] = "โปรโมชั่นกลุ่มของผู้ใช้";
$l['user_group_promotions_desc'] = "ที่นี่คุณสามารถจัดการโปรโมชั่นกลุ่มผู้ใช้.";
$l['edit_promotion'] = "แก้ไขโปรโมชั่น";
$l['edit_promotion_desc'] = "ที่นี่คุณสามารถแก้ไขโปรโมชั่นที่ทำงานโดยอัตโนมัติในบอร์ดของคุณ.";
$l['add_new_promotion'] = "เพิ่มโปรโมชั่น";
$l['add_new_promotion_desc'] = "ที่นี่คุณสามารถสร้างโปรโมชั่นใหม่ที่มีการทำงานโดยอัตโนมัติในบอร์ดของคุณ.";

$l['title'] = "ชื่อเรื่อง";
$l['short_desc'] = "คำอธิบายสั้น";
$l['post_count'] = "จำนวนโพสต์";
$l['thread_count'] = "จำนวนกระทู้";
$l['reputation'] = "ชื่อเสียง";
$l['referrals'] = "แน่ะนำ";
$l['time_registered'] = "เวลาที่ลงทะเบียน";
$l['time_online'] = "เวลาที่ออนไลน์";
$l['promo_requirements'] = "ข้อกำหนดโปรโมชั่น";
$l['promo_requirements_desc'] = "เลือกเงื่อนไขสำหรับโปรกด CTRL ค้างไว้เลือกหลายเงื่อนไข.";
$l['greater_than_or_equal_to'] = "มากกว่าหรือเท่ากับ";
$l['greater_than'] = "ที่มากกว่า";
$l['equal_to'] = "เท่ากับ";
$l['less_than_or_equal_to'] = "น้อยกว่าหรือเท่ากับ";
$l['less_than'] = "น้อยกว่า";
$l['reputation_count'] = "จำนวนชื่อเสียง";
$l['reputation_count_desc'] = "ใส่จำนวนชื่อเสียง เลือกชนิดของการเปรียบเทียบสำหรับชื่อเสียง";
$l['referral_count'] = "จำนวนการแนะนำ";
$l['referral_count_desc'] = "ใส่จำนวนการแนะนำ จะต้องได้รับการคัดเลือกให้เป็นค่าที่จำเป็น.";
$l['warning_points'] = "คะแนนคำเตือน";
$l['warning_points_desc'] = "ใส่คะแนนคำเตือน คะแนนจะคำเตือนเลือกให้เป็นค่าที่ต้องการ.";
$l['post_count_desc'] = "
ใส่จำนวนโพสต์ที่ต้องการ จำนวนโพสต์จะต้องได้รับการคัดเลือกให้เป็นค่าที่ต้องการสำหรับการนี้จะรวม เลือกประเภทของการเปรียบเทียบสำหรับการโพสต์.";
$l['thread_count_desc'] = "ใส่หมายเลขของกระทู้ที่ต้องการ กระทู้จะต้องได้รับการคัดเลือกให้เป็นค่าที่ต้องการสำหรับการที่จะรวม เลือกประเภทของการเปรียบเทียบสำหรับกระทู้.";
$l['hours'] = "ชั่วโมง";
$l['days'] = "วัน";
$l['weeks'] = "สัปดาห์";
$l['months'] = "เดือน";
$l['years'] = "ปีที่ผ่านมา";
$l['time_registered_desc'] = "ใส่จำนวนชั่วโมง, วันสัปดาห์เดือนหรือปีที่ผู้ใช้นี้จะต้องได้รับการลงทะเบียน เวลาที่ลงทะเบียนจะต้องได้รับการคัดเลือกให้เป็นค่าที่ต้องการสำหรับการนี้จะรวม เลือกว่าเวลาจดทะเบียนควรจะนับในชั่วโมงวันสัปดาห์เดือนหรือปี";
$l['time_online_desc'] = "ใส่จำนวนชั่วโมง, วันสัปดาห์เดือนหรือปีที่ผู้ใช้จะต้องออนไลน์ เวลาออนไลน์จะต้องได้รับการคัดเลือกให้เป็นค่าที่ต้องการสำหรับการนี้ ไม่ว่าจะเป็นเวลาที่ใช้จ่ายออนไลน์ควรจะนับในชั่วโมงวันสัปดาห์เดือนหรือปี";
$l['all_user_groups'] = 'ทุกกลุ่มผู้ใช้';
$l['orig_user_group'] = 'กลุ่มผู้ใช้เดิม';
$l['orig_user_group_desc'] = "เลือกกลุ่มผู้ใช้หรือผู้ใช้กลุ่มที่ผู้ใช้จะต้องอยู่ในโปรโมชั่นในการทำงาน กด CTRL ค้างไว้เลือกหลายกลุ่ม.";
$l['new_user_group'] = 'กลุ่มผู้ใช้ใหม่';
$l['new_user_group_desc'] = "เลือกกลุ่มผู้ใช้ที่ผู้ใช้จะถูกย้ายเข้ามาหลังโปรโมชั่น.";
$l['primary_user_group'] = 'กลุ่มผู้ใช้หลัก';
$l['secondary_user_group'] = 'กลุ่มผู้ใช้รอง';
$l['user_group_change_type'] = 'เปลี่ยนประเภทกลุ่มผู้ใช้';
$l['user_group_change_type_desc'] = "Select 'Primary User Group' if the user should have their primary user group changed to the new user group. Select 'Secondary User Group' if the user should have the new user group added as an secondary user group to their profile.";
$l['enabled'] = "เปิดใช้งาน?";
$l['enable_logging'] = "เปิดใช้งานเข้าสู่ระบบ?";
$l['promotion_logs'] = "บันทึกโปรโมชั่น";
$l['view_promotion_logs'] = "ดูบันทึกโปรโมชั่น";
$l['view_promotion_logs_desc'] = 'ที่นี่คุณสามารถดูบันทึกของโปรโมชั่นการทำงานก่อนหน้านี้.';
$l['promoted_user'] = "โปรโมทผู้ใช้";
$l['time_promoted'] = "เวลาโปรโมท";
$l['no_promotion_logs'] = "ขณะนี้มีโปรโมชั่นที่ไม่ได้เข้าสู่ระบบ.";
$l['promotion_manager'] = "จัดการโปรโมชั่น";
$l['promotion'] = "โปรโมชั่น";
$l['disable_promotion'] = "ปิดการใช้งานโปรโมชั่น";
$l['enable_promotion'] = "เปิดใช้งานโปรโมชั่น";
$l['delete_promotion'] = "ลบโปรโมชั่น";
$l['no_promotions_set'] = "ขณะนี้ไม่มีโปรโมชั่น.";
$l['update_promotion'] = "บันทึกโปรโมชั่น";
$l['multiple_usergroups'] = "กลุ่มผู้ใช้หลากหลาย";
$l['secondary'] = "รอง";
$l['primary'] = "หลัก";

$l['error_no_promo_id'] = 'คุณไม่ได้ป้อนรหัสโปรโมชั่น';
$l['error_invalid_promo_id'] = 'คุณไม่ได้ป้อนรหัสโปรโมชั่นที่ถูกต้อง';

$l['error_no_title'] = "คุณไม่ได้ป้อนชื่อสำหรับโปรโมชั่น";
$l['error_no_desc'] = "คุณไม่ได้ป้อนคำอธิบายสำหรับโปรโมชั่น";
$l['error_no_requirements'] = "คุณไม่ได้เลือกอย่างน้อยหนึ่งกย่างที่จำเป็นสำหรับโปรโมชั่น";
$l['error_no_orig_usergroup'] = "คุณไม่ได้เลือกกลุ่มผู้ใช้สำหรับโปรโมชั่น";
$l['error_no_new_usergroup'] = "คุณไม่ได้เลือกกลุ่มผู้ใช้ใหม่อย่างน้อยหนึ่งกลุ่มสำหรับโปรโมชั่นนี้";
$l['error_no_usergroup_change_type'] = "คุณไม่ได้เลือกการเปลี่ยนแปลงกลุ่มผู้ใช้อย่างน้อยหนึ่งประเภทสำหรับการโปรโมชั่น";

$l['success_promo_disabled'] = 'โปรโมชั่นกลุ่มที่เลือกใช้งาน ได้ประสบความสำเร็จแล้ว';
$l['success_promo_deleted'] = 'โปรโมชั่นกลุ่มที่เลือกได้ถูกลบประสบความสำเร็จแล้ว.';
$l['success_promo_enabled'] = 'โปรโมชั่นกลุ่มที่เลือกได้รับการใช้งานที่ประสบความสำเร็จ.';
$l['success_promo_updated'] = 'โปรโมชั่นกลุ่มที่เลือกได้รับการปรับปรุงเรียบร้อยแล้ว.';
$l['success_promo_added'] = 'โปรโมชั่นได้รับการสร้างที่ประสบความสำเร็จ.';

$l['confirm_promo_disable'] = "คุณแน่ใจหรือว่าต้องการที่จะปิดการใช้งานโปรโมชั่น?";
$l['confirm_promo_deletion'] = "คุณแน่ใจหรือว่าต้องการลบโปรโมชั่น?";

