<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['user_titles'] = "ชื่อกลุ่มสมาชิก";
$l['user_titles_desc'] = "ส่วนนี้เป็นการกำหนดกลุ่มระดับของผู้ใช้ ผู้ใช้งานจะอัพระดับเลื่อนขั้นเพิ่มจำนวนด้วยโดยการนับจำนวนกระทู้ของพวกเขา คุณสามารถกำหนดเองได้ที่นี่";
$l['add_new_user_title'] = "เพิ่มกลุ่มสมาชิกใหม่";
$l['add_new_user_title_desc'] = "ส่วนนี้จะช่วยให้คุณสามารถเพิ่มกลุ่มผู้ใช้ใหม่. <i>หมายเหตุ: นี่<strong>ไม่้</strong> ใช่<u><a href=\"index.php?module=user-group_promotions\">ระบบส่งเสริม.</a></u></i>";

$l['error_missing_title'] = "คุณไม่ได้ป้อนชื่อกลุ่มสำหรับกลุ่มผู้ใช้นี้";
$l['error_missing_posts'] = "คุณไม่ได้ป้อนจำนวนขั้นต่ำของกระทู้สำหรับชื่อใช้นี้";
$l['error_cannot_have_same_posts'] = "กลุ่มผู้ใช้ไม่สามารถมีจำนวนกระทู้ขั้นต่ำที่เท่ากันทั้งสองกลุ่ม โปรดแก้ไขใหม่";
$l['error_invalid_user_title'] = "คุณได้ระบุกลุ่มผู้ใช้ที่ไม่ถูกต้อง";

$l['success_user_title_created'] = "กลุ่มผู้ใช้ใหม่ได้รับการสร้างประสบความสำเร็จ.";
$l['success_user_title_updated'] = "กลุ่มผู้ได้รับการปรับปรุงเรียบร้อยแล้ว.";
$l['success_user_title_deleted'] = "กลุ่มผู้ใช้ที่ระบุได้ถูกลบประสบความสำเร็จ.";

$l['title_to_assign'] = "กำหนดชื่อกลุ่ม";
$l['title_to_assign_desc'] = "ชื่อนี้จะไปแสดงที่ใต้ชื่อของสมาชิกหากเขาไม่ได้ใช้ชื่อกลุ่มที่กำหนดเอง.";
$l['minimum_posts'] = "โพสต์ขั้นต่ำ";
$l['minimum_posts_desc'] = "กำหนดกระทู้ขั้นต่ำที่ผู้ใช้ตองโพสต์ให้ได้ตามจำนวนก่อนจึงจะสามารถเข้ากลุ่มนี้ได้";
$l['number_of_stars'] = "จำนวนดาว";
$l['number_of_stars_desc'] = "ใส่จำนวนดาวที่จะแสดงใต้ชื่อของกลุ่มนี้ ถ้าใส่เลข 0 จะไม่แสดงดาว.";
$l['star_image'] = "ที่อยู่รูปดาว";
$l['star_image_desc'] = "ที่อยู่ของรูปดาวที่จะแสดงอยู่ใช้กลุ่มผู้ใชให้ใส่้ {theme} ในช่องด้านล่างเพื่อที่จะได้แสดงรูปดาวทุกๆธีมเมื่อเปลี่ยนธีม.";
$l['save_user_title'] = "บันทึกชื่อกลุ่มสมาชิก";
$l['edit_user_title'] = "แก้ไขชื่อกลุ่มสมาชิก";
$l['edit_user_title_desc'] = "ส่วนนี้จะช่วยให้คุณสามารถแก้ไขชื่อกลุ่มผู้ใช้.";
$l['user_title_deletion_confirmation'] = "คุณแน่ใจว่าคุณต้องการที่จะลบกลุ่มใช้นี้?";
$l['manage_user_titles'] = "จัดการกลุ่มสมาชิก";
$l['user_title'] = "ชื่อกลุ่ม";
$l['no_user_titles'] = "คุณไม่มีชื่อกลุ่มผู้ใช้ที่กำหนดไว้ในขณะนี้";

