<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['contact'] = 'ติดต่อเรา';
$l['contact_no_message'] = 'คุณยังไม่ได้ระบุข้อความที่จะส่ง';
$l['contact_no_subject'] = 'คุณจะต้องใส่เรื่อง';
$l['contact_no_email'] = 'คุณต้องใส่ที่อยู่อีเมลที่ถูกต้อง';
$l['contact_success_message'] = 'ข้อความของคุณได้ถูกส่งไปยังผู้ดูแลระบบประสบความสำเร็จ';
$l['contact_subject'] = 'เรื่อง';
$l['contact_subject_desc'] = 'บทสรุปหัวข้อของข้อความของคุณ';
$l['contact_message'] = 'ข้อความ';
$l['contact_message_desc'] = 'อธิบายรายระเอียดในข้อความของคุณ';
$l['contact_email'] = 'อีเมล';
$l['contact_email_desc'] = 'ใส่อีเมลของคุณเพื่อให้เราสามารถติดต่อคุณกลับได้';
$l['contact_send'] = 'ส่ง';
$l['subject_too_long'] = 'เรื่องยาวเกินไป กรุณาใส่เรื่องที่สั้นกว่า{1} ตัวอักษร (ตอนนี้ {2}).';
$l['message_too_short'] = 'ข้อความสั้นเกินไป กรุณาใส่ข้อความที่มีความยาวกว่า{1} ตัวอักษร (ตอนนี้ {2}).';
$l['message_too_long'] = 'ข้อความยาวเกินไป กรุณาใส่ข้อความสั้นกว่า {1} ตัวอักษร (ตอนนี้ {2}).';

$l['error_stop_forum_spam_spammer'] = 'ขออภัยที่อยู่อีเมลหรือ ไอพี ของคุณตรงกับของสแปมที่เราบล็อกไว้เพราะฉนั้นจึงไม่สามารถส่งข้อความของคุณได้.';
$l['error_stop_forum_spam_fetching'] = 'ขออภัยเกิดข้อผิดพลาดในการตรวจสอบข้อความของคุณเหมือนกันกับฐานข้อมูลผู้ส่งสแปม จึงไม่สามารถส่งได้ โปรดกลับมาทดลองส่งใหม่ในภายหลัง';

