<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['eventdata_missing_name'] = 'ชื่อสำหรับกรณีที่จะหายไป กรุณาใส่ชื่อเหตุการณ์';
$l['eventdata_missing_description'] = 'คำอธิบายสำหรับเหตุการณ์จะหายไป กรุณาใส่คำอธิบายของเหตุการณ์';

$l['eventdata_invalid_start_date'] = 'วันที่เริ่มต้นกิจกรรมป้อนไม่ถูกต้อง คุณจำเป็นต้องให้แน่ใจว่าคุณระบุวันเดือนปีที่ถูกต้อง';
$l['eventdata_invalid_start_year'] = "กิจกรรมจะสามารถสร้างได้ในอีก 5 ปีข้างหน้า กรุณาเลือกปีเริ่มต้นที่เหมาะสมจากรายการ";
$l['eventdata_invalid_start_month'] = 'เดือนเริ่มต้นที่คุณป้อนไม่ถูกต้อง กรุณาป้อนเดือนเริ่มต้นที่ถูกต้อง';

$l['eventdata_invalid_end_date'] = 'วันที่สิ้นสุดกิจกรรมป้อนไม่ถูกต้อง คุณจำเป็นต้องให้แน่ใจว่าคุณระบุวันเดือนและปีถูกต้องแล้ว';
$l['eventdata_invalid_end_year'] = "กิจกรรมจะสามารถสร้างได้ในอีก 5 ปีข้างหน้า กรุณาเลือกปีที่สิ้นสุดที่เหมาะสมจากรายการ.";
$l['eventdata_invalid_end_month'] = 'กิจกรรมจะสามารถสร้างได้ในอีก 5 ปีข้างหน้า กรุณาเลือกปีที่สิ้นสุดที่เหมาะสมจากรายการ';
$l['eventdata_invalid_end_day'] = 'สิ้นวันที่คุณป้อนเป็นวันที่ไม่ถูกต้อง วันที่คุณเลือกอาจจะมากกว่าจำนวนวันในเดือนนี้';

$l['eventdata_cant_specify_one_time'] = "หากคุณกำลังระบุเวลาเริ่มต้นกิจกรรมต้องป้อนเวลาสิ้นสุดกิจกรรม";
$l['eventdata_start_time_invalid'] = "วลาเริ่มต้นที่คุณป้อนไม่ถูกต้อง ตัวอย่างที่ถูกต้องเป็น 12am, 12:01am, 00:01.";
$l['eventdata_end_time_invalid'] = "เวลาสิ้นสุดที่คุณป้อนไม่ถูกต้อง ตัวอย่างที่ถูกต้องเป็น 12am, 12:01am, 00:01.";
$l['eventdata_invalid_timezone'] = "โซนเวลาที่คุณเลือกสำหรับกิจกรรมนี้ไม่ถูกต้อง";
$l['eventdata_end_in_past'] = "วันหรือเวลาที่สิ้นสุดสำหรับกิจกรรมของคุณก่อนที่จะเป็นวันที่หรือเวลาเริ่มต้น";

$l['eventdata_only_ranged_events_repeat'] = "เพียง แต่อยู่ในช่วงกิจกรรม (วันที่ที่กิจกรรมมีจุดเริ่มต้นและสิ้นสุด) สามารถทำซ้ำ";
$l['eventdata_invalid_repeat_day_interval'] = "คุณได้ป้อนช่วงวันที่ซ้ำไม่ถูกต้อง";
$l['eventdata_invalid_repeat_week_interval'] = "คุณได้ป้อนช่วงเวลาสัปดาห์ที่ซ้ำไม่ถูกต้อง";
$l['eventdata_invalid_repeat_weekly_days'] = "คุณไม่ได้เลือกวันธรรมดาใด ๆ สำหรับเหตุการณ์นี้เกิดขึ้นเมื่อวันที่";
$l['eventdata_invalid_repeat_month_interval'] = "คุณได้ป้อนช่วงเวลาเดือนที่ซ้ำไม่ถูกต้อง";
$l['eventdata_invalid_repeat_year_interval'] = "คุณได้ป้อนช่วงเวลาปีที่ซ้ำไม่ถูกต้อง";
$l['eventdata_event_wont_occur'] = "การใช้เริ่มต้นและสิ้นสุดพร้อมกับการตั้งค่าการทำซ้ำกิจกรรมกิจกรรมนี้จะไม่เกิดขึ้น";

$l['eventdata_no_permission_private_event'] = "คุณไม่ได้รับอนุญาตให้โพสต์กิจกรรมส่วนตัว";
