<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['postdata_invalid_user_id'] = 'รหัสผู้ใช้ไม่ได้อยู่ โปรดป้อนรหัสผู้ใช้ที่ถูกต้อง';
$l['postdata_firstpost_no_subject'] = 'ยังไม่ได้ตั้งชื่อหัวข้อกระทู้ กรุณาใส่ชื่อ';
$l['postdata_missing_subject'] = 'คุณยังไม่ได้ใส่ชื่อหัวข้อกรุณาใส่ชื่อหัวข้อก่อน.';
$l['postdata_missing_message'] = 'คุณยังไม่ได้พิมพ์เนื้อหาใดๆในกระทู้นี้กรุณาใส่เนื้อหากระทู้ก่อน';
$l['postdata_message_too_long'] = 'ข้อความยาวเกินไป กรุณาใส่ข้อความสั้นกว่า {1} ตัวอักษร (ในปัจจุบัน {2}).';
$l['postdata_message_too_short'] = 'ข้อความสั้นเกินไป กรุณาใส่ข้อความที่มีความยาวกว่า {1} cตัวอักษร';
$l['postdata_subject_too_long'] = 'หัวข้อยาวเกินไป กรุณาใส่ชื่อเรื่องสั้นกว่า 85 ตัวอักษร (currently {1}).';
$l['postdata_banned_username'] = 'ชื่อผู้ใช้ที่คุณป้อนอาจไม่สามารถลงทะเบียนได้ กรุณาใส่ชื่อผู้ใช้ที่แตกต่างกัน';
$l['postdata_bad_characters_username'] = 'ชื่อผู้ใช้ที่คุณป้อนมีอักขระที่ไม่อนุญาต กรุณาใส่ชื่อผู้ใช้ที่แตกต่างกัน.';
$l['postdata_invalid_username_length'] = 'ความยาวของชื่อผู้ใช้ที่คุณป้อนไม่ถูกต้อง กรุณาใส่ชื่อผู้ใช้ระหว่าง {1} และ {2} ตัวอักษร.';
$l['postdata_username_exists'] = 'ชื่อผู้ใช้ที่คุณป้อนมีอยู่แล้ว กรุณากรอกชื่อผู้ใช้ใหม่ที่แตกต่างจากเดิม';
$l['postdata_post_flooding'] = 'คุณพยายามที่จะโพสต์ข้อความอย่างรวดเร็วเกินไปหลังจากการโพสต์ข้อความก่อนหน้า โปรดรอสัก{1} วินาที';
$l['postdata_post_flooding_one_second'] = 'คุณพยายามที่จะโพสต์ข้อความรวดเร็วเกินไป หลังจากการโพสต์ข้อความก่อนหน้า โปรดรอ เพิ่มเติม 1 วินาที.';
$l['postdata_too_many_images'] = 'ข้อความที่คุณใส่นั้นมีอยู่ {1} รุปภาพ, ขณะที่มีเพียง {2} ภาพต่อข้อความที่ได้รับอนุญาต กรุณาลดจำนวนภาพในข้อความของคุณตามข้อจำกัด';
$l['postdata_too_many_videos'] = 'ข้อความที่คุณใส่นั้นมีอยู่ {1} วิดีโอ, ขณะที่มีเพียง {2} วิดีโอต่อข้อความที่ได้รับอนุญาต กรุณาลดจำนวนการวิดีโอในข้อความของคุณไปตามข้อ จำกัด';
$l['postdata_invalid_prefix'] = 'เลือกคำนำหน้าไม่ถูกต้อง กรุณาเลือกคำนำหน้าที่ถูกต้อง';
$l['postdata_require_prefix'] = 'ฟอรั่มนี้ต้องใช้คำนำหน้าหัวข้อที่จะตั้ง กรุณาเลือกคำนำหน้าที่ถูกต้อง';

$l['thread_closed'] = "ปิดกระทู้";
$l['thread_opened'] = "เปิดกระทู้";
$l['thread_stuck'] = "ปักหมุดกระทู้";
$l['thread_unstuck'] = "ถอนหมุด";

