<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['userdata_missing_username'] = 'คุณยังไม่ได้ป้อนชื่อผู้ใช้';
$l['userdata_banned_username'] = 'ชื่อผู้ใช้ที่คุณป้อนอาจไม่สามารถใช้ได้ กรุณาใส่ชื่อผู้ใช้ที่แตกต่างจากเดิม.';
$l['userdata_bad_characters_username'] = 'ชื่อผู้ใช้ที่คุณป้อนมีอักขระที่ไม่ดี กรุณาใส่ชื่อผู้ใช้ที่แตกต่างกัน';
$l['userdata_invalid_username_length'] = 'ความยาวชื่อผู้ใช้ที่คุณป้อนไม่ถูกต้อง กรุณาใส่ชื่อผู้ใช้ระหว่าง {1} และ{2} ตัวอักษร';
$l['userdata_invalid_usertitle_length'] = 'ความยาวชื่อผู้ใช้ที่กำหนดเองที่คุณป้อนไม่ถูกต้อง กรุณาใส่ชื่อไม่เกิน {1} ตัวอักษร.';
$l['userdata_username_exists'] = 'ชื่อผู้ใช้ที่คุณใส่นั้นมีอยู่แล้ว กรุณาใส่ชื่อผู้ใช้ที่แตกต่างกัน';

$l['userdata_invalid_password_length'] = 'ความยาวของรหัสผ่านที่คุณป้อนไม่ถูกต้อง กรุณาใส่รหัสผ่านระหว่าง {1} และ {2} ตัวอักษร';
$l['userdata_no_complex_characters'] = 'รหัสผ่านที่คุณป้อนไม่ซับซ้อนพอ กรุณาใส่รหัสผ่านที่มีอย่างน้อย {1} ตัวอักษร และต้องมีตัวอักษรตัวพิมพ์ใหญ่และตัวอักษรพิมพ์เล็ก และหมายเลข';
$l['userdata_passwords_dont_match'] = 'รหัสผ่านยืนยันที่คุณป้อนไม่ตรงกัน กรุณายืนยันรหัสผ่านของคุณให้ตรงกัน.';
$l['userdata_bad_password_security'] = 'รหัสผ่านที่คุณป้อนไม่ถูกเช่นเดียวกับชื่อผู้ใช้หรือที่อยู่อีเมลของคุณ กรุณากรอกรหัสผ่านแข็งแกร่งขึ้น';

$l['userdata_missing_email'] = 'คุณไม่ได้ป้อนที่อยู่อีเมล';
$l['userdata_invalid_email_format'] = 'ที่อยู่อีเมลที่คุณป้อนไม่ถูกต้อง กรุณาใส่อีเมล์ที่ถูกต้อง';
$l['userdata_emails_dont_match'] = 'ที่อยู่อีเมลที่คุณป้อนเไม่ตรงกันกรุณายืนยันที่อยู่อีเมลของคุณให้ถูกต้อง';
$l['userdata_banned_email'] = "ที่อยู่อีเมลที่คุณป้อนไม่อนุญาตให้ใช้ในขณะนี้ โปรดป้อนที่อยู่อีเมลใหม่ที่ต่างจากเดิม.";
$l['userdata_email_already_in_use'] = "ที่อยู่อีเมลที่คุณป้อนมีสมาชิกท่านอื่นใช้อยู่แล้ว กรุณาใช้อีเมลอื่น.";

$l['userdata_dob_required'] = "คุณยังไม่เลือกวันเกิดของคุณ กรุณาเลือกวันเกิดของคุณเพื่อดำเนินการต่อ คุณสามารถซ่อนวันเกิดของคุณได้ถ้าไม่ต้องการให้คนอื่นเห็น";
$l['userdata_invalid_website'] = 'ที่อยู่เว็บไซต์ที่คุณป้อนไม่ถูกต้อง กรุณาใส่ที่อยู่เว็บไซต์ที่ถูกต้องหรืปล่อยให้ว่างไว้';
$l['userdata_invalid_icq_number'] = 'หมายเลข ICQ ที่คุณป้อนไม่ถูกต้อง กรุณากรอกหมายเลข ICQ ที่ถูกต้องหรือปล่อยให้ว่างไว้';
$l['userdata_invalid_birthday'] = 'คุณใส่วันเกิดผิด. กรุณาใส่ใหม่ให้ถูกต้อง';
$l['userdata_invalid_birthday_coppa'] = 'เพื่อตรวจสอบอายุของคุณกรุณาใส่ปีที่คุณเกิด คุณสามารซ่อนอายุและวันเกิดของคุณได้ในตัวเลือกโปรไฟล์ของคุณ';
$l['userdata_invalid_birthday_coppa2'] = 'คุณต้องมีอายุอย่างน้อย 13 ปีขึ้นไปถึงจะเป็นสมาชิกกระดานสนทนานี้ได้ กรุณาติดต่อผู้ดูแลระบบ.';
$l['userdata_invalid_birthday_privacy'] = 'โปรดเลือกตัวเลือกความเป็นส่วนตัวของวันเกิด';
$l['userdata_invalid_referrer'] = 'อ้างอิงที่คุณป้อนไม่อยู่ กรุณาใส่อ้างอิงที่มีอยู่หรือปล่อยว่างไว้';
$l['userdata_invalid_language'] = 'ภาษาที่คุณเลือกไม่มีอยู่ กรุณาเลือกภาษาที่มีอยู่';
$l['userdata_invalid_style'] = 'รูปแบบที่คุณเลือกไม่ถูกต้อง กรุณาเลือกรูปแบบที่ถูกต้อง';
$l['userdata_missing_returndate'] = 'วันที่ย้อนกลับที่คุณระบุขาดหายไปฟิลด์หนึ่งหรือมากกว่า. กรุณาให้แน่ใจว่าคุณได้กรอกเขตข้อมูลวันเดือนและปีอย่างถูกต้อง';
$l['userdata_missing_required_profile_field'] = 'คุณไม่ได้ป้อนตัวเลือกสำหรับการ "{1}" ข้อมูล กรุณากรอกข้อมูลหรือเลือกค่าสำหรับฟิลด์นี้';
$l['userdata_bad_profile_field_value'] = 'คุณไม่ได้ป้อนค่าที่ถูกต้องสำหรับ "{1}" ข้อมูล กรุณาใส่ค่าที่ถูกต้องก่อนดำเนินการต่อ';
$l['userdata_bad_profile_field_values'] = 'คุณไม่ได้เลือกตัวเลือกที่ถูกต้องสำหรับ "{1}" ข้อมูล เลือกค่าจากตัวเลือกที่นำเสนอ';
$l['userdata_max_limit_reached'] = 'คุณป้อนตัวเลขที่ไม่ถูกต้องของตัวอักษรสำหรับ "{1}" ข้อมูล กรุณากรอกข้อมูลลงในฟิลด์นี้ไม่เกิน {2}ตัวอักษร.';
$l['userdata_invalid_checkfield'] = "ได้รับการตรวจพบแบบฟอร์มนี้ได้รับการส่งมาจากสแปมบอท หากนี่เป็นข้อผิดพลาดกรุณาติดต่อผู้ดูแล";
$l['userdata_invalid_postnum'] = "จำนวนโพสต์ที่คุณป้อนไม่ถูกต้อง กรุณาใส่จำนวนโพสต์ที่ถูกต้อง หรือปล่อยว่างไว้.";
$l['userdata_invalid_threadnum'] = "จำนวนกระทู้ที่คุณป้อนไม่ถูกต้องกรุณาใส่จำนวนที่ถูกต้องหรือปล่อยว่างไว้";

$l['userdata_too_many_sig_images'] = "เราจะเสียใจ แต่เราไม่สามารถปรับปรุงลายเซ็นของคุณเพราะมันมีภาพมากเกินไป โปรดลบภาพบางส่วนจากลายเซ็นของคุณเพื่อดำเนินการต่อ";
$l['userdata_too_many_sig_images2'] = "<strong>บันทึก:</strong>จำนวนเงินสูงสุดของภาพสำหรับลายเซ็นคือ {1}";
$l['userdata_sig_too_long'] = "คุณไม่สามารถปรับปรุงลายเซ็นของคุณเพราะมันยาวเกินไป ความยาวสูงสุดสำหรับลายเซ็นคือ {1} ตัวอักษร ";
$l['userdata_sig_remove_chars_plural'] = "โปรดลบ {1} ตัวอักษรและลองอีกครั้ง";
$l['userdata_sig_remove_chars_singular'] = "โปรดลบ 1 ตัวอักษรและลองอีกครั้ง";
