<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['pmdata_too_long_subject'] = 'ชื่อหัวเรื่องของข้อความส่วนตัวของคุณยาวเกินไป กรุณาใส่หัวเรื่องที่สั้นกว่านี้';
$l['pmdata_code_no_subject'] = '[ไม่มีหัวเรื่อง]';
$l['pmdata_missing_subject'] = 'คุณยังไม่ได้ใส่ชื่อเรื่องสำหรับข้อความของคุณกรุณาใส่ชื่อเรื่องก่อน';
$l['pmdata_missing_message'] = 'คุณไม่ได้ใส่เนื้อหาของข้อความที่จะส่งกรุณาใส่เนื้อหาข้อความก่อน';
$l['pmdata_invalid_recipients'] = "ผู้รับที่คุณระบุไม่ได้ลงทะเบียนชื่อผู้ใช้อย่างถูกต้อง: {1}";
$l['pmdata_no_recipients'] = "คุณยังไม่ใด้ใส่ชื่อผู้รับข้อความนี้กรุณาใส่ชื่อผู้รับอย่างน้อยหนึ่งชื่อถึงจะส่งข้อความได้";
$l['pmdata_too_many_recipients'] = "คุณต้องได้รับอนุญาตเท่านั้นที่จะส่งข้อความไปยัง {1} ผู้ใช้งานในช่วงเวลา";
$l['pmdata_recipient_is_ignoring'] = "คุณไม่สามารถส่งข้อความไปยัง {1} เพราะคุณอยู่ในรายชื่อของกลุ่มที่เขาไม่สนใจ";
$l['pmdata_recipient_has_buddy_only'] = "คุณไม่สามารถส่งข้อความไปยัง {1} เพราะคุณไม่ได้อยู่ในรายชื่อเพื่อนของพวกเขา";
$l['pmdata_recipient_pms_disabled'] = '{1}ได้ปิดการใช้งานการส่งข้อความส่วนตัว คุณไม่สามารถส่งข้อความส่วนตัวไปยังผู้ใช้นี้ได้';
$l['pmdata_recipient_reached_quota'] = '{1} โควต้าข้อความส่วนตัวเต็มแล้วคุณไม่สามารถส่งข้อความส่วนตัวถึงเขาได้อีก';

$l['pmdata_pm_flooding'] = 'คุณพยายามที่จะส่งข้อความไปเร็วเกินไปหลังจากที่ส่งข้อความไปก่อนหน้านี้ โปรดรอสักครู่ {1} วินาที';
$l['pmdata_pm_flooding_one_second'] = 'คุณพยายามที่จะส่งข้อความไปเร็วเกินไปหลังจากที่ส่งข้อความก่อนหน้า โปรดรอสักครู่ 1 วินาที';
