<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
  //ภาษาไทย โดย http://www.mybbthai.com

 */

$l['nav_editpost'] = "แก้ไขโพสต์";
$l['edit_post'] = "แก้ไขโพสต์นี้";
$l['delete_post'] = "ลบโพสต์";
$l['delete_q'] = "ลบ?";
$l['delete_1'] = "หากต้องการลบข้อความนี้ สามารถทำได้โดยติ๊กเครื่องหมายที่กล่องด้านซ้ายมือ จากนั้นคลิก <strong>ลบข้อความ</strong> ทางด้านขวามือ";
$l['delete_2'] = "<b>หมายเหตุ:</b> หากข้อความนี้เป็นข้อความแรกของกระทู้ คำสั่งนี้จะเป็นการลบกระทู้ออกไปด้วย";
$l['subject'] = "หัวข้อกระทู้";
$l['your_message'] = "ข้อความ";
$l['post_options'] = "ตัวเลือกเพิ่มเติม:";
$l['editreason'] = "เหตุผลที่แก้ไข:";
$l['options_sig'] = "<strong>ลายเซ็น:</strong> ใส่ลายเซ็นลงในข้อความ (เฉพาะสมาชิกที่ลงทะเบียนเท่านั้น)";
$l['options_emailnotify'] = "<strong>การแจ้งเตือนทางอีเมล:</strong> รับอีเมลแจ้งเตือนเมื่อมีการตอบข้อความนี้ (เฉพาะสมาชิกที่ลงทะเบียนเท่านั้น)";
$l['options_disablesmilies'] = "<strong>ไม่ใช้ภาพแสดงอารมณ์:</strong> ไม่แสดงภาพแสดงอารมณ์ในโพสต์นี้";
$l['preview_post'] = "ดูตัวอย่างโพสต์";
$l['update_post'] = "ปรับปรุงโพสต์";
$l['poll'] = "แบบสำรวจ:";
$l['poll_desc'] = "คุณสามารถสร้างแบบสำรวจสำหรับกระทู้นี้ได้";
$l['poll_check'] = "ฉันต้องการสร้างแบบสำรวจ";
$l['num_options'] = "จำนวนตัวเลือก:";
$l['max_options'] = "(สูงสุด: {1})";
$l['delete_now'] = "ลบตอนนี้";
$l['edit_time_limit'] = "ขออภัย คุณไม่สามารถแก้ไขโพสต์ของคุณได้ ผู้ดูแลระบบได้ตั้งค่าการแก้ไขโพสต์ต้องกระทำภายใน {1} นาทีหลังจากการโพสต์เท่านั้น";
$l['no_prefix'] = "ไม่มีคำนำหน้า";

$l['redirect_nodelete'] = "โพสต์ยังไม่ถูกลบ เนื่องจากคุณไม่ได้ทำเครื่องหมายในช่อง \"ลบ?\"";
$l['redirect_norestore'] = "โพสต์ยังไม่ถูกเรียกคือนเนื่องจากคุณยังไม่ทำเครื่องหมายในช่อง \"เรียกคืน\" ";
$l['redirect_postedited'] = "ขอบคุณ ข้อความนี้ถูกปรับปรุงเรียบร้อยแล้ว<br />";
$l['redirect_postedited_redirect'] = "คุณกำลังจะกลับไปยังกระทู้";
$l['redirect_postedited_poll'] = "ขอบคุณ...ข้อความนี้ถูกแก้ไขเรียบร้อยแล้ว <br />เนื่องจากคุณได้เลือกตัวเลือกสร้างแบบสำรวจ ดังนั้น คุณกำลังจะไปยังหน้าสร้างแบบสำรวจ";
$l['error_invalidpost'] = "ขออภัย ดูเหมือนว่าที่อยู่ของข้อความจะไม่ถูกต้อง กรุณาตรวจสอบที่อยู่ของข้อความและทดลองอีกครั้ง";
$l['redirect_threaddeleted'] = "ขอบคุณ กระทู้ถูกลบเรียบร้อยแล้ว<br />คุณกำลังจะกลับไปยังหน้าแสดงรายการกระทู้";
$l['redirect_postdeleted'] = "ขอบคุณ.. ข้อความถูกลบเรียบร้อยแล้ว<br />คุณกำลังจะกลับไปยังกระทู้";
$l['redirect_threadrestored'] = "ขอบคุณ กระทู้ซ่อมแซมเสร็จแล้ว<br />เรากำลังจะพาคุณกลับไปยังหัวข้อ";
$l['redirect_postrestored'] = "ขอบคุณมากกระทู้ถูกเรียกคืนสำเร็จแล้ว<br />เรากำลังพาคุณกลับไปยังหน้ากระทู้";
$l['redirect_threadclosed'] = "คุณไม่สามารถแก้ไขข้อความในกระทู้นี้ได้เนื่องจากกระทู้นี้ถูกปิดโดยผู้ดูแลแล้ว";
$l['redirect_post_moderation'] = "ผู้ดูแลระบบได้ตั้งค่าการแก้ไขทั้งหมดของข้อความว่าจะต้องผ่านการตรวจสอบโดยผู้ตรวจสอบ คุณกำลังจะไปยังกระทู้";
$l['redirect_thread_moderation'] = "ผู้ดูแลระบบได้ตั้งค่าการแก้ไขทั้งหมดของกระทู้จะต้องผ่านการตรวจสอบโดยผู้ตรวจสอบ คุณกำลังจะไปยังหน้าแรกของเว็บบอร์ด";
$l['error_already_delete'] = "ขออภัยโพสต์นี้จะถูกลบแล้ว";

$l['thread_deleted'] = "ลบกระทู้อย่างถาวร";
$l['post_deleted'] = "ลบโพสต์อย่างถาวร";
$l['thread_soft_deleted'] = "ลบกระทู้แบบรีไซเคิล";
$l['post_soft_deleted'] = "ลบกระทู้แบบรีไซเคิล์";
$l['thread_restored'] = "กระทู้เรียกคืน";
$l['post_restored'] = "โพสต์เรียกคืน";

$l['error_already_deleted'] = 'โพสต์ที่เลือกได้ถูกลบไปแล้ว';
