<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['nav_group_management'] = "{1} การจัดการกลุ่ม";
$l['nav_join_requests'] = "การร้องขอเข้าร่วม";
$l['nav_group_memberships'] = "สมาชิกในกลุ่ม";

$l['not_leader_of_this_group'] = "ขออภัย คุณจะไม่ได้เป็นผู้นำของกลุ่มผู้ใช้นี้";
$l['invalid_group'] = "กลุ่มผู้ใช้นี้ไม่มีอยู่";
$l['pending_requests'] ="รอดำเนินการการร้องขอเข้าร่วม";
$l['num_requests_pending'] = "ขณะนี้มี<strong>{1}</strong> อยู่ระหว่างการพิจารณาคำขอเข้าร่วมสำหรับกลุ่มผู้ใช้นี้";
$l['group_management'] = "การจัดการกลุ่ม";
$l['members_of'] = "สมาชิกใน \"{1}\"";
$l['user_name'] = "ชื่อผู้ใช้";
$l['contact'] = "ติดต่อ";
$l['reg_date'] = "ลงทะเบียน";
$l['post_count'] = "โพสต์";
$l['remove_selected'] = "ลบผู้ใช้เลือกจากกลุ่ม";
$l['add_member'] = "เพิ่มสมาชิกไป \"{1}\"";
$l['add_member_submit'] = "เพิ่มสมาชิกไปกลุ่ม";
$l['invite_member'] = "ขอเชิญสมาชิก \"{1}\"";
$l['invite_member_submit'] = "เชิญสมาชิกกลุ่ม";
$l['join_requests'] = "การร้องขอเข้าร่วม";
$l['join_requests_title'] = "เข้าร่วมการร้องขอ \"{1}\"";
$l['leader'] = "(ผู้นำ)";
$l['reason'] ="เหตุผล";
$l['accept'] = "ยอมรับ";
$l['ignore'] = "ไม่สนใจ";
$l['decline'] = "ปฏิเสธ";
$l['action_requests'] = "ดำเนินกระทำ";
$l['join_requests_moderated'] = "คำขอเข้าร่วมได้รับการตรวจสอบ.<br />ตอนนี้คุณจะได้รับรายชื่อที่ร้องขอ";
$l['no_requests'] = "ตอนนี้ไม่มีที่อยู่ระหว่างดำเนินการขอเข้าร่วมกลุ่มนี้";
$l['no_users'] = "มีผู้ใช้ไม่อยู่ในกลุ่มนี้.";
$l['user_added'] = "ผู้ใช้ที่ได้รับการบันทึกอยู่ในกลุ่มผู้ใช้";
$l['users_removed'] = "ผู้ใช้ที่เลือกได้ถูกลบออกจากกลุ่มผู้ใช้.";
$l['group_no_members'] = "ขณะนี้มีสมาชิกในกลุ่มนี้.<br />เพื่อกลับไปยังหน้าการจัดการกลุ่ม,คลิก <a href=\"usercp.php?action=usergroups\">ที่นี่</a>.";
$l['group_public_moderated'] = "กลุ่มผู้ใช้นี้จะเป็นกลุ่มผู้ใช้ที่สาธารณะที่ทุกคนสามารถเข้าร่วมได้  ทุกคำขอเข้าร่วมจะต้องมีการตรวจสอบโดยกลุ่มผู้ดูแล";
$l['group_public_not_moderated'] = "กลุ่มผู้ใช้นี้จะเป็นกลุ่มผู้ใช้ที่สาธารณะที่ทุกคนสามารถเข้าร่วมได้อย่างอิสระ";
$l['group_public_not_moderated'] = "กลุ่มผู้ใช้กลุ่มนี้เป็นกลุ่มผู้ใช้สาธารณะที่ทุกคนสามารถเข้าร่วมได้อย่างอิสระ";
$l['group_public_invite'] = "กลุ่มผู้ใช้กลุ่มนี้เป็นกลุ่มผู้ใช้สาธารณะที่ต้องมีการเชิญจากกลุ่มผู้นำในการที่จะเข้าร่วม";
$l['group_private'] = "กลุ่มผู้ใช้นี้จะเป็นกลุ่มผู้ใช้ส่วนตัว เฉพาะผู้ใช้เพิ่มโดยผู้นำกลุ่มสามารถเป็นส่วนหนึ่งของกลุ่มนี้.";
$l['group_default'] = "กลุ่มผู้ใช้นี้จะเป็นกลุ่มผู้ใช้หลัก.";
$l['group_leaders'] = "ผู้นำกลุ่ม";
$l['search_user'] = "ค้นหาผู้ใช้ใน";
$l['no_users_selected'] = "ขออภัย ดูเหมือนจะไม่ได้รับการคัดเลือกในการกำจัด<br />กรุณากลับไปและเลือกผู้ใช้ที่คุณต้องการลบออกจากกลุ่มนี้";

$l['error_alreadyingroup'] = "ผู้ใช้ที่ระบุมีอยู่แล้วเป็นส่วนหนึ่งของกลุ่มผู้ใช้ ..";
$l['error_alreadyinvited'] = "ผู้ใช้ที่ระบุได้รับเชิญแล้ว.";

$l['user_invited'] = "ผู้ที่ได้รับเชิญให้เข้าร่วมกลุ่มผู้ใช้";
$l['invite_pm_subject'] = "คุณได้รับเชิญให้เข้าร่วม \"{1}\"";
$l['invite_pm_message'] = "คุณได้รับเชิญให้เข้าร่วมกลุ่มผู้ใช้ \"{1}\".

กรุณาดำเนินการที่คุณจะเข้าร่วม,  [url={2}/usercp.php?action=usergroups]กลุ่ม[/url] หน้าและคลิก 'รับเชิญ'คำเชิญนี้ไม่หมดอายุ.";

This invitation does not expire.";
$l['invite_pm_message_expires'] = "คุณได้รับเชิญให้เข้าร่วมกลุ่มผู้ใช้ \"{1}\".

ที่จะเข้าร่วมโปรดดำเนินการต่อไปของคุณ[url={2}/usercp.php?action=usergroups]สมาชิกในกลุ่ม[/url] หน้าและ'ยอมรับคำเชิญ'.

This invite will expire {3} วันที่แล้ว";

