<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['nav_newreply'] = "ตอบกระทู้";

$l['post_reply_to'] = "ตอบกลับโพสต์ {1}";
$l['post_new_reply'] = "ตอบกลับโพสต์ใหม่";
$l['reply_to'] = "ตอบกระทู้: {1}";
$l['post_subject'] = "หัวข้อกระทู้:";
$l['your_message'] = "ข้อความของคุณ:";
$l['post_options'] = "ตัวเลือกเพิ่มเติม:";
$l['options_sig'] = "<strong>เปิดใช้งานแสดงรายเซ็น:</strong> เมื่อเปิดใช้งานนี้จะแสดงรายเซ็นของคุณที่ใต้โพสต์(สำหรับสมาชิกเท่านั้น)";
$l['options_emailnotify'] = "<strong>การแจ้งเตือนอีเมล:<strong>การแจ้งเตือนทางอีเมล:</strong> รับอีเมลแจ้งเตือนเมื่อมีการตอบกระทู้นี้ (เฉพาะสมาชิกที่ลงทะเบียนเท่านั้น)";
$l['options_disablesmilies'] = "<strong>ปิดการใช้งานภาพแสดงอารมณ์:</strong> เมื่อเลือกปิดการใช้งานรูปภาพแสดงอารมณ์จะไม่แสดงในโพสต์ของคุณ แต่จะแสดงเป็นโค้ดแทน";
$l['post_reply'] = "ตอบกระทู้";
$l['preview_post'] = "ดูตัวอย่างโพสต์";
$l['mod_options'] ="ตัวเลือกการตรวจสอบ:";
$l['close_thread'] = "<strong>ปิดกระทู้</strong>: เมื่อคุณเลือกปิดกระทู้ กระทู้นี้จะไม่สามารถตอบหรือแสดงความคิดเห็นได้อีก";
$l['stick_thread'] = "<strong>ปักหมุดกระทู้</strong> เมื่อคุณเลือกปักหมุดกระทู้นี้จะถูกติดไว้บนหัวบอร์ดทำให้สามารถค้นหาเจอได้ง่ายขึ้น";
$l['forum_rules'] = "{1} - กฎระเบียบ";
$l['thread_review'] = "แสดงกระทู้ (ใหม่สุดอยู่บน)";
$l['thread_review_more'] = "กระทู้นี้มีมากกว่า {1} ตอบ. <a href=\"{2}\">อ่านกระทู้แล้วทั้งหมด.</a>";
$l['posted_by'] = "โพสต์โดย";
$l['draft_saved'] = "โพสต์ใหม่บันทึกเป็นร่างประสบความสำเร็จ<br />ตอนนี้คุณจะได้รับรายชื่อร่างของคุณ";
$l['error_post_already_submitted'] = "คุณได้โพสแล้วตอบกลับไปยังหัวข้อที่กำหนด โปรดไปที่หัวข้อเพื่อดูการตอบของคุณ.";
$l['multiquote_external_one'] = "คุณได้เลือกหนึ่งโพสต์ด้านนอกของหัวข้อนี้.";
$l['multiquote_external'] = "คุณได้เลือก {1} พสต์ด้านนอกของกระทู้นี้";
$l['multiquote_external_one_deselect'] = "ยกเลิกการโพสต์นี้";
$l['multiquote_external_deselect'] = "ยกเลิกการเลือกโพสต์เหล่านี้";
$l['multiquote_external_one_quote'] = "อ้างโพสต์นี้ด้วย";
$l['multiquote_external_quote'] = "อ้างโพสต์เหล่านี้ด้วย ";

$l['redirect_newreply'] = "ขอบคุณ การตอบกระทู้ของคุณถูกบันทึกเรียบร้อยแล้ว";
$l['redirect_newreply_moderation'] = "ผู้ดูแลระบบได้ระบุให้การโพสใหม่ทั้งหมดต้องการการดำเนินการ เรากำลังพาคุณกลับไปยังหน้าหัวข้อ";
$l['redirect_newreply_post'] = "<br />ตอนนี้คุณจะถูกนำไปที่โพสต์ของคุณ";
$l['redirect_newreplyerror'] = "ขออภัยตอบกลับของคุณได้รับการปฏิเสธเพราะขาดเนื้อหา <br />คุณกำลังจะกลับไปที่หัวข้อ";
$l['redirect_threadclosed'] = "คุณไม่สามารถตอบกระทู้นี้ได้ เนื่องจากกระทู้นี้ถูกปิดโดยผู้ตรวจสอบแล้ว";
$l['error_post_noperms'] = "คุณไม่ได้รับสิทธิในการแก้ไขแบบร่างน";


$l['error_stop_forum_spam_spammer'] = 'ขออภัยชื่อผู้ใช้หรือที่อยู่ IP ของคุณตรงกับที่ของสแปม ถ้าคุณรู้สึกว่านี้เป็นความผิดพลาดกรุณาติดต่อผู้ดูแล';
$l['error_stop_forum_spam_fetching'] = 'ขออภัยสิ่งที่ผิดพลาดในการตรวจสอบคำตอบของคุณกับฐานข้อมูลพวกสแปมเข้าถึงกันได้ โปรดลองอีกครั้งในภายหลัง.';

$l['error_suspendedposting'] = "สิทธิ์การโพสต์ของคุณจะถูกหยุดไว้ชั่วขณะ {1}.<br /><br />

ระงับวันที่: {2}";
$l['error_suspendedposting_temporal'] = "จนกระทั่ง {1}";
$l['error_suspendedposting_permanent'] = "อย่างถาวร";

