<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['nav_newthread'] = "ตั้งกระทู้ใหม่";
$l['newthread_in'] = "ตั้งกระทู้ใหม่ใน {1}";
$l['post_new_thread'] = "ตั้งกระทู้ใหม่";
$l['thread_subject'] = "หัวข้อกระทู้";
$l['your_message'] = "ข้อความของคุณ:";
$l['post_options'] = "ตัวเลือกเพิ่มเติม:";
$l['options_sig'] = "<b>เปิดใช้งานแสดงลายเซ็น:</b> หากเปิดใช้งาน รายเซ็นของคุณจะแสดงอยู่ใต้กระทู้ของคุณ (เฉพาะสมาชิกที่ลงทะเบียนเท่านั้น)";
$l['options_emailnotify'] = "<b>แจ้งเตือนผ่านทาง อีเมล:</b> ได้รับอีเมลเมื่อมีการตอบกระทู้ใหม่. (เฉพาะสมาชิกที่ลงทะเบียนเท่านั้น)";
$l['options_disablesmilies'] = "<b>ภาพแสดงอารมณ์:</b> ปิดการใช้งานภาพแสดงอารมณ์ในโพสต์นี้";
$l['post_thread'] = "ตั้งกระทู้";
$l['preview_post'] = "ดูตัวอย่าง";
$l['poll'] = "แบบสำรวจ:";
$l['poll_desc'] = "สร้างแบบสำรวจสำหรับกระทู้นี้";
$l['poll_check'] = "ฉันต้องการสร้างแบบสำรวจ";
$l['num_options'] = "จำนวนของตัวเลือก:";
$l['max_options'] = "(จำนวนสูงสุด: {1})";
$l['mod_options'] ="ตัวเลือกการจัดการ:";
$l['close_thread'] = "<b>ปิดกระทู้</b>: งดการตอบข้อความสำหรับกระทู้นี้แต่สามารถเข้าชมได้";
$l['stick_thread'] = "<b>ปักหมุดกระทู้:</b> ปักหมุดหัวข้อกระทู้นี้ยังด้านบนของฟอรั่มเฟื่อให้สามารถหาเจอได้ง่าย";
$l['draft_saved'] = "กระทู้ถูกบันทึกเป็นแบบร่างเรียบร้อยแล้ว<br />คุณกำลังจะไปยังหน้ารายการแบบร่าง";
$l['error_post_already_submitted'] = "คุณได้โพสต์หัวข้อนี้แล้วในฟอรั่มนี้ กรุณาเยี่ยมชมกระทู้ของคุณ.";
$l['no_prefix'] = "ไม่มีคำนำหน้า";
$l['forum_rules'] = "{1} - กฎระเบียบ";

$l['multiquote_external_one'] = "คุณได้อ้างอิงข้อความบางอย่างมาจากโพสต์อื่น.";
$l['multiquote_external'] = "คุณได้เลือก {1} โพสจากกระทู้อื่น ๆ.";
$l['multiquote_external_one_deselect'] = "หรือยกเลิกไม่ต้องใช้กับโพสต์นี้";
$l['multiquote_external_deselect'] = "ยกเลิกการเลือกข้อความเหล่านี้";
$l['multiquote_external_one_quote'] = "ใช้อ้างในโพสต์นี้";
$l['multiquote_external_quote'] = "อ้างข้อความเหล่านี้มากเกินไป";

$l['redirect_newthread'] = "ขอขอบคุณหัวข้อของคุณได้รับการโพสต์แล้ว.";
$l['redirect_newthread_poll'] = "<br />คุณจะถูกนำไปยังตัวเลือกสำรวจและหน้าการกำหนดค่า";
$l['redirect_newthread_moderation'] = "<br />ผู้ดูแลระบบได้ระบุว่าหัวข้อใหม่ต้องดูแลได้ทั้งหมดตอนนี้คุณจะถูกนำกลับไปยังรายชื่อกระทู้.";
$l['redirect_newthread_unviewable'] = "<br />คุณไม่ได้รับอนุญาตให้ดูหัวข้อในฟอรั่มนี้ ตอนนี้คุณกำลังจะกลับไปหน้าฟอรั่ม";
$l['redirect_newthread_thread'] = "<br />ตอนนี้คุณกำลังไปยังหัวข้อใหม่";
$l['invalidthread'] = "ร่างที่ระบุไม่มีอยู่หรือคุณไม่ได้รับอนุญาตให้ดูมัน.";

$l['error_stop_forum_spam_spammer'] = 'ขออภัยชื่อผู้ใช้หรือที่อยู่ IP ของคุณตรงกับที่ของสแปม ถ้าคุณรู้สึกว่านี้เป็นความผิดพลาดกรุณาติดต่อผู้ดูแล ';
$l['error_stop_forum_spam_fetching'] = 'ขอโทษสิ่งที่ผิดพลาดในการตรวจสอบหัวข้อของคุณกับฐานข้อมูลสแปม โปรดลองอีกครั้งในภายหลัง';

$l['error_suspendedposting'] = "สิทธิ์การโพสต์ของคุณจะถูกหยุดไว้ชั่วขณะ {1}.<br /><br />

ระงับวันที่: {2}";
$l['error_suspendedposting_temporal'] = "จนกระทั่ง {1}";
$l['error_suspendedposting_permanent'] = "อย่างถาวร";

