<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['nav_postpoll'] = "โพสต์สำรวจ";
$l['nav_editpoll'] = "แก้ไขสำรวจ";
$l['nav_pollresults'] = "ผลสำรวจ";

$l['edit_poll'] = "แก้ไขสำรวจ";
$l['delete_poll'] = "ลบสำรวจ";
$l['delete_q'] = "ลบ?";
$l['delete_note'] = "ในการลบการสำรวจนี้ให้ตรวจสอบกล่องทางด้านซ้ายและคลิกที่ปุ่มไปทางขว";
$l['delete_note2'] = "<b>หมายเหตุ:</b> เมื่อการสำรวจนี้ได้ถูกลบไปแล้วจะไม่สามารถเรียกคืนได้อีก";
$l['question'] = "คำถาม:";
$l['num_options'] = "จำนวนของตัวเลือก:";
$l['max_options'] = "สูงสุด:";
$l['poll_options'] = "ตัวเลือกสำรวจความคิดเห็น:";
$l['update_options'] = "อัพเดทตัวเลือก";
$l['poll_options_note'] = "ตัวเลือกในแบบสอบถามควรจะสั้นและตรงประเด็น";
$l['options'] = "ตัวเลือก:";
$l['option_multiple'] = "<b>อนุญาตให้เลือกใด้หลายช้อย:</b> ผู้ใช้สามารถออกเสียงลงคะแนนได้มากกว่าหนึ่งตัวเลือก";
$l['option_multiple_maxoptions'] = "จำนวนสูงสุดของตัวเลือกต่อผู้ใช้ (ใส่ 0 สำหรับไม่มีขีดจำกัด):";
$l['option_public'] = "<b>ตั้งเป็นสาธารณะ:</b> หากเลือกตั้งเป็นสาธารณะผู้ที่เข้าร่วมจะสามารถดูคะแนนการสำรวจของคนอื่นๆใด้.";
$l['option_closed'] = "<b>ปิดการสำรวจ:</b> หากการตรวจสอบการสำรวจความคิดเห็นจะปิดตั้งแต่การออกเสียงลงคะแนน";
$l['poll_timeout'] = "หมดเวลาการสำรวจ:";
$l['timeout_note'] = "จำนวนวันที่ผู้คนสามารถลงคะแนนในการสำรวจนี้<br />(ถ้าไม่ต้องการให้การสำรวจนี้หมดเวลาให้ตั่งค่าเป็น 0)";
$l['days_after'] = "หลังจากวันที่:";
$l['update_poll'] = "อัพเดทการสำรวจ";
$l['option'] = "ตัวเลือก";
$l['votes'] = "การลงคะแนน:";
$l['post_new_poll'] = "การสำวจใหม่";
$l['days'] = "วัน";
$l['poll_results'] = "ผลสำรวจ";
$l['poll_total'] = "ทั้งหมด:";
$l['poll_votes'] = "การลงคะแนน";

$l['redirect_pollposted'] = "การสำรวจความคิดเห็นของคุณได้รับการโพสต์<br />เรากำลังพาคุณกลับไปที่หัวข้อ.";
$l['redirect_pollpostedmoderated'] = "การสำรวจความคิดเห็นของคุณได้รับการโพสต์ แต่หัวข้อของคุณยังคงรอการกลั่นกรอง<br />คุณกำลังกลับไปยังฟอรั่ม";
$l['redirect_pollupdated'] = "การสำรวจได้รับการปรับปรุง<br />คุณกำลังกลับไปยังหัวข้อ";
$l['redirect_votethanks'] = "ขอขอบคุณสำหรับการออกเสียงลงคะแนน<br />คุณกำลังกลับไปยังหัวข้อ";
$l['redirect_unvoted'] = "การโหวตของคุณ ในหัวข้อนี้ได้ถูกลบออก.<br />คุณกำลังกลับไปยังหัวข้อ";
$l['redirect_polldeleted'] = "ขอขอบคุณ การสำรวจความคิดเห็นได้ถูกลบออกจากกระทู้สำเร็จแล้ว.<br /> คุณจะถูกนำกลับไปยังหัวข้อ";

$l['error_polloptiontoolong'] = "ตัวเลือกในแบบสอบถามที่คุณป้อนมีความยาวกว่าขีดจำกัด ที่ยอมรับได้ กรุณากลับไปแก้ไขให้น้อยลงอีก";
$l['error_noquestionoptions'] = "คุณอาจไม่ได้ป้อนคำถามแบบสำรวจของคุณ ต้องมีตัวเลือกจำนวนขั้นต่ำของตัวเลือกในแบบสอบอย่างน้อย 2 ข้อ<br />กรุณากลับไปแก้ไขข้อผิดพลาดนี้.";
$l['error_pollalready'] = "กระทู้สำรวจความคิดเห็นมีอยู่แล้ว!";
$l['error_nopolloptions'] = "ตัวเลือกการสำรวจความคิดเห็นระบุไม่ถูกต้องหรือไม่มีอยู่.";
$l['error_maxpolloptions'] = "คุณได้ลงคะแนนสำหรับตัวเลือกมากเกินไป คุณไม่ไดอนุญาตให้ลงคะแนนใด้ {1} คะแนน<br />กรุณากลับไปและลองอีกครั้ง.";
$l['error_alreadyvoted'] = "คุณได้ลงคะแนนแล้วในการสำรวจนี้.";
$l['error_notvoted'] = "คุณยังไม่ได้ลงคะแนนในการสำรวจนี้.";
$l['error_invalidpoll'] = "การสำรวจความคิดเห็นระบุไม่ถูกต้องหรือไม่มีอยู่.";
$l['error_pollclosed'] = "คุณไม่สามารถลงคะแนนในแบบสำรวจความคิดเห็นที่ได้รับการปิด.";
$l['poll_time_limit'] = "ขออภัย คุณไม่สามารถเพิ่มความคิดเห็นหัวข้อของคุณ ผู้ดูแลระบบได้ตั้งค่าให้เพิ่มใด้เฉพาะภายใน {1} ชั่วโมงของการโพสต์.";

$l['poll_deleted'] = "ลบโพลล์";
$l['poll_edited'] = "แก้ไขโพลล์";
