<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['nav_stats'] = "สถิติเว็บบอร์ด";
$l['stats_disabled'] = "คุณไม่สามารถดูหน้าสถิติได้เนื่องจากได้รับการปิดใช้งานโดยผู้ดูแลระบบ";

$l['board_stats'] = "สถิติเว็บบอร์ด";
$l['none'] = "ไม่มี";
$l['totals'] = "ทั้งหมด";
$l['averages'] = "เฉลี่ย";
$l['posts'] = "โพสต์:";
$l['threads'] = "กระทู้:";
$l['members'] = "สมาชิก:";
$l['ppd'] = "โพสท์ต่อวัน:";
$l['tpd'] = "กระทู้ต่อวัน:";
$l['mpd'] = "สมาชิกต่อวัน:";
$l['ppm'] = "โพสต์ต่อคน:";
$l['tpm'] = "กระทู้ต่อคน:";
$l['rpt'] = "ตอบต่อกระท:";
$l['no_posts'] = "ไม่มี";
$l['general'] = "ข้อมูลทั่วไป";
$l['newest_member'] = "สมาชิกล่าสุด:";
$l['members_posted'] = "สมาชิกที่มีการโพสต์ข้อความ:";
$l['todays_top_poster'] = "สมาชิกที่โพสต์มากที่สุดของวันนี้: <b>{1}</b> (<b>{2}</b> โพสต์)";
$l['popular_forum'] = "หัวข้อยอดนิยม: <b>{1}</b> (<b>{2}</b> โพสต์, <b>{3}</b> กระทู้)";
$l['most_popular'] = "ความนิยมสูงสุด...";
$l['most_replied_threads'] = "กระทู้ที่ได้รับการตอบกลับมากที่สุด";
$l['most_viewed_threads'] = "กระทู้ที่ได้รับการเข้าชมมากที่สุด";
$l['not_enough_info_stats'] = "ขออภัย, ข้อมูลไม่เพียงพอต่อการคำนวนสถิติ ซึ่งอย่างน้อยจะต้องมีสมาชิก 1 คนและมี 1 กระทู้";
$l['replies'] = "ตอบกลับ";
$l['views'] = "เข้าชม";
$l['top_referrer'] = "สุดยอดผู้อ้างอิงมากที่สุด: <strong>{1}</strong> (<strong>{2}</strong> อ้างอิง)";

