<?php
/**
 * MyBB 1.8 English Language Pack
 * Copyright 2014 MyBB Group, All Rights Reserved
 *
 */

$l['no_new_subject'] = "คุณไม่ได้ป้อนเรื่องใหม่";
$l['post_moderation'] = "โพสต์ของคุณอยู่ภายใต้การดูแล";
$l['thread_moderation'] = "หัวข้อของคุณอยู่ภายใต้การดูแล";
$l['post_doesnt_exist'] = "โพสต์ที่ระบุไม่มีอยู่";
$l['thread_doesnt_exist'] = "หัวข้อที่ระบุไม่มีอยู่";
$l['thread_closed_edit_subjects'] = "หัวข้อนี้จะถูกปิดและคุณอาจจะไม่สามารถแก้ไขเรื่อง";
$l['no_permission_edit_subject'] = "คุณไม่ได้รับสิทธิ์ที่จะแก้ไขเรื่องหัวข้อนี้";
$l['thread_closed_edit_message'] = "หัวข้อนี้ถูกปิดและคุณไม่สามารถแก้ไขข้อความที่อยู่ภายใน";
$l['no_permission_edit_post'] = "คุณไม่ได้รับสิทธิ์ในการแก้ไขข้อความนี้";
$l['edit_time_limit'] = "คุณสามารถแก้ไขข้อความเพียง {1} นาทีหลังจากที่พวกเขาถูกโพสต์";
$l['postbit_edited'] = "โพสต์นี้ได้รับการปรับปรุงครั้งสุดท้าย: {1} โดย ";
$l['postbit_editreason'] = "แก้ไขเหตุผล";
$l['save_changes'] = "บันทึกการเปลี่ยนแปลง";
$l['cancel_edit'] = "ยกเลิกการแก้ไข";
$l['answer_valid_not_exists'] = "คำถามที่คุณพยายามจะตอมไม่ได้มีอยู่";
$l['captcha_not_exists'] = "รูปภาพการตรวจสอบภาพที่คุณกำลังพยายามที่จะฟื้นฟูไม่ได้มีอยู่";
$l['captcha_valid_not_exists'] = "ภาพการตรวจสอบภาพที่คุณกำลังพยายามที่จะตรวจสอบดูเหมือนไม่ได้มีอยู่";
$l['captcha_does_not_match'] = "รหัสยืนยันภาพที่คุณป้อนไม่ถูกต้อง กรุณากรอกรหัสใหม่ตามที่ปรากฏในภาพ";
$l['captcha_matches'] = "รหัสยืนยันภาพที่คุณป้อนถูกต้อง";
$l['answer_does_not_match'] = "คำตอบที่คุณป้อนไม่ถูกต้อง";
$l['banned_username'] = "ชื่อผู้ใช้ที่คุณใส่นั้นได้รับการอนุญาตจากผู้ดูแลระบบ";
$l['banned_characters_username'] = "ชื่อผู้ใช้ของคุณประกอบด้วยอย่างน้อยหนึ่งตัวอักษรที่ไม่ถูกต้อง";
$l['complex_password_fails'] = "รหัสผ่านต้องใช้อักษรตัวพิมพ์ใหญ่, อักษรตัวพิมพ์เล็กและตัวเลข";
$l['username_taken'] = "{1} มีการลงทะเบียนแล้วโดยสมาชิกอีกคนหนึ่ง";
$l['username_available'] = "{1} สามารถใช้ได้";
$l['invalid_username'] = "{1} ไม่ได้เป็นชื่อผู้ใช้ของสมาชิกที่ลงทะเบียน";
$l['valid_username'] = "{1} เป็นการอ้างอิงที่ถูกต้อง";
$l['buddylist_error'] = "ดูเหมือนว่าคุณไม่ได้มีเพื่อนที่อยู่ในรายชื่อเพื่อนของคุณ กรุณาเพิ่มเพื่อนบางคน ก่อนที่จะใช้งาน";
$l['close'] = "ปิด";
$l['select_buddies'] = "เลือกเพื่อน";
$l['select_buddies_desc'] = "ในการเพิ่มเพื่อนหลายคนของคุณ ให้เลือกพวกเขาด้านล่างและคลิก ตกลง.";
$l['selected_recipients'] = "เลือกผู้รับ";
$l['ok'] = "ตกลง";
$l['cancel'] = "ยกเลิก";
$l['online'] = "ออนไลน์";
$l['offline'] = "ออฟไลน์";
$l['edited_post'] = "แก้ไขโพสต์";
$l['usergroup'] = "กลุ่มผู้ใช้";
